{
    "Topic": "Indian History",
    "Subject": "Aryans and Vedic Period",
    "data": [
        "1 Which one of the following Vedas contains the Gayatri Mantras ? A Rig-Veda B Sama-Veda C Yajur-Veda D Atharva-Veda Answer: Option [A]",
        "2 Who is the expounder of Yoga Philosophy ? A Gautam B Patanjali C Jamini D Shankaracharya Answer: Option [B]",
        "3 According to Vedic Civilization who was the great law giver ? A Chanakya B Banabhatta C Kaipl D Manu Answer: Option [D]",
        "4 During Rig-Vedic Age the normal form of government was : A Republic B Democracy C Monarchy D None of above Answer: Option [C]",
        "5 The total number of Hymns in Rig-Veda is A 512 B 1024 C 1028 D 1452 Answer: Option [C]",
        "6 'Nishka' was the name of an ornament in Vedic periods but later times it was used to denote a/an : A weapon B script C agricultural implement D coin Answer: Option [D]",
        "7 What was the family of the Rig-Vedic Aryans ? A matrilineal B patriarchal C matriarchal D patrilineal Answer: Option [B]",
        "8 The code of conduct of the vedic society was laid out in which of the following texts ? A Puranas B Vedas C Smritis D Upanishads Answer: Option [C]",
        "9 Beliefs and practices of the non-Aryans are pointed out by the contents of which one of the following Vedas? A Samaveda B Yajurveda C Rigveda D Atharvaveda Answer: Option [D]",
        "10 Which one of the following term was used to denote a group of families in the Vedic society ? A Vish B Jana C Grama D Gotra Answer: Option [B]",
        "11 ‘Mitakshara’ is an authoritative treatise on Hindu law. It was written by: A Manu B Hemadri C Vagneswara D Jimutavahana Answer: Option [C]",
        "12 When did iron began to be used more frequently? A 800 B.C. B 1000 B.C. C 1600 B.C. D 2000 B.C. Answer: Option [B]",
        "13 Which Veda was divided into two parts namely ‘White(sukla)’ and ‘Black(krishna)’ ? A Yajur B Rig C Sama D Atharva Answer: Option [A]",
        "14 The books called Upanishadas are included in which category ? A Philosophy B Law C Religion D Yoga Answer: Option [C]",
        "15 What is the actual number of 'Sutras' of Vedic mathematics ? A 10 B 12 C 14 D 16 Answer: Option [D]",
        "16 In which place the ‘Battle of ten Kings’ or 'Dashradnya Yuddha' was fought? A Parushni(Ravi) B Asikini(Chenab) C Vipas(Beas) D Vitasta(jhelum) Answer: Option [A]",
        "17 Identify the main reason for the evolution of kingship in Vedic society? A Desire to conquer new land B Social security C War spirits D Trade and commerce Answer: Option [A]",
        "18 What is the similarity between the Harappan society and the Rigvedic society? A Female deities B Urban centres C Iron implements D Horses Answer: Option [D]",
        "19 In ancient Indian historical geography, the name ‘Ratnakara’ is used to denote: A the Bey of Bengal B the Arabian Sea C the Indian Ocean D the confluence of the Ganga, the Yamuna and the mythical Saraswati at Prayaga Answer: Option [C]",
        "20 What is ‘Anuloma' according to the Dharmashastras? A is a marriage between a higher caste man and a lower caste woman B is a marriage between a man and a woman of the same caste C is a marriage between a man and a woman of the same gotra D is a marriage between a lower caste man and a higher caste woman Answer: Option [A]",
        "21 What was the main cause behind the famous tribal war which is mentioned in Rigveda as “Battle of Ten Kings” or 'Dashradnya Yuddha'? A Showing supremacy B Intrigues of the leaders C Foreign invassions D Cattle and land disputes Answer: Option [D]",
        "22 According to Dharma-Shastra, what was the rate land revenue ? A 1/4 B 1/6 C 1/8 D 1/9 Answer: Option [B]",
        "23 Purusha sukta is a part of which vedas ? A Rig B Sama C Yajur D Atharva Answer: Option [A]",
        "24 Which of the following tax was collected from the people by the King in Vedic periods? A Varman B Bali C Kara D Vidatha Answer: Option [B]",
        "25 In total number, how many Upanishads in India ? A 104 B 106 C 108 D 109 Answer: Option [C]",
        "26 Name the Veda to which Ayurveda owes its origin : A Rig B Sama C Yajur D Atharva Answer: Option [D]",
        "27 From where the Aryans came to India ? A South-East Asia B Eastern Europe C Central Asia D None of the above Answer: Option [C]",
        "28 The ritualistic precepts attached to the hymns of the Vedas were known as the: A Samhitas B Upanishads C Brahmanas D None of these Answer: Option [C]",
        "29 The Vishnu Purana gives an account of: A the Vardhanas B life in Indus Valley C Mauryan dynastry D Gupta dynastry Answer: Option [C]",
        "30 “War begins in the minds of men” is a famous Vedic saying. It is stated in: A Atharvaveda B Mundaka Upanishad C Samaveda D Rigveda Answer: Option [A]",
        "31 'Veda' has been derived from the word ‘Vid’. What is the meaning of 'Vid'? A God B Knowledge C Holy D Religious Answer: Option [B]",
        "32 Which of the following was unknown in Rigvedic society ? A Polygamy B Purdah system C Polyandry D Child marriage Answer: Option [D]",
        "33 The ninth mandala of the Rigveda samhita is devoted wholly to: A Urvashi and the Heaven B Gods related to plants and drugs C ‘Soma’ and the god who is named after the drink D Narada Answer: Option [C]",
        "34 Which is the oldest Veda? A Yajur B Rig C Atharva D Sama Answer: Option [B]",
        "35 The theory of ‘Arctic Region’ as the original home of Aryans is popularised by: A B.G. Tilak B Raja Ram Mohan Roy C Keith D Max Muller Answer: Option [A]"
    ]
}