{
    "Topic": "Indian History",
    "Subject": "Assam History",
    "data": [
        "1 Name of the first Ahom King was A Sukapha B Suteupha C Subinpha D Sukhampha Answer: Option [A]",
        "2 In which year Sir Shadulla’s Ministry formed? A 1951 B 1950 C 1937 D 1947 Answer: Option [C]",
        "3 Major part of the Kachari kingdom was occupied by the Ahoms during the reign of which of the following kings? A Sukhampha B Sutingpha C Rudra Singha D Suhungmung Answer: Option [D]",
        "4 Rani Gaidula, a famous character of Indian Movement belonged to which tribe? A the Lalung tribes of Assam B the Naga tribes of Assam C the kachari tribes of Assam D the karbi tribes of Assam Answer: Option [B]",
        "5 Mula Gabharu died fighting against A Det Chung B Mir Jumla C Turbak D Mirza Nathan Answer: Option [C]",
        "6 Darrang Desh governed by A Solal Ghain B Barbarua C Sadiya Khowa Gohain D Darrangi Raja Answer: Option [D]",
        "7 Provincial Self-Autonomy was introduced to Assam from A 1935 B 1937 C 1940 D 1941 Answer: Option [A]",
        "8 ‘Dasya-bhab’ adopted by A Madhab Deva B Chandi Bar C Sankardeva D Khersuti Ai Answer: Option [C]",
        "9 The Ahoms entered Assam through A Diphu Pass B Phungan Pass C Patkai Pass D None of these Answer: Option [C]",
        "10 According to Ahom legends khun-lung and Khun-lai were the grandson of A Leng Don B Sukapha C Caao-Tai-Pung D None of these Answer: Option [A]",
        "11 The first capital of the Ahom was A Sadiya B Charaideo C Garhgaon D Rangpur Answer: Option [B]",
        "12 The Koch coins were known as A Tanka B Mohar C Mudra D Narayani Answer: Option [D]",
        "13 The ancient name of Cachar was A Hidimba B Diapur C Dhanashree D Narayanpur Answer: Option [A]",
        "14 The Sinagiri Ghar celebration was first held by A Suhungmung B Seteupha C Gadapani D Sukapha Answer: Option [C]",
        "15 Who wrote ‘Tungkhugia Buranji’? A Visheswar Baidyadhipha B Srinath Barbarua C Dutiram Hazarik D Kashinath Tamuli Phukan Answer: Option [B]",
        "16 When did Ahoms entered in the Brahmaputra Valley? A 1228 A.D B 1229 A.D C 1230 A.D D 1128 A.D Answer: Option [A]",
        "17 In which place the first battle fought by the Ahoms against the Mughals? A Itakhuli B Bharali C Saraighat D Jogighopa Answer: Option [B]",
        "18 Who was the first Assamese to fight against British? A Kushal Knowar B Piyoli Phukan C Moniram dewan D Gomdhar Knowar Answer: Option [D]",
        "19 Sadiyakhowa Gohain post was created during the reign of which Ahom King? A Swargadeo Suhungmung B Swargadeo Rudra Singha C Swargadeo Pratap Singha D None of them Answer: Option [A]",
        "20 Ghiyashuddin Awliya associated with A Poa Mecca of Hazo B Panbari Masjid C Rangamati Masjid D Dargah of Syed Shahnur Dewan Answer: Option [A]",
        "21 Piyali Phukan was hanged in the year A June 25, 1830 B July 26, 1830 C August 26, 1830 D August 25, 1830 Answer: Option [B]",
        "22 The Ahom ruler was first to turn the Kachari Kings as Thapita and Sanchita was A Suhungmumg B Jaydhawj Singha C Rudra Shingha D Pratap Shinga Answer: Option [A]",
        "23 In which year Assam region was separated from Bengal territory and was put under a chief commissioner? A 1930 B 1890 C 1971 D 1874 Answer: Option [D]",
        "24 The shape of the coins of Ahom reign: A Circular B Square C Octagonal D Hexagonal Answer: Option [C]",
        "25 Which site in Assam is the traditional burial site of the Ahom kings? A Garhgaon B Rangpur C Charaideo D None of these Answer: Option [C]",
        "26 From which of the following places the Ahom came? A Lashio in Burma B Chiengmai in Thailand C Chieng knowang D Mong Mao in China Answer: Option [D]",
        "27 The school at Banduka where Madhavdeva read was maintained and taught by A Mukunda Adhyapaka B Jadavendra Adhyapaka C Dhanesvara Adhyapaka D Rajendra Adhyapaka Answer: Option [A]",
        "28 Who built Joydol on the bank of Joysagar tank? A Rudra Singha B Siva Singha C Gadapani D None of these Answer: Option [A]",
        "29 Who among the following was the first Ahom ruler to officially accept Hinduism? A Jayaditya Singha B Jayadhwaj Singha C Pramatta Singha D Pratap Singha Answer: Option [B]",
        "30 The oldest cannon inscriptions discovered in Assam belonged to which dynasty? A Ahoms B Mughals C Koch D English Answer: Option [C]",
        "31 Rajopakhayan by Mushi Jay Nath Ghose is a chronicle of the A Koch B Kacharies C Ahoms D Chutias Answer: Option [A]",
        "32 Srimanta Sankardeva was born in A 1749 B 1669 C 1559 D 1449 Answer: Option [D]",
        "33 The two kanai Barasi Rock inscription near Manikarneswar Hill was in A Tai B Assamese C Persian D Sanskrit Answer: Option [B]",
        "34 Badan Barphukan was the governor of A Sadiya B Solal C Kamrup D Marangi Answer: Option [C]",
        "35 From whose reign was Sanskrit language used on Ahom coins? A Sudangpha B Pratap Singha C Siva Singha D Rudra Singha Answer: Option [D]",
        "36 The Marangikhowa Gohain was the governor of A Solal province B Kamrup C Marangi province D Sadiya province Answer: Option [C]",
        "37 The Ahom first used the saka era during the reign of A Suhungmung B Pratap Singha C Sukapha D Subinpha Answer: Option [A]",
        "38 The first Ahom Barbarua was A Lachit B Momai Tamuli C Badanchandra D Langi Panihya Answer: Option [B]",
        "39 One of the disciples of Sankardeva was A Madhav kandali B Mahendra Narayan C Naranarayan D Chand Khan Answer: Option [D]",
        "40 Name of the Ahom king who married the koch princess Mongaldoi A Sukhampha B Surampha C Suhungmung D Suklengmung Answer: Option [A]",
        "41 Name the Foreigner who recorded in his accounts that he came to Kamo-lu-po A Plotemy B Yuan Chwang C Sir Edward Gait D Alberuni Answer: Option [B]",
        "42 Darrangraj Vansavali is by A Pandit Vidyavinod B Kaviratna Saraswati C Durgabor Kayastha D Baladev Suryahkari Doibojna Answer: Option [D]",
        "43 King Biswa Singha’s father was A Dharmanararya B Malladeva C Haria Mandal D Nilambar Answer: Option [C]",
        "44 Who was the progenitor of the koches? A Haria Mandal B Chilarai C Narnararyan D Vishwa Singha Answer: Option [A]",
        "45 Raghudeva was the son of A Vishwa Singha B Chilarai C Haria Mandal D Narnararyan Answer: Option [B]",
        "46 In which year the battle of Saraighat was fought? A 1661 B 1671 C 1618 D 1616 Answer: Option [B]",
        "47 During the Kamrupa king Bhaskarvarman’s period, the officer who was in charge of royal treasury was known as: A Bhandaragaradhikara B Ban Bhandara Barua C Utkhetayita D Nagar Brahman Answer: Option [A]",
        "48 The battle of Saraighat was fought between A The Burmas and the Koches B The Ahoms and Mughals C The Ahoms and the Kacharies D The Mughals and the Koches Answer: Option [B]",
        "49 What was the name of the grandmother of Sankardeva? A Hira B Sadhani C Khersuti D Jira Answer: Option [C]",
        "50 Which Mughal general invaded Ahom kingdom and occupied Gargaon? A Mir Jumla B Mirza Nathan C Raja Ram Singh D Abu Bakar Answer: Option [A]",
        "51 In 1563, the Treaty of Majuli was settled between the Koch king Nara Narayan and Ahom King. Who was the Ahom King? A Rudra Singha B Gadapani C Pratap Singha D Sukhaamphaa Answer: Option [D]",
        "52 Which Pala king built Sri-Durjaya as the capital on the bank of Brahmaputra? A Bhaskar Varman B Ratnapala C Niti Pal D Rudra Singha Answer: Option [B]",
        "53 Which Ahom king excavated the Joysagar tank in memory of his mother Joymoti at Rangpur? A Siva Singha B Rajeswar Singha C Rudra Singha D Godhadhar Singha Answer: Option [C]",
        "54 Which of the following is the great work of Sankardeva? A Kirtan Ghosha B Bhakti Ratnavali C Katha Gita D Katha Bhagavat Answer: Option [A]",
        "55 Haria Mandal, the father of first Koch king Biswa Singha originate from which village of Goalpara district? A Koch Behar B Khuntaghat C Mangaldoi D Chiknabari(Chkengram) Answer: Option [D]",
        "56 In 1897, who translated the bargaon copper-plate of Ratnapala? A Dr. Hoemle B Dr. S.K. Bhuyan C E.G. Glazie D M. Kosh Answer: Option [A]",
        "57 Which Ahom king created the post of the Bar-Phukan for the first time? A Chakradhwaj Singha B Rudra Singha C Pratap Singha D Gadadhar Singha Answer: Option [C]",
        "58 The gift Yuan Chwang accepted from Bhaskarvarman was designed to protect one from and cold. What was it? A Chameri B Ho-la-li C Chattar D Si-yu-ki Answer: Option [B]",
        "59 Which Ahom Swargadeo created the post of the Barpatra Gohain? A Supatpha B Sukapha C Sudangpha D Suhungmung Answer: Option [D]",
        "60 In Si-yu-ki by Yuan Chawang described that the circumference of Kamrupa was about A 1700 miles B 1725 miles C 1701 miles D 1600 miles Answer: Option [A]",
        "61 The persian chronicle Fathiya-i-Ibriya was compiled by A Mir jumla B Jahangir C Mirza Nathan D Shahib-ud-din Talish Answer: Option [D]",
        "62 In which year King Naranarayan died? A 1587 B 1589 C 1582 D 1580 Answer: Option [A]",
        "63 The 350 miles long old Gohain Kamal Ali connects Koch Behar with A Garhgaon B Sala C Narayanpur D Charaikhorong Answer: Option [C]",
        "64 Ratnamala compiled by Purusottama Vidyavagish is a work on: A Astrology B Novel C Poetry D Grammer Answer: Option [D]",
        "65 In which year was the treaty of Ghilajhari Ghat signed? A 1663 B 1666 C 1681 D 1683 Answer: Option [A]",
        "66 Bhaskar-varman issued the famous Nidhanpur Copper-plate grant after the battle: A Pundravardhan B Karnasuvarna C Kamrup D Gauda Answer: Option [B]",
        "67 Which Ahom Swargadeo built the temple of Umananda? A Rudra Singha B Siva Singha C Godadhar Singha D Pramatta Singha Answer: Option [C]",
        "68 Which of the following was famous for astrology? A Pragjyotishpur B Kamrup C Charaidew D Saumara Answer: Option [A]",
        "69 Which Ahom king was popularly known as \"Bamuni Konwar\"? A Suhungmung B Subinpha C Sujungpha D Sudangphaa Answer: Option [D]",
        "70 In 1585 Koch kingdom was visited by an English traveler. What was his name? A Tavemier B Ralph Fitch C Nicolo Conti D None of these Answer: Option [B]",
        "71 In the battle of Saraighat (1671) between Ahoms and Mughals, the Ahom Army was commanded by Lachit Barphukan. Who was the commander of Mughals? A Ram Singha B Askar Khan C Mir Jumla D Bakht Khan Answer: Option [A]",
        "72 Famous Kamrupi poet Hema Saraswati was a court poet of Kamatapur's King A Nara Narayan B Dharma Narayan C Vaidyadeva D Durlabh Narayan Answer: Option [D]",
        "73 In January 1663, Treaty of Ghilajharighat was signed by Ahoms with the Mughal commander: A Abu Bakar B Raja Ram Singha C Mir Jumla D Mirza Nathan Answer: Option [C]",
        "74 The Pasupatinath temple inscription in Nepal refers to “Gaudradi Kalingkashala Patti”. Who was he? A Sri Harsha Dev B Harshavardhan C Bhaskar Varman D Yasovarman Answer: Option [A]",
        "75 According to Ramayana, Amurtaraja was the founder of the kingdom of A Pragjyotisha B Srihat C Koch Behar D Darrang Answer: Option [A]",
        "76 The well-known Kamrupi poet of sixteenth century Chandraharati lived at: A Tezpur B Umanada C Kamakhya D North Guwahati Answer: Option [D]",
        "77 During Bhaskarvarman’s reign the major industry in Kamrupa was A boat building B arrow making C furniture and cane work D none of the above Answer: Option [A]",
        "78 Who first introduced the cremation of the dead among the Ahoms? A Suhungmung B Phulaswari Konwari C Siva Singha D Mumai Tamuli Answer: Option [B]",
        "79 “Thapita-sanchita” the term used by Ahoms to the A Nagas B oran king C Kachari king D Chutia king Answer: Option [C]",
        "80 Bara Larawa is a title conferred upon great fighter. Ismail Ghazi conferred it on whom? A Bhuyan Chiefs B Raja Koch Hajo C Raja of Koch Behar D Raja of Kamrupa Answer: Option [D]",
        "81 Sadhani was the last queen of: A Pala king B Moran king C Chutia king D Kachari king Answer: Option [C]",
        "82 Which Ahom King built the Dhodar Ali? A Purandar Singha B Gadadhar Singha C Rudra Singha D Siva Singha Answer: Option [B]",
        "83 Which dynasty made their capital at Maibong? A Jaitias B Khasis C Kacharies D Ahoms Answer: Option [C]",
        "84 Siva Singha declared his chief queen as 'Bar Raja'. Who was she? A Phuleswari B Ambika C Mula Ghabharu D Sarbeswari Answer: Option [A]",
        "85 The Gohain Kamal Ali built during the reign of Naranarayan runs from A Dhekiajuli to Dhubri B Koch Behar to Narayanpur C Guwahati to Goalpara D Kaliabor to Goalpara Answer: Option [B]",
        "86 What was the similarity among Hem Saraswati, Kaviratna Saraswati and Hari Har Bipra? A All were Kamrupi Spies B All were Kamrupi Poets C All were Kamrupi Priests D All were Kamrupi Sadagars Answer: Option [B]",
        "87 The language used in the inscription of the Koch kings was: A Sanskrit B Assamese C Persian D Bengali Answer: Option [A]",
        "88 In which year the Mughals Attack Ahom Kingdom for the first time? A 1608 B 1612 C 1614 D 1615 Answer: Option [D]",
        "89 What was staple crop in ancient Assam? A Coconut B Barley C Rice D Wheat Answer: Option [C]",
        "90 Chandibar was the great grandfather of whom? A Damodar Dev B Sankardeva C Madhava Dev D Gopal Dev Answer: Option [B]",
        "91 The Silsako stone bridge of North Guwahati destroyed due to earthquake in the year: A 1897 B 1898 C 1899 D 1900 Answer: Option [A]",
        "92 The name of the first Barbarua of Ahom kingdom was: A Rupchand Barbarua B Momai Tamuli C Laluksola Borphukan D None of them Answer: Option [B]",
        "93 The Sutiya Kingdom was founded by: A Vijayadhwajpal B Ratnadhwajpal C Birpal D Karmadhwajpal Answer: Option [C]",
        "94 The first local man from Mech tribe to accept Islam during the invitation Muhammad bin Bakhtiyar Khilji? A Ismail Gazi B Ali Mech C Sikander Shah D None of them Answer: Option [B]",
        "95 The temple of Tamreswari Mai was dedicated to A Shiva B Somdeo C Vishne D The goddess Tamreswari Answer: Option [D]",
        "96 Sukumar Barkaith composed Hasti Vidyarnava during the reign of: A Rajeswar Singha B Rudra Singha C Siva Singha D Gadadhar Singha Answer: Option [C]",
        "97 What was the usual shape of Koch coins? A square B round C Oval D Hexagonal Answer: Option [B]",
        "98 Which Sutiya king built Sadiya? A Ratnadhiraj B Garudadhiraj C Vijayadhiraj D Vikramdhiraj Answer: Option [A]",
        "99 Rang-Ghar was built during the reign of Swargadeo ______ A Rudra Singha B Siva Singha C Rajeshwar Singha D Pramatta Singha Answer: Option [D]",
        "100 The advisory board of Ahom king constituted with how many ministers? A 2 Ministers B 3 Ministers C 4 Ministers D 5 Ministers Answer: Option [A]",
        "101 How the name Guwahati has been derived? A place was famous for betel-nut groves B place was famous for coconut groves C place was famous for sugar-cane fields D place was famous for tea garden Answer: Option [A]",
        "102 The Posa system referred to A confronting policy B repauation policy C policy of non payment of taxes D tribal appeasement policy Answer: Option [D]",
        "103 The name of the Kamrupa ruler who left his seal at Nalanda: A Ratnapala B Bhaskarvarman C Bhagadatta D Balavarman Answer: Option [B]",
        "104 Which Ahom king introduced the Posa system? A Pratap Singha B Sukapha C Rudra Singha D Suhungmung Answer: Option [A]",
        "105 The Tamralipi in ancient times was famous as A Grant B Book C Boat D Sea-Port Answer: Option [D]",
        "106 Which is the tallest existing temple in Assam? A Umananda temple at Guwahati B Kamakhya temple at Silghat C Siva temple at Sibsagar D Siva temple at Dergaon Answer: Option [C]",
        "107 Dimapur was situated on the bank of which of the following rivers? A Dhansiri B Doyang C Brahmaputra D Dikhow Answer: Option [A]",
        "108 The temple of Umananda is associated with the God A Chandika B Durga C Shiva D Ganesha Answer: Option [D]",
        "109 In ancient times the big merchants of Assam were generally from the community A Kaivatra B Kalitas C Koches D Brahmins Answer: Option [B]",
        "110 Dimapur was the capital of the A Kachari kings B Ahom kings C Bhuyans D Chutia kings Answer: Option [A]",
        "111 What was the usual shape of the kachari coin? A Odagonal B Round C Hexahonal D Square Answer: Option [B]",
        "112 The Chutia kingdom was annexed by the Ahoms during the reign of A Sukampha B Sukapha C Pramatta D Suhungmung Answer: Option [D]",
        "113 The last capital of Kachari kings was at A Mahur B Khaspur C Maibong D Dimapur Answer: Option [B]",
        "114 The first Moamaria uprising started in the reign of A Rudra Singha B Pramattam Singha C Lakshmi Singha D Purandar Singha Answer: Option [C]",
        "115 By what name are the burial mounds of Ahom royalty known? A Doul B Kabar C Moidam D Smashan Answer: Option [C]",
        "116 Two Ahom kings were known as Burah Raja. One was Pratap Singha among the two and the other was? A Sukapha B Supinpha C Rudra Singha D Gadadhar Singha Answer: Option [D]",
        "117 Who married Kuranganayani? A Jayadhwaj Singha B Rajeswar Singha C Pratap Singha D Siva Singha Answer: Option [B]",
        "118 Which of the following Ahom kings planned an invasion of Bengal? A Rudra Singha B Suhungmung C Gadadhar Singha D Siva Singha Answer: Option [A]",
        "119 In which year did the Burmese first invade Assam? A 1771 B 1717 C 1871 D 1817 Answer: Option [D]",
        "120 In which year the treaty of Yandaboo was signed? A 1826, 24th Feb. B 1857 C 1885 D 1824 Answer: Option [A]",
        "121 Which king conducted the first organised population census in Assam? A Suhungmung B Sukapha C Rudra Singha D Sukampha Answer: Option [A]",
        "122 Who was Bisa Nong? A A Mughal Chief B A Naga Chief C A Singphou Chief D A Kachari Chief Answer: Option [C]",
        "123 Which of the following invited the Burmese to Assam? A Peoli Phukan B Badan Chnadra Barphukan C Lalok Sola D Moniram Dewan Answer: Option [B]",
        "124 Gandhiji's first visit to Assam was in the year A 1826 B 1842 C 1845 D 1921 Answer: Option [D]",
        "125 Who made weaving compulsory during the reign of Ahom king? A Suhungmung B Mumai Tamuli C Rudra Singh D Aton Burahgoain Answer: Option [B]",
        "126 Who was the first Principal of Cotton College? A Miles Branson B Nathan Brown C William Cotton D Frederic William Sudmerson Answer: Option [D]",
        "127 Two Ahom monarchs issued coins in Persian language. One was Rajeswar Singha and the other was? A Siva Singha B Suhungmung C Jayadhwij Singha D Rudra Singha Answer: Option [A]",
        "128 Tea was first discovered by A Mirza Nathan B Nathan Brown C Robert D Captain Welsh Answer: Option [C]",
        "129 Who was referred to as Dihingia Raja? A Suhungmung B Subinpha C Sudangpha D Suteupha Answer: Option [A]",
        "130 Captain Thomas Welsh recorded that the Assam Patra-Mantri was composed of A Eight ministers B Six ministers C Four ministers D Five minister Answer: Option [D]",
        "131 The Ahom name of Gadadhar Singha was A Supatpha B Sulikpha C Suhungmung D Subinpha Answer: Option [A]",
        "132 Who was the leader of the 1857 revolt in Assam? A Lachit Barphukan B Pioli Baruah C Maniram Dewan D Kanaklata Answer: Option [C]",
        "133 In which year did captain Welsh come to Assam? A 1592 A.D. B 1692 A.D. C 1700 A.D. D 1792 A.D. Answer: Option [D]",
        "134 The place where last Ahom-Mugal war fought: A Jorhat B Koch Behar C Saraighat D Itakhuli Answer: Option [B]",
        "135 The name of the Ahom king when Mir Jumla invaded Assam was: A Pratap Singha B Chakradhwaj Singha C Jayadhwaj Singha D Suhungmung Answer: Option [C]",
        "136 The year in which Phulaguri uprising took place: A 1800 B 1810 C 1826 D 1861 Answer: Option [D]",
        "137 The name of the composer of the Hasti Vidyarnava: A Sukumar Barkaith B Bhaskar Barman C Hari Dev D Madhav Dev Answer: Option [A]",
        "138 Krishnaram Bhattacharyya popularly known as Parbatiya Gossain was settled at A Kalapahar B Pratap Singha C Kamakhya hill D Mumai Tamuli Answer: Option [C]",
        "139 Sayed Shah Milan was popularly known by which name in Assam? A Ajan Fakir B Jonab C Muhammad D Nasuriddin Answer: Option [A]",
        "140 The Ahom ruler who built the temple of Chandika at Chaygaon was: A Siva Singha B Rajeswar Singha C Rudra Singha D Pratap Singha Answer: Option [D]",
        "141 Ahom marriage is known as A Homa B Chaklang C Sayambar D Gandharva Answer: Option [B]",
        "142 The title used to address an Ahom king: A Samrat B Rajan C Maharaj D Swargadeo Answer: Option [D]",
        "143 Which of the following was known as Bhaganiya Roja? A Jayadhwaj Singha B Rudra Singha C Siva Singha D Godadhar Singha Answer: Option [A]",
        "144 Which of the following introduced the Buranji written in Assam? A The Koch B The Chutias C King Sukapha D The Kacharies Answer: Option [C]",
        "145 Temple of Jayasagar was built by A Gadadhar Singha B Sudangpha C Pratap Singha D Rudra Singha Answer: Option [D]",
        "146 Who built the stone bridge over the river Namdang? A Siva Singha B Gadadhar Singha C Rudra Singha D Purandar Singha Answer: Option [C]",
        "147 Who is/were the prominent leader/leaders of Dandua Droh? A Maniram Dewan B Peoli Baruah C Hara Dutta and Bira Dutta D None of these Answer: Option [C]",
        "148 Hadira Chokey is well known because A near Karimgang B Barpeta C At Koch Beha D At the confluence of the Manasa with the Brahmaputra Answer: Option [D]",
        "149 Name of the last Chutia king: A Indrapal B Nitipal C Birpal D Jashpal Answer: Option [B]",
        "150 Three shaped coins are used in Ahom kingdom. Two of these are round and square. What was the other shape? A Octagonal B Traingular C Hexagonal D Pentagonal Answer: Option [A]",
        "151 During the reign of which of the following king the temple of Navagraha was built? A Rajeswar Singha B Siva Singha C Udayaditya D Pramatta Singha Answer: Option [A]",
        "152 The name of the king who shifted the Ahom capital from Gargaon to Rangpur was A Gadadhar Singha B Siva Singha C Sukapha D Rudra Singha Answer: Option [D]",
        "153 In which year Jorhat was founded? A 1818 B 1864 C 1884 D 1898 Answer: Option [C]",
        "154 In Mahabharata the title “Lord of the Mlechcha” was given to A Naraka B Bhagadutta C Salastambha D Vaidyadeva Answer: Option [B]",
        "155 Where is the capital of the Pala king Ratnapala located A Pragjyotishpur B Harupeswar C Kamrupanagar D Sri Duriya Answer: Option [D]",
        "156 The capital of the Salastambha dynasty located at: A Barngar B Chandrapur C Harupeswar D Pragjyotishpur Answer: Option [C]",
        "157 The first Assamese monthly issued by the Baptist missionary was A Abahan B Orunodoi C Ramdhenu D Bahin Answer: Option [B]",
        "158 Which city called “City of Eastern Astrology”? A Pragjyotishpur B Harupeswar C Sri Duriya D Tezpur Answer: Option [A]",
        "159 In ancient Kamrup, “Brahmadeya” land was gifted to A Gods B Yogis C Brahma D Brahmans Answer: Option [D]",
        "160 “Kumara Raja” title was given to A Samudravarman B Bhaskarvarman C Pusyavarman D Harsavardhan Answer: Option [B]",
        "161 Which of the following supervised when King Naranarayan reconstructing the temple of Kamakhya? A Chila Raj B Gohain Kamal C Megha Makdum D Kalapahar Answer: Option [A]",
        "162 The first known king to the Varmana dynansty was A Kalyavarman B Ganapativarman C Pusyavarman D Balavarman Answer: Option [C]",
        "163 During which Ahom ruler was the first emissary the Tripua sent? A Siva Singha B Rudra Singha C Suhungmung D Rani Phuleswari Answer: Option [B]",
        "164 Which king performed “Ashwamedha” sacrifice in Kamrupa for the first time? A Bhaskarvarman B Ratnapala C Mahendravarman D Indrapala Answer: Option [C]",
        "165 Sonitpur was the capital of A Narakasur B Bhaskarvarman C Bhagadatta D King Bana Answer: Option [D]",
        "166 One of the animals was widely used in wars in ancient Assam. It was A Bull B Camel C Horse D Elephant Answer: Option [D]",
        "167 Who was the first Vice-Chancellor of the Guwahati University? A Surya Kr. Bhuyan B Banikanta Kakati C Kaliram Medhi D Krishna Kanta Handique Answer: Option [D]",
        "168 The tantric text 'Yogini Tantra' is dedicated to the worship of two goddesses. One is Kali and the other is A Kamakhya B Durga C Lakshmi D Saraswati Answer: Option [A]",
        "169 Sarbananda Singha was the king of A The koches B The Kacharies C The Morans D The Mataks Answer: Option [D]",
        "170 Banasura the king of Sonitpur was a great devotee of god: A Krishna B Shiva C Ganesh D Brahma Answer: Option [B]",
        "171 The European merchant who had extensive salt trade in the Ahom kingdom was A Daniel Raush B Robert Clive C Captain Welsh D Sudmerson Answer: Option [A]",
        "172 Hiuen Tsang described in his account that the circumference of Kamrupa was about A 6,000 li B 10,000 li C 15,000 li D 20,000 li Answer: Option [B]",
        "173 Who was the British Officer who was beaten to death during the uprising in Assam? A Lt. Singer B Lt. Bruce C Lt. Welsh D Lt. Brown Answer: Option [A]",
        "174 Bhaskar-varman attended the great religious council at: A Taxila B Sanchi C Kanauj D Lahore Answer: Option [C]",
        "175 Who was the earliest king of Pragjyotisha? A Mahiranga Danava B Narakasura C Bhaskar-varman D None of these Answer: Option [A]",
        "176 When was the Matak territory annexed to the British dominion? A 1826 B 1842 C 1862 D 1890 Answer: Option [B]",
        "177 The large tank in Tezpur known as Hajara Pukhuri excavated by A Harjaravardan B Bana C Bhaskarvarman D Narakasura Answer: Option [A]",
        "178 The ambassador name sent by Bhaskarvarman to Harshabardhan was A Vayu B Meghadut C Hangsavega D Varuna Answer: Option [C]",
        "179 The contemporary of Bhaskarvarman in northern Indian was A Ashoka B Harsavardhan C Raja Prithvinarayan D Raja Chola Answer: Option [B]",
        "180 Hiuen Tsang described which Kamrupa king as the \"Aristrocatic King of Eastern India\"? A Banasura B Bhaskar-varman C Pushya-varman D Kalyana-varman Answer: Option [B]",
        "181 What was the first Assamese daily newspaper? A Assam Bandhu B Dainik Batori C Natun Asamiya D Orunodoi Answer: Option [B]",
        "182 On the accounts of Hiuen Tsang it is mentioned that a famous port in the Bay of Bengal was under the control of Bhaskarvarma. Which was it? A Tamralipi B Dhaka C Vishakhapattam D Chittagaon ( Chattagram ) Answer: Option [A]",
        "183 What was the reason behind the issue of Nidhanpur Grant by Bhaskarvarman? A Kamakhya temple B Umananda temple C Durga Devi D Review the land grants of Bhutivarman Answer: Option [D]",
        "184 Hiuen Tsang visited Kamrupa during the reign of A Samudra-varman B Bhaskar-varman C Vanamala-varman D Narakasura Answer: Option [B]",
        "185 The ruins of the brick temple at Da-Parbatiya belong to A Mauyryan period B Vedic period C Later Gupta period D None of these Answer: Option [C]",
        "186 The first Khasi chief to declare war against the British was: A Tirot Singh B Bir Singha C Hari Singh D Birendra Singha Answer: Option [A]",
        "187 Who was the first king of Pala dynasty? A Gopala B Brahmapala C Harshapala D Indrapala Answer: Option [B]",
        "188 Which Kamrupa king made friendship with Harshavardhan? A Bhaskarvarman B Naraka C Rampal D Bhagadatta Answer: Option [A]",
        "189 Which famous temple is built during the reign of Salastambha dynasty? A Bhubaneshwari Mandir B Sri Mahabhairab Mandir C Kamakhya Mandir D Mohamaya Mandir Answer: Option [B]",
        "190 Which king honoured Bhaskar-varman at a conference held at Kanouj? A Rampala B Harshavardhan C Ashoka D None of these Answer: Option [B]",
        "191 The ruins of the Da-parbatiya temple is dedicated to which god/goddes? A Visnu B Shiva C Durga D Kamakhya Answer: Option [B]",
        "192 The rule of Varman dynasty came to end with the death of: A Bhutivarman B Mahendravarman C Banamalavarman D Bhaskarvarman Answer: Option [D]",
        "193 Who was Malati Mem alias Mungri? A First woman graduate of Assam B First woman I.A.S. of Assam C First woman martyr of Assam D First woman representative of Assam to the Legislative council of the state Answer: Option [C]",
        "194 What was the name of the Koch king who rebuilt the Kamakhya temple? A Naranarayan B Biswa Singha C Mohandra Narayan D Balinarayan Answer: Option [A]",
        "195 The first Mohammedan invasion of Kamrupa took place during the reign of king: A Vaidyadeva B Jayapala C Prithu D Rampala Answer: Option [C]",
        "196 Muhammad-Bin-Bakhtiyar Khilji attack Kamrupa on his way to A Burma B Nepal C Bhutan D Tibet Answer: Option [D]",
        "197 What was the common language used in Kamrupa inscriptions? A Hindi B Bengali C Sanskrit D Assamese Answer: Option [C]",
        "198 Who was the first king of the Koch dynasty? A Prithvinarayan B Pran narayan C Naranarayan D Biswa Singha Answer: Option [D]",
        "199 Which of the following animals was used as the royal symbol of the ancient king of Kamrupa? A Bull B Lion C Tiger D Elephant Answer: Option [D]",
        "200 In the Sanskrit inscription the name of Naranarayan is mentioned as A Kshatriya B Purandar C Malladeva D Kamateswar Answer: Option [C]",
        "201 The capital of Koch kingdom was at A Koch Behar B Kamrupnagar C Kamatapur D None of these Answer: Option [A]",
        "202 Which king of Varman dynasty was contemporary with Samudragupta of Gupta dynasty? A Bhaskar Varman B Samudra Varman C Pushya Varman D None of them Answer: Option [C]"
    ]
}