{
    "Topic": "Awards/Honours/Prizes",
    "Subject": "Bharat Ratna",
    "data": [
        "1 Who is the first non-Indian to receive the Bharat Ratna ? A Martin Luther King B Mother Teresa C Khan Abdul Gaffar Khan D Nelson Mandela Answer: Option [C]",
        "2 Who among the following has received highest civilian awards of two countries, Bharat Ratna from India and Nishan-e-Pakistan from Pakistan ? A Morarji Desai B Mahatma Gandhi C Ayub Khan D Maulana Abdul Kalam Azad Answer: Option [A]",
        "3 Dr. A.P.J. Abdul Kalam, the former Indian President, received the prestigiuos Bharat Ratna Award in the year : A 1992 B 1995 C 1997 D 1998 Answer: Option [C]",
        "4 Who is the first recipient of Bharat Ratna Award ? A C. V. Raman B S. Chandrasekhar C C. Rajagopalachari D Gobind Ballabh Pant Answer: Option [C]",
        "5 Who was the first musician to be felicitated with 'Bharat Ratna' ? A Lata Mangeshkar B M.S. Subhulakshmi C Pt. Ravi Shankar D Pt. Bhimsen Joshi Answer: Option [B]",
        "6 Which industrialist has been honored with Bharat Ratna? A JRD Tata B Sir Shriram C Dhirubhai Ambani D Ghanshyamdas Birla Answer: Option [A]",
        "7 Who among the following is a non-Indian who was conferred “Bharat Ratna”? A Lord Mountbatten B Nelson Mandela C Mother Teresa D Sheikh Mujibur Rahman Answer: Option [B]",
        "8 How many person distinguished in the field of music have so far been awarded “Bharat Ratna”? A 2 B 3 C 4 D 5 Answer: Option [D]",
        "9 Bharat Ratna is designed like the leaf of A Coconut tree B Banyan tree C Peepal tree D Sandalwood tree Answer: Option [C]",
        "10 Who was the first posthumous recipient of Bharat Ratna? A K. Kamraj B B.R. Ambedkar C M.G. Ramachandran D Lal Bahadur Shastri Answer: Option [D]",
        "11 The first woman to get Bharat Ratna Award is A Sarojini Naidu B Mother Teresa C Lata Mangeshkar D Indira Gandhi Answer: Option [D]",
        "12 Which is the highest civilian award of India? A Bharat Ratna B Padmashri C Padma Bhushan D Bharat Bhushan Answer: Option [A]",
        "13 Bharat Ratna Award is awarded by __________ of India. A President B Chief Justise C Prime Minister D Vice President Answer: Option [A]",
        "14 Who is first Vice President of India to won Bharat Ratna Award? A Zakir Husain B Vallabhbhai Patel C Varahagiri Venkata Giri D Sarvepalli Radhakrishnan Answer: Option [D]",
        "15 Who was first prime minister of India awarded with Bharat Ratna? A Rajiv Gandhi B Jawaharlal Nehru C Indira Gandhi D Atal Bihari Vajpayee Answer: Option [B]",
        "16 Which of the following personality has been awarded with Bharat Ratna and later award being withdrawn? A Aruna Asaf Ali B Abul Kalam Azad C Jagadish Chandra Bose D Netaji Subhas Chandra Bose Answer: Option [D]",
        "17 Bharat Ratna is awarded for exceptional service towards advancement of- A Art B Literature and Science C Public Service of the highest order D All of the above Answer: Option [D]",
        "18 The Bharat Ratna Award was established by the first President of India, __________ A Zakir Husain B Rajendra Prasad C Dr. Sarvepalli Radhakrishnan D Chandrasekhara Venkata Raman Answer: Option [B]",
        "19 Bharat Ratna Award was instituted in the year _________. A 1948 B 1952 C 1954 D 1956 Answer: Option [C]",
        "20 First Indian person who promptly decline Bharat Ratna Award was ____________. A Abul Kalam Azad B Lata Mangeshkar C Bismillah Khan D Asha Bhosale Answer: Option [A]",
        "21 Governor-General who has been awarded with Bharat Ratna Award? A Bhagwan Das B Sir C. V. Raman C Chakravarti Rajgopalachari D None of the above Answer: Option [C]",
        "22 The number of annual awards is restricted to a maximum of _______ in a particular year. A 1 B 2 C 3 D 4 Answer: Option [C]",
        "23 Prime Minister of India who receive Bharat Ratna Award Posthumously? A Rajiv Gandhi B Zakir Husain C Indira Gandhi D Morarji Desai Answer: Option [A]",
        "24 Who was first Indian to be awarded with Bharat Ratna and Nobel Prize? A Satyajit Ray B Mother Teresa C B. R. Ambedkar D Sir C. V. Raman Answer: Option [D]",
        "25 The recommendations for Bharat Ratna are made by the ________ to the _________. A President, Loksabha B Prime Minister, President C President , Vice President D Chief Justise, President Answer: Option [B]",
        "26 On the conferment of the award, the recipient receives a __________ and a Medallion. A Certificate signed by the President B Certificate signed by the Prime Minister C Certificate signed by the Supreme Court Judge D Certificate signed by the President and Vice President Answer: Option [A]",
        "27 First Bharat Ratna Award was distributed on ______________. A 2 January 1954 B 26 January 1954 C 15 August 1954 D 2 October 1954 Answer: Option [A]",
        "28 Interim Prime Minister who has been awarded with Bharat Ratna? A Morarji Desai B Inder Kumar Gujral C Gulzarilal Nanda D Chandra Shekhar Answer: Option [C]",
        "29 Who was first film maker to receive Bharat Ratna Award? A Mahesh Bhatt B Ramesh Sippy C Yash Chopra D Satyajit Ray Answer: Option [D]",
        "30 Which of the following personality related to Sitar has been awarded with Bharat Ratna? A Bismillah Khan B Ravi Shankar C Vilayat Khan D Nikhil Banerjee Answer: Option [B]"
    ]
}