{
    "Topic": "Indian Polity",
    "Subject": "Citizenship",
    "data": [
        "1 Which of the following is not a condition for becoming a citizen of India ? A Birth B Acquiring property C Descent D Naturalisation Answer: Option [B]",
        "2 Which of the following is competent to prescribe conditions as for acquiring citizenship of India ? A Parliament B State Legislature C President D Home Minister of India Answer: Option [A]",
        "3 Find the correct statement regarding the acquisition of Indian citizenship ? A If citizenship of India is to acquired by registration, one year residence in India is essential. B If citizenship is to be acquired by naturalisation the person concerned must have resident in India for 5 years. C If born in India, only that person can acquire citizenship at least one of whose parents is an Indian. D Rules regarding the citizenship of India shall not be applicable to Jammu and Kashmir. Answer: Option [C]",
        "4 According to the Indian Citizenship Act, 1955, which of the following is not a method of acquiring Indian Citizenship? A Children of the diplomatic personnel or alien enemies born in Indiaon or after 26th, January 1950. B Children born of Indian citizens abroad. C Incorporation of territory not forming part of Indiaat the commencement of the Constitution. D Naturalisation. Answer: Option [A]",
        "5 To acquire citizenship by registration a person must have been resident in India for how many years immediately before making an application? A One year B Two years C Four years D Five years Answer: Option [D]",
        "6 How a person can become citizen of India if he born abroad ? A Father is a citizen of India. B Mother is a citizen of India. C Father is a citizen of India at the time of the person's birth. D Father or mother is a citizen of India at the time of the person's birth. Answer: Option [D]",
        "7 Citizenship provisions of Indian Constitution is contained in : A Part II B Part II, Articles 5-11 C Part II, Articles 5-6 D Part I, Articles 5-11 Answer: Option [B]",
        "8 Indian Citizenship of a person can be terminated if : I. a person voluntarily acquires the citizenship of some other country. II. a person who has become a citizen through registration is sentenced to imprisonment for not less than 10 years within five years of his registration. III. the Government of India is satisfied that citizenship was obtained by fraud. IV. a person who is a citizen by birth indulges in trade with an enemy country during war. A I and II B II and III C I, III and IV D I, II, III and IV Answer: Option [C]",
        "9 Which Article of Indian Constitution deals with Persons voluntarily acquiring citizenship of a foreign State not to be citizens ? A Article 5 B Article 6 C Article 8 D Article 9 Answer: Option [D]",
        "10 Who is called the first citizen of India? A The Prime Minister B The President C The Speaker of Lok Sabha D The Chief Justice of India Answer: Option [B]",
        "11 In Indian, the concept of single citizenship is adopted from A France B U.S.A. C England D Canada Answer: Option [C]",
        "12 Who said “A good citizen makes a good State and a bad citizen makes a bad State”? A Laski B Aristotle C Rousseau D Plato Answer: Option [B]",
        "13 By which of the following modes can citizenship be acquired? I. By Birth II. Hereditary III. By Registration IV. By Request A I and II B I, II and III C II and III D II, III and IV Answer: Option [B]",
        "14 No person shall be a citizen of India if he has A Lived in a foreign country for more than five tears B Been convicted by a foreign court of law C Voluntarily acquired citizenship of another country D Accepted employment in another country Answer: Option [C]",
        "15 Which is the competent body to prescribe conditions for acquisition of citizenship? A Parliament B President C Election Commission D Parliament and Assemblies Answer: Option [A]",
        "16 ‘Dual citizenship’ is a feature of A Unitary government B Parliamentary government C Presidential government D Federal government Answer: Option [D]",
        "17 Citizen of India can vote at the age of A 18 years B 21 years C 22 years D 25 years Answer: Option [A]",
        "18 Dual citizenship is an important feature in which form of government? A Parliamentary B Federal C Unitary D Authoritarian Answer: Option [B]",
        "19 Provisions of citizenship in Indian Constitution, became applicable in A 1949 B 1950 C 1951 D 1952 Answer: Option [B]"
    ]
}