{
    "Topic": "Indian Polity",
    "Subject": "Constitutional Development",
    "data": [
        "1 Which body framed the Constitution of Independent India ? A Drafting Committee B Constituent Assembly C Union Constitution Committee D A Working Committee Answer: Option [A]",
        "2 The constituent Assembly was set up in : A 1945 B 1946 C 1947 D 1949 Answer: Option [B]",
        "3 Who among the following was the Chairman of the Drafting Committee of the Indian Constitution ? A Pt. Jawaharlal Nehru B Sachidananda Sinha C B.R. Ambedkar D Dr. Rajendra Prasad Answer: Option [C]",
        "4 Who among the following was the president of the Constituent Assembly ? A Dr. Rajendra Prasad B Dr. B.R. Ambedkar C Lal Bahadur Shastri D P. Upendra Answer: Option [A]",
        "5 The Constitution of India was adopted by the A Governor General B Constituent Assembly C British Parliament D None of these above Answer: Option [B]",
        "6 Who among the following was the Chairman of the Union Constitution Committee of the Constituent Assembly ? A B. R. Ambedkar B Jawaharlal Nehru C J. B. Kripalani D Rajendra Prasad Answer: Option [B]",
        "7 Who proposed the Preamble before the Drafting Committee of the Constitution ? A Jawaharlal Nehru B B.R. Ambedkar C B.N Rao D Mahatma Gandhi Answer: Option [A]",
        "8 Who among the following was the Chairman of Steering Committee of the Constituent Assembly ? A B. R. Ambedkar B Rajendra Prasad C J. B. Kripalani D Tej Bahadur Sapru Answer: Option [B]",
        "9 Who among the following was the Chairman of States Committee of the Constituent Assembly ? A Rajendra Prasad B Lal Bahadur Shastri C Jawaharlal Nehru D B.N. Rao Answer: Option [C]",
        "10 Who among the following was the Chairman of Fundamental Rights Sub-Committee of the Constituent Assembly ? A J.B. Kripalani B Rajendra Prasad C B.R. Ambedkar D Gopinath Bardoloi Answer: Option [A]",
        "11 Which of the following countries have an Unwritten Constitution ? A U.S.A B Nepal C India D U.K. Answer: Option [D]",
        "12 The Constitution of India was adopted on A 26 January, 1950 B 26 January, 1949 C 26 November, 1949 D 31 December, 1949 Answer: Option [C]",
        "13 How many schedules does the Constitution of India contain ? A 9 B 10 C 11 D 12 Answer: Option [D]",
        "14 Under which article of Constitution Jammu and Kashmir does enjoys special constitutional position ? A Article – 370 B Article – 356 C Article – 170 D Article – 124 Answer: Option [A]",
        "15 Which of the following is a feature to both the Indian Federation and the American Federation ? A Dual judiciary B A singe citizenship C Three Lists in the constitution D A Federal Supreme Court to interpret the Constitution Answer: Option [D]",
        "16 Which of the following is not a tool of legislative control over administration in India ? A Questions B Resolutions C Dissolution of House D No Confidence Motion Answer: Option [C]",
        "17 In which year were the Indian states reorganized on the linguistic basis ? A 1947 B 1951 C 1956 D 1966 Answer: Option [C]",
        "18 The articles 17 and 18 of constitution provide A Social equality B Economic equality C Political equality D Religious equality Answer: Option [A]",
        "19 The constitution of India describes India as A Quasi-federal B A Union of States C A Unitary State D A federation of state and union territories Answer: Option [B]",
        "20 How many languages are contained in the VIIIth schedule of the Indian Constitution ? A 12 B 16 C 18 D 22 Answer: Option [D]",
        "21 Article 17 of the Indian Constitution provides for A Abolition of titles B Equality before law C Abolition of untouchability D Equality of opportunity in matters of public employment Answer: Option [C]",
        "22 Article 370 of the Constitution of India provides for A Temporary provisions for Jammu & Kashmir B Special provisions in respect of Nagaland C Provisions in respect of the financial emergency D None of these Answer: Option [A]",
        "23 Who among the following was the President of the Constituent Assembly of India ? A M.A. Jinnah B Dr. Rajendra Prasad C Jawaharlal Nehru D Lal Bahadur Shastri Answer: Option [B]",
        "24 The majority of the provisions of Indian Constitution can be amended A By the Parliament alone B By the State Legislatures acting together C Only on ratification by half of the States D With the joint approval of the Parliament and State Legislatures Answer: Option [A]",
        "25 A proclamation of emergency, under Article 352, on account of war or aggression requires approval of the Parliament within A One month B Two months C Four months D Six months Answer: Option [A]",
        "26 Article 370 of the Indian Constitution upholds A Diplomatic privileges and immunities B Land reforms legislation in India C Special status of Jammu and Kashmir State D Duties and rights of Lokpal Answer: Option [C]",
        "27 In our Constitution, Economic Planning is included in A Union list B Concurrent list C State list D Not any specified list Answer: Option [B]",
        "28 Which Constitutional Amendment gave precedence to the Directive Principles of State Policy over Fundamental Rights ? A 42nd B 44th C 52nd D 56th Answer: Option [A]",
        "29 Which of the following expressions does not figure in the Preamble to the Indian Constitution ? A Secular B Federal C Socialist D Sovereign Democratic Republic Answer: Option [B]",
        "30 The basic features of the Indian Constitution which are not amendable under Article 368 are A Judicial review and the federal system B Sovereignty, territorial integrity, federal system and judicial review C Sovereignty, territorial integrity and parliamentary system of Government D Sovereignty, territorial integrity, federal system and judicial review and parliamentary system of Government Answer: Option [D]",
        "31 Which part of the Indian Constitution deals with the Directive Principles of State Policy ? A Part I B Part III C Part IV D Part V Answer: Option [C]",
        "32 Which is the national flower of India ? A Rose B Lotus C Lily D Sunflower Answer: Option [B]",
        "33 Which Amendment Act introduced changes in the preamble to the Indian Constitution ? A The 38th Amendment Act, 1975 B The 40th Amendment Act, 1976 C The 42nd Amendment Act, 1976 D The 44th Amendment Act, 1979 Answer: Option [C]",
        "34 What is the motto incorporated under our National Emblem ? A Jai Hind B Satyameva Jayate C Satyam Shivam D Amendment Act Sundaram Answer: Option [B]",
        "35 By which Amendment were ‘Fundamental Duties’ added to the Constitution ? A The 40th Amendment B The 42nd Amendment C The 44th Amendment D The 45th Amendment Answer: Option [B]",
        "36 Which Article of the Indian Constitution abolishes “Untouchability” ? A 14 B 15 C 16 D 17 Answer: Option [D]",
        "37 Which of the following countries enjoys a federal form of government ? A China B Cuba C USA D Belgium Answer: Option [C]",
        "38 How many Articles are there in the Indian Constitution ? A 395 B 396 C 398 D 399 Answer: Option [A]",
        "39 Although Union List, State List and concurrent List cover the entire legislative business, yet there may be an item not mentioned anywhere. Who will legislate on that item ? A State Legislature only B Parliament only C Both (A) and (B) D Neither (A) nor (B) Answer: Option [B]",
        "40 A financial Emergency can be declared by applying A Article 371 B Article 370 C Article 361 D Article 360 Answer: Option [D]",
        "41 A federal structure for India was first put forward by the A Act of 1861 B Act of 1909 C Act of 1919 D Act of 1935 Answer: Option [D]",
        "42 There is no provision in the Constitution for the impeachment of the A Governor B Vice President C Chief Justice of India D Chief Justice of a High Court Answer: Option [A]",
        "43 ‘Consent of the people’ means consent of A All people B A few people C Majority of the people D Leader of the people Answer: Option [C]",
        "44 When was our National Anthem first sung and where ? A 24th January, 1950 in Delhi B 24th January, 1950 in Allahabad C 26th December, 1942 in Calcutta D 27th December, 1911 in Calcutta Answer: Option [D]",
        "45 Which Amendment of the Indian Constitution inserted the two words – ‘Socialist’ and ‘Secular’ in the Preamble ? A 40th B 42nd C 44th D 45th Answer: Option [B]",
        "46 The Constitution of India came into force on A 26 January, 1950 B 26 January, 1952 C 15 August, 1948 D 26 November, 1949 Answer: Option [A]",
        "47 The term ‘Caste’ was derived from A English B German C Dutch D Portuguese Answer: Option [D]",
        "48 The term “Greater India” denotes A Political unity B Cultural unity C Religious unity D Social unity Answer: Option [B]",
        "49 Which is an extra-Constitutional body ? A Language Commission B Election Commission C Planning Commission D Finance Commission Answer: Option [C]",
        "50 The declaration of Constitutional Emergency in an Indian State has to be approved by the Parliament within a period of A 2 months B 4 months C 6 months D 12 months Answer: Option [A]",
        "51 The number of subjects in the Union List of the Indian Constitution is A 47 B 66 C 97 D 100 Answer: Option [C]",
        "52 Which of the following is not a Constitutional Body ? A Election commission B Financial commission C Union Public Service commission D Planning commission Answer: Option [D]",
        "53 The Constitution of India contains A 340 Articles B 395 Articles C 400 Articles D 448 Articles Answer: Option [B] Originally the Constitution of India had 395 articles in 22 parts and 8 schedules. But now Constitution of India have 448 articles in 25 parts, 12 schedules, 5 appendices and 98 amendments.",
        "54 Which of the following Articles of the Constitution deals with the Fundamental Duties ? A Article 39 C B Article 51 A C Article 29 B D None of the above Answer: Option [B]",
        "55 Which was described by Dr. B.R. Ambedkar as the ‘heart and soul’ of the Constitution ? A Right to Equality B Right against Exploitation C Right to Constitutional Remedies D Right to freedom of Religion Answer: Option [C]",
        "56 Who had proposed party less democracy in India ? A S.A. Dange B Vinoba Bhave C Mahatma Gandhi D Jaya Prakash Narayan Answer: Option [D]",
        "57 The Drafting of the Constitution was completed on: A 26th January, 1950 B 26th December, 1949 C 26th November, 1949 D 30th November, 1949 Answer: Option [C]",
        "58 Who was the President of the Constituent Assembly ? A Sardar Patal B Dr. B.R. Ambedkar C Pt. Jawaharlal Nehru D Dr. Rajendra Prasad Answer: Option [D]",
        "59 The method of Impeachment of the President of India is adopted from A U.S.A. B U.K. C U.S.S.R. D France Answer: Option [A]",
        "60 In the eight schedule of the Constitution of India, which languages were added subsequently ? A English, Sindhi, Marathi, Sanskrit B Sanskrit, Sindhi, Konkani, Manipuri C Sindhi, Konkani, Manipuri, Nepali D Marathi, Oriya, Konkani, Nepali Answer: Option [C]",
        "61 Under which Article of the Constitution is the President’s Rule introduced in a State due to the failure of the constitutional machinery ? A 352 B 356 C 360 D 350 Answer: Option [B]",
        "62 Who said that “Oh! Disrespectable democracy! I love you” ? A G.B. Shaw B Lord Bryce C Carpenter D Appa Doral Answer: Option [A]",
        "63 The final authority to interpret our Constitution is the A President B Parliament C Prime Minister D Supreme Court Answer: Option [D]",
        "64 A secular State is one which: A Is irreligious B Is anti-religion C Has no religion of its own D Takes into consideration the religious sentiments of the people Answer: Option [C]",
        "65 The Parliament can legislate on subjects given in the Union List only in consultation with the State Government for the State of: A Assam B Rajasthan C Kerala D Jammu & Kashmir Answer: Option [D]",
        "66 What is the colour of the “Dharma Chakra” in the middle of our national flag ? A Black B Green C Navy blue D Sea blue Answer: Option [C]",
        "67 The Constitution of India describes the country as a A Federation B Union of States C Confederation D Unitary State Answer: Option [B]",
        "68 The seventy third Amendment Act, 1992 of the Indian Constitution was passed to A Strengthen Panchayti Raj B Strengthen urban institution C Pt. Jawaharlal Nehru D None of the above Answer: Option [A]",
        "69 Indian Constitution has divided the powers and function of the state into A Two lists B Three lists C Four lists D Five lists Answer: Option [B]",
        "70 The concept of Constitution first originated in A Japan B U.S.A. C Britain D Switzerland Answer: Option [C]",
        "71 On the subjects mentioned in the concurrent list, laws may be enacted by the A Union alone B States alone C States and the Union D States and the Union territories Answer: Option [C]",
        "72 Freedom of the press is implied in the right to A Equal protection of the laws B Freedom of speech C Freedom of association D Work and material security Answer: Option [B]",
        "73 The provisional President of the Constituent Assembly was A Pt. Jawaharlal Nehru B Dr. B.R. Ambedkar C Dr. Rajendra Prasad D Sachidanand Sinha Answer: Option [D]",
        "74 Articles 74 and 75 of Indian Constitution deal with matters of A The Cabinet Ministers B The President of India C The council of Ministers D The Speaker of Lok Sabha Answer: Option [C]",
        "75 The Chairman of the Drafting Committee of the Indian Constitution was A Dr. B.R. Ambedkar B Mahatma Gandhi C Dr. Rajendra Prasad D Pt. Jawaharlal Nehru Answer: Option [A]",
        "76 A proceeding under Article 226 in case of detention of a person is a A statutory proceeding B judicial proceeding C criminal proceeding D civil proceeding Answer: Option [C]",
        "77 Who was the Chairman of the Constituent Assembly of India ? A Dr. B.R. Ambedkar B Dr. Rajendra Prasad C Dr. B.N. Rau D Pt. Jawaharlal Nehru Answer: Option [B]",
        "78 Which item out of the following is contained in the concurrent list ? A Tolls B Agriculture C Trade Union D Markets and Fairs Answer: Option [C]",
        "79 “Persons may change but rules should not change” is the principle of A Republic B Absolute Monarchy C Unwritten Constitution D Constitutional Government Answer: Option [D]",
        "80 The Constituent Assembly of Indian was set up under the A Cabinet Mission plan B Mountbatten plan C Cripps proposals D Simon Commission proposals Answer: Option [A]",
        "81 The objectives of Indian Planning are A Increasing national income B Elimination of poverty C Reducing inequalities in income and wealth D All of the above Answer: Option [D]",
        "82 The term “Fourth Estate” is used for A Parliament B Judiciary C The Executive D The press and newspaper Answer: Option [D]",
        "83 Through which Constitutional Amendment was the Nagarpalika Bill passed ? A 70th B 72nd C 73rd D 74th Answer: Option [D]",
        "84 Who can legislate on those residual matters which are not mentioned in Central/ State/ Concurrent lists ? A Parliament alone B State legislatures exclusively C Parliament or State legislatures as adjudicated by the Supreme Court D Parliament after State legislatures concur Answer: Option [A]",
        "85 Which schedule of the Constitution deals with the disqualification of elected members on the ground of defection ? A 8th B 9th C 10th D 11th Answer: Option [C]",
        "86 According to Article 75(3) of the Constitution of India the Council of Ministers are collectively responsible to the A Rajya Sabha B Parliament C President D Lok Sabha Answer: Option [D] The Council of Ministers shall be collectively responsible to the House of the People(Lok Sabha). The Council of States is(Rajya Sabha).",
        "87 Communism has given importance to A Economic equality B Social equality C Natural equality D Political equality Answer: Option [A]",
        "88 The two words that were inserted by the 42nd Amendment to the Preamble of the Constitution are A Secular, Democratic B Sovereign, Democratic C Socialist, Secular D Secular, Republic Answer: Option [C]",
        "89 Sikkim was granted statehood in the year A 1972 B 1973 C 1974 D 1975 Answer: Option [D]",
        "90 “From each according to his capacity, to each according to his needs” is the principle of A Fascism B Democracy C Communism D Dictatorship Answer: Option [C]",
        "91 52nd Constitutional Amendment Act of 1985 deals with A Union Territories B Defection and disqualification C Extending reservation D Abolition of privy purses Answer: Option [B]",
        "92 ‘Cabinet system’ and ‘Collective responsibility’ are the contributions of A India B Britain C Ireland D United States Answer: Option [B]",
        "93 Popular sovereignty was advocated by A Rousseau B John Locke C Thomas Hobbes D T.H. Green Answer: Option [A]",
        "94 The Creamy Layer, concept refers to A The grouping based on social status B The grouping based on castes C The grouping based on economic status D The grouping based on milk consumption Answer: Option [C]",
        "95 In the Constitution of India, the ‘Right to Constitutional Remedies’ has been provided in Article A 30 B 31 C 32 D 35 Answer: Option [C]",
        "96 Which amendment to the Constitution provide for the reservation of one-third seats in the Municipal Boards and Village Panchayats for women ? A 73rd and 74th Amendments B 82nd and 83rd Amendments C 72nd and 73rd Amendments D 74th and 75th Amendments and Ordinary Law Answer: Option [A]",
        "97 By which constitutional amendment political defections were banned ? A The Fiftieth amendment of 1984 B The fifty-third amendment of 1986 C The fifty-fourth amendment of 1986 D The fifty-second amendment of 1985 Answer: Option [D]",
        "98 Which Article of the Constitution provides special status to Jammu and Kashmir ? A 360 B 368 C 370 D 375 Answer: Option [C]",
        "99 The system of privy purses in respect of former rulers of Indian States before Independence was abolished by the Constitution through A 26th Amendment Act, 1971 B 27th Amendment Act, 1971 C 38th Amendment Act, 1975 D 42nd Amendment Act, 1976 Answer: Option [A]",
        "100 What is meant when the Constitution declares India a “Secular State” ? A Religious worship is not allowed B Religious are patronized by the State C The State regards religious as a private affairs of the citizen and does not discriminate on this basis D None of these Answer: Option [C]",
        "101 Evaluate the following statements: I. The legal interpretation of equality is chiefly influenced by equally before law and equal protection of law II. Equality before law means rule of law A I is correct but II is incorrect B II is correct but I is incorrect C Both are correct D Both are incorrect Answer: Option [C]",
        "102 Which State enjoys the distinction of being the first linguistic state of India ? A Kerala B Tamil Nadu C West Bengal D Andhra Pradesh Answer: Option [D]",
        "103 When a constitutional amendment bill goes to the President, he A Is bound to give his assent B Can withhold his assent C Can delay it for not more than six months D Can return it to the Parliament for reconsideration Answer: Option [A]",
        "104 “The Federal System with strong Centre” has been borrowed by the Indian Constitution from A France B Canada C United Kingdom D United States of America Answer: Option [B]",
        "105 Which of the following rights is not granted by the Constitution of India at present as a fundamental right ? A Right to freedom B Right to equality C Right to property D Right against exploitation Answer: Option [C]",
        "106 Which among the following rights comes in to the category of public litigation petition before high court of Supreme Court ? A against a general topic. B against political interference. C against the decision of lower court. D The challenge to election of the office bearers of a political party. Answer: Option [A]",
        "107 What is the period with in which a proclamation of national emergency made by the president is to be placed before each house of the parliament for approval ? A within one month B within two months C within four months D within six months. Answer: Option [A]",
        "108 What is the exact constitutional position of the Indian republic when the constitution was brought into force with effect from 26th January 1950 ? A A democratic republic B A sovereign democratic republic C A sovereign secular democratic republic D A sovereign secular socialist democratic republic Answer: Option [B]",
        "109 Fabianism is closely related to: A Fascism B Liberalism C Scientific socialism D Democratic socialism Answer: Option [D]",
        "110 The federal structure for India was first put forward by the: A Act of 1909 B Act of 1919 C Act of 1935 D Act of 1947 Answer: Option [C]",
        "111 Which of the following exercised the most profound influence in framing the Indian constitution ? A British constitution B US constitution C Irish constitution D The government of India act, 1935 Answer: Option [D]",
        "112 How does the constitution of India describe India as ? A Bharatvarsh B A union of states C A federated nation D A federation of states and union Territories Answer: Option [B]",
        "113 Right to vote is mentioned in the part of the constitution relating to A Election B State legislature C Union legislature D Fundamental right Answer: Option [A]",
        "114 A low can be enacted, or executive order issued even contrary to article 19, during proclamation of emergency A Caused by financial crisis B Caused by constitutional breakdown C Caused by internal armed rebellion D Caused by war or external aggression Answer: Option [D]",
        "115 The following article of the Indian constitution abolished the practice of untouchability. A Article 14 B Article 17 C Article 18 D Article 19 Answer: Option [B]",
        "116 From the following languages listed in the eighth schedule of the constitution pick out the one which is the official language of a state: A Kashmiri B Sindhi C Urdu D Nepali Answer: Option [C]",
        "117 The term ‘secular’ was added in the preamble to the Indian constitution by A 41st Amendment B 42nd Amendment C 43rd Amendment D 44th Amendment Answer: Option [B]",
        "118 Point out which from the following is not a right enumerated in the constitution of India but has been articulated by the Supreme Court to be a fundamental right. A Right to privacy B Equality before law C Abolition of untouchability D Right to form associations or unions Answer: Option [A]",
        "119 Point out which from the following is not a right enumerated in the constitution of India but has been articulated by the Supreme Court to be a Fundamental Right ? A Right to life B Protection of personal liberty C Right to permanent housing D Equality of opportunity in matter of public employment Answer: Option [C]",
        "120 Article 243 of the constitution of India inserted by a constitutional Amendment deals with which of the following ? A Land Reforms B Panchayati Raj system C To include Konkani, Manipuri and Nepali in the list of official language D Extended the benefits of reservation on the basis of mandal commission Recommendation Answer: Option [B]",
        "121 From which Constitution of the world, the Indian constitution has adopted the concept of “Directive Principles of state policy“ ? A Ireland B U.S.A. C Canada D Australia tanks and wells Answer: Option [A]",
        "122 The concept of political sovereignty was advocated by A Plato B John Locke C Rousseau D Austin Answer: Option [C]",
        "123 Plural theory of sovereignty emphasizes of A State B Religion C Individuals D Association Answer: Option [D]",
        "124 Where is the objective of ‘’social justice’’ articulated in the constitution of India ? A Preamble B Article 14 C Article 15 D Article 16 Answer: Option [A]",
        "125 Under which article of the constitution can emergency be declared in India on account of war or external aggression ? A Article 356 B Article 352 C Article 353 D Article 354 Answer: Option [B]",
        "126 Form which historical work were the words “Satyameva Jayate” appearing under the national emblem taken ? A Rig veda B Ramayana C Bhagawad Gita D Mundaka Upanishad Answer: Option [D]",
        "127 Which among the following legislation gives constitutional status to three tier Panchayati Raj System ? A 72nd constitutional amendment, 1992 B 73rd constitutional amendment, 1993 C 74th constitutional amendment, 1993 D 75th constitutional amendment, 1994 Answer: Option [B]",
        "128 Which among the following Articles of the Indian constitution provides for states emergency and suspends constitutional arrangement in a state ? A Article 352 B Article 356 C Article 389 D Article 392 Answer: Option [B]",
        "129 Article 32 of the Indian constitution relates to: A Right to religion B Right to equality C Right against exploitation D Right to constitutional remedies Answer: Option [D]",
        "130 What was the basis for constituting the constituent Assembly of India ? A The Resolution of the Indian national congress B The cabinet mission plan, 1946 C The Indian Independence act, 1947 D The resolutions of the provincial/ State legislatures of the dominion of India Answer: Option [B]",
        "131 Civil equality implies A equality before law B equality of opportunity C equal distribution of wealth D equal right to participate in the affairs of the state Answer: Option [A]",
        "132 During emergency, imposed under art. 352 which of the following constitutional provisions stands suspended ? A Judicial review B Amendment procedures C Fundamental right D Directive principle of state policy Answer: Option [C]",
        "133 Where is the constitutional power located enabling the central government to legislate on cow slaughter ? A Emergency power B Residuary powers under Art 248 C Entry 17, list 3 in schedule 7 prevention of cruelty to Animals D Art 48 in the directive principles Answer: Option [D]",
        "134 What is the playing time of the full version of the Indian National Anthem ? A 52 seconds B 50 seconds C 47 seconds D 40 seconds Answer: Option [A]",
        "135 What constitutional provision enables the central government to provide reservations in jobs and educational institution for the weaker sections of the society ? A Article 14 B Article 16 C Article 19 D Article 46 Answer: Option [B]",
        "136 Article 370 of the constitution is applicable to the state of: A Manipur B Mizoram C Nagaland D Jammu and Kashmir Answer: Option [D]",
        "137 What provision in the constitution enabled the central government to impose the service tax and to expand its span ? A List 1, Schedule 7 B List 3, Schedule 7 C Residuary powers under Article 248 D Emergency powers Answer: Option [C]",
        "138 Which of the following sets of Article deals with emergency provision ? A Article 32 and 226 B Article 350 and 351 C Articles 335, 336 and 337 D Article 352,356 and 336 Answer: Option [D]",
        "139 Which one of the following is a political right ? A Right to contest elections B Right equality before law C Right to freedom D Right to life Answer: Option [A]",
        "140 Article 14 of the Indian constitutions guarantees Indian citizens: A Equality before law B Equal protection of laws C Equal distribution of economic resources D Equality before law and equal protection of the laws Answer: Option [D]",
        "141 Article 19 of the Indian constitution provides: A 6 freedoms B 7 freedoms C 8 freedoms D 9 freedoms Answer: Option [A]",
        "142 Of various grounds below, which is the one criterion on which discrimination by the state is not prohibited in Article 15 of the constitution ? A Race B Language C Caste D Place of birth Answer: Option [B]",
        "143 Where is the objective of “Social justice” articulated in the constitution of India ? A Art.14 B Art.15 C Art.16 D Preamble Answer: Option [D]",
        "144 \"From each according to his capacity, to each according to his needs\" is: A a secular ideal B a socialist ideal C a communist ideal D a democratic ideal Answer: Option [C]",
        "145 Where in the Indian constitution has “economic justice” been provided as one of the objective ? A Mental Rights B Directive principle C Fundamental Rights D Fundamental rights and the directive principle Answer: Option [B]",
        "146 Which one of the following is not enumerated as a right in the constitution of India ? A Political and social right B Educational right C Economic right D Right to religion Answer: Option [C]",
        "147 From the Constitution of which country the provision of federation was borrowed while framing the constitution of India ? A USA B UK C Canada D Switzerland Answer: Option [C]",
        "148 Who among the following was not a member of the constituent Assembly established in July 1946 ? A Mahatma Gandhi B K M Munishi C Abdul Kalam Azad D Dr. Rajendra Prasad Answer: Option [A]",
        "149 Which Article of the Constitution of India accords special status to the state of Jammu and Kashmir ? A 324 B 311 C 370 D 356 Answer: Option [C]",
        "150 The Indian constitution recognized minorities on the basis of A Cast B Colour C Religion D Percentage of the population of the group to the total population Answer: Option [D]",
        "151 How many spokes are there in the Ashoka Chakra depicted on the National flag of India ? A 16 B 20 C 24 D 32 Answer: Option [C]",
        "152 The basic structure of our constitution was proclaimed by the Supreme Court in A Keshvananda Bharati Case B Golak Nath case C Minerva Mills case D Gopalan Case Answer: Option [A]",
        "153 India is a Republic, because A it is a democratic country B it is a parliamentary democracy C The head of the state is elected for a definite period D All of these Answer: Option [C]",
        "154 Who was the Constitutional Advisor to the Constituent Assembly of India ? A Sir B.N. Rao B K.M. Munshi C Dr. B. R. Ambedkar D Dr. Rajendra Prasad Answer: Option [A]",
        "155 The constitution of India lays down that the two houses of parliament must be summoned at least A once a year B twice a year C thrice a year D four times a year Answer: Option [B]",
        "156 Which organ is the custodian of the national purse ? A Executive B Judiciary C Civil Servants D Legislature Answer: Option [D]",
        "157 The right to vote in election to a parliament is a A Fundamental Right B Constitutional right C Natural right D Legal right Answer: Option [B]",
        "158 Which of the following countries has introduce “Direct democracy” ? A India B France C Russia D Switzerland Answer: Option [D]",
        "159 Which Article of the constitution of India abolishes untouchability and forbids its practice in any form ? A Article 16 B Article 17 C Article 15 D Article 18 Answer: Option [B]",
        "160 Which Article of the Indian constitution provides for the institution a Panchayati Raj ? A Article 36 B Article 39 C Article 40 D Article 48 Answer: Option [C]",
        "161 The Unitary System of Government possesses which of the following advantage ? A Strong State B Greater adaptability C Greater participation by the people D Lesser Chances of authoritarianism Answer: Option [A]",
        "162 Which one of the following is not an element of the State ? A Land B Army C Government D Population Answer: Option [B]",
        "163 How many ‘types of emergencies are envisaged by the Constitution ? A 1 B 2 C 3 D 4 Answer: Option [C]",
        "164 Which constitutional Amendment deleted the Right to Property from the list of Fundamental Rights ? A 42nd Amendment B 43rd Amendment C 44th Amendment D 62nd Amendment Answer: Option [C]",
        "165 English is the official language of which one of the following Indian State ? A Nagaland B Tripura C Assam D Manipur Answer: Option [A]",
        "166 The Panchayat Raj system in India was introduced under the direction of which article of the constitution ? A 32 B 40 C 45 D 51 Answer: Option [B]",
        "167 What should be the gap between first No-Confidence motion and second No-Confidence motion ? A 2 month B 3 month C 6 month D 9 month Answer: Option [C]",
        "168 The Constitution of India assures economic justice to citizens through A Preamble B Fundamental duties C Fundamental Rights D Directive Principles of State Policy Answer: Option [A]",
        "169 Who interprets the Constitution ? A Executive B Legislature C President D Judiciary Answer: Option [D]",
        "170 Nomination of Rajya Sabha Members by the President was taken from the Constitution of: A U.S.A. B Ireland C France D South Africa Answer: Option [B]",
        "171 The concept of Sovereign Parliament originated in: A Japan B France C India D England Answer: Option [D]",
        "172 Who is considered the Architect of the Indian constitution ? A Mahatma Gandhi B B.N. Rao C B.R. Ambedkar D Jawaharlal Nehru Answer: Option [C]",
        "173 The concurrent list in the Indian Constitution is adopted from the Constitution of A U.S.A. B Canada C Germany D Australia Answer: Option [D]",
        "174 “Not to destroy the Government property” is a A Legal duty B Civil duty C Negative duty D Positive duty Answer: Option [B]",
        "175 Which of the following items is under the State List ? A Agriculture B Criminal Law C Defence D Education Answer: Option [A]",
        "176 In the constitution of India, which Article mentions about the establishment of Welfare State in India ? A 99 B 38 C 59 D 69 Answer: Option [B]",
        "177 The essential feature of democracy is giving prominence to the A Executive B Judiciary C Citizen D Civil Society Answer: Option [C]",
        "178 India is a secular state because in our country: A State has no religion B Religion has been abolished C State patronises a particular religion D None of these Answer: Option [A]",
        "179 Which one of the following is a hindrance to liberty and independence ? A Nationalisation B Privatisation C Decentralisation D Centralisation Answer: Option [D]",
        "180 As per Indian Constitution, the Right to Property is a A Fundamental Rights B Natural Rights C Legal Rights D Moral Rights Answer: Option [C]",
        "181 Which one of the following ceased to be a fundamental right under the Constitution ? A Right to Education B Right to work C Right to Property D Right to Equality before Law Answer: Option [C]",
        "182 The idea of Lokpal is taken from A France B America C Britain D Scandinavian Countries Answer: Option [D]",
        "183 Which country is following One Party System ? A Spain B Chile C China D Mongolia Answer: Option [C]",
        "184 The mind and ideals of the framers of Constitution are reflected in the A Preamble B Fundamental Duties C Fundamental Rights D Directive Principles of State Policy Answer: Option [A]",
        "185 In which of the following list docs the subject ‘planning’ figure ? A State List B Concurrent List C Residuary List D Union List Answer: Option [B]",
        "186 Which of the following is not a Union Territory ? A Pondicherry B Daman and Diu C Nagaland D Lakshadweep Answer: Option [C]",
        "187 By which Constitutional Amendment Bill, did the Parliament lower the voting age from 21 to 18 years ? A 42nd B 44th C 61st D 73rd Answer: Option [C]",
        "188 Which of the following is not a feature of Indian Constitution ? A Federal Government B Presidential form of Government C Independence of Judiciary D Parliamentary form of Government Answer: Option [B]",
        "189 The Supreme Court of India was set up: A By the Constitution B By the law of President C By the Presidential Order D By the Act of 1947 Answer: Option [A]",
        "190 Indian Constitution is: A Federal B Quasi Federal C Unitary D Presidential Answer: Option [B]",
        "191 Constitution of India came into force in A 1951 B 1956 C 1950 D 1949 Answer: Option [C]",
        "192 Which of the following parts of the Indian Constitution ensures social and economic democracy ? A Emergency Provisions B Centre- State relations C Directive Principles of State Policy D None of the above Answer: Option [C]",
        "193 Article -1 of the Indian Constitution declares “India that is Bharat” is a: A Union of States B Federal State C Federal State with Unitary features D Unitary State with federal features Answer: Option [A]",
        "194 The Government of India Act, 1935 was based on: A Lord Curzon Commission B Simon Commission C Lord Clive’s report D Dimitrov Thesis Answer: Option [B]",
        "195 The National Emergency in India declared by the President of India due to the external aggression or armed revolt through A Article-352 B Article-356 C Article-360 D Article-368 Answer: Option [A]",
        "196 Who described the Government of India Act, 1935 as a new charter of bondage ? A B.R. Ambedkar B Mahatma Gandhi C Rajendra Prasad D Pt. Jawaharlal Nehru Answer: Option [D]",
        "197 In which part of the Indian Constitution, the fundamental duties are enshrined ? A IV A B IV B C V D IV Answer: Option [A]",
        "198 Who is custodian of the Indian Constitution ? A President of India B Chief Justice of India C Prime Minister of India D Chairman of Rajya Sabha Answer: Option [B]",
        "199 Which has become a legal right under 44th amendment ? A Right to Judicial Remedies B Right of Education C Right to work D Right of Property Answer: Option [D]",
        "200 By which Constitution Amendment Act, Right to Property ceased to remain a fundamental right ? A 44th B 42nd C 43rd D 45th Answer: Option [A]",
        "201 ____ are essential for liberty. A Restrictions B Rights C Privileges D Laws Answer: Option [B]",
        "202 Which is the most important system in Democracy ? A Political B Social C Economic D Governmental Answer: Option [A]",
        "203 Which Article of the Indian Constitution did Dr. B.R. Ambedkar term as the “Heart and Soul of the Indian Constitution” ? A Article 14 B Article 19 C Article 356 D Article 32 Answer: Option [D]",
        "204 Under which Article of the Constitution of India, can the fundamental rights of the members of the Armed Forces be specifically restricted ? A Article 33 B Article 19 C Article 21 D Article 25 Answer: Option [A]",
        "205 Which one of the following languages is not specified in the Eighth schedule of the Indian Constitution ? A Urdu B English C Sindhi D Sanskrit Answer: Option [B]",
        "206 Which Article of the Indian Constitution provides for equal opportunities for all citizen in Public employment ? A Article 25 B Article 22 C Article 20 D Article 16 Answer: Option [D]",
        "207 Which one of the following is opposite to democratic state ? A Despotism B Republic C Socialism D Monarchy Answer: Option [A]",
        "208 The concept of Concurrent List in Indian constitution is borrowed from Constitution of A Japan B Canada C Australia D U.S.A. Answer: Option [C]",
        "209 Under which Article of the Constitution can an individual move to the Supreme Court directly in case of any violation of Fundamental Rights ? A Article 32 B Article 28 C Article 29 D Article 31 Answer: Option [A]",
        "210 To which category right to vote belongs ? A Human Rights B Civil Rights C Natural Rights D Political Rights Answer: Option [D]",
        "211 “Residuary powers” under the Indian Constitution means A The powers relating to International Affairs B The powers relating to International Emergency C The powers, which can be exercised both by the Union Government and the State D The powers, which have not been specifically enumerated in the Union List, State List and Concurrent List Answer: Option [D]",
        "212 Where do we find the ideals of Indian democracy in the Constitution ? A The Preamble B Part III C Part IV D Part I Answer: Option [A]",
        "213 Which Article of the Indian Constitution directs the State Governments to organize Village Panchayats ? A Article 32 B Article 37 C Article 40 D Article 51 Answer: Option [C]",
        "214 Which Article empowers the President to impose Financial Emergency ? A Article 356 B Article 364 C Article 352 D Article 360 Answer: Option [D]",
        "215 Which Article of the Indian Constitution empowers the Parliament to regulate right of citizenship ? A Article 10 B Article 11 C Article 12 D Article 13 Answer: Option [B]",
        "216 Which of the following would be called a “Secular” state ? A The state which is anti-religion B The state which follows a particular religion C The state which does not discriminate between religions D The state which accepts all religions as religions of state Answer: Option [C]",
        "217 Which Amendment Act of the Indian Constitution gave constitutional status to Panchayati Raj System ? A 71st B 72nd C 73rd D 74th Answer: Option [C]",
        "218 The method of amending the Constitution by popular veto is found in A Britain B Switzerland C Russia D India Answer: Option [B]",
        "219 Special status to Jammu and Kashmir is given by the Indian Constitution under the article A 364 B 368 C 370 D 377 Answer: Option [C]",
        "220 The unification of Karnataka was achieved in the year A 1956 B 1957 C 1958 D 1960 Answer: Option [A]",
        "221 Article 1 of the Constitution of India declares India to be a A Union of States B Federal State C Quasi-Federal State D Unitary State Answer: Option [A]",
        "222 Residuary powers in the Indian Constitution have been assigned to A State Legislatures only B Union Parliament only C Both Union Parliament and State Legislatures D None of the above Answer: Option [B]",
        "223 The phrase “equality before law” used in Article- 14 of Indian Constitution has been borrowed from ______ A U.S.A. B Germany C Britain D Greece Answer: Option [C]",
        "224 The playing time (in second) of the full version of Indian National Anthem is A 60 B 52 C 55 D 57 Answer: Option [B]",
        "225 The number of subjects incorporated in the Union List is A 97 B 102 C 82 D 89 Answer: Option [A]",
        "226 Democratic Socialism aims at A Bringing about Socialism through peaceful means B Bringing about Socialism through violent and peaceful means C Bringing about Socialism through violent means D Bringing about Socialism through democratic means Answer: Option [D]",
        "227 How many items are there in the Union List ? A 52 B 66 C 97 D 99 Answer: Option [C]",
        "228 How many times was the Preamble of the Constitution amended so far ? A Once B Two times C Three times D Not amended Answer: Option [A]",
        "229 When did the Constitution Assembly adopt National Anthem ? A 29th January 1950 B 26th January 1950 C 25th January 1950 D 24th January 1950 Answer: Option [D]",
        "230 In which year were the States recognized on a linguistic basis ? A 1947 B 1950 C 1951 D 1956 Answer: Option [D]",
        "231 The state Election Commission conducts, controls and supervises Municipal elections under A Article 240(1) B Article 241 (2) C Article 243 (K) D Article 245 (D) Answer: Option [C]",
        "232 Which of the following judgments stated that ‘Secularism’ and ‘Federalism’ are the basic features of the Indian Constitution ? A Keshavananda Bharati case B S.R. Bommai case C Indira Sawhney case D Minerva Mills case Answer: Option [B]",
        "233 Which one of the Constitutional amendment has established Panchayati Raj Institution ? A 72nd Amendment act B 71st Amendment act C 73rd Amendment act D 78th Amendment act Answer: Option [C]",
        "234 The Election Commission is established under the Article A Article 355 B Article 320 C Article 256 D Article 324 Answer: Option [D]",
        "235 Which of the following is a bulwark of personal freedom ? A Mandamus B Habeas corpus C Quo – Warrantor D Certiorari Answer: Option [B]"
    ]
}