{
    "Topic": "Indian Polity",
    "Subject": "Directive Principles of State Policy",
    "data": [
        "1 The purpose of Directive Principles of State Policy is to : A lay down positive instructions which would guide State policy at all levels. B implement Ganhiji's idea for a decentralized state. C check the use of arbitrary powers by the government. D promote welfare of the backward section of the society. Answer: Option [A]",
        "2 Which of the following Directive Principles is based on Gandhian ideology? A Equal pay for equal work for men and women. B Guarding the children against exploitation and moral degradation. C Uniform civil code for all citizens. D Promotion of Cottage industries. Answer: Option [D]",
        "3 Which part of the Indian Constitution deals with the Directive Principles of State Policy ? A Part III B Part IV C Part V D Part VI Answer: Option [B]",
        "4 The enforcement of Directive Principles depends most on A the President B the Court C resources available to the government D Chief Justice of India Answer: Option [C]",
        "5 One of the objectives of Directive Principles of State Policy is : A total prohibition B prevention of gambling and lotteries. C making effective provisions for securing the right to work, education and public assistance in case of unemployment, old age, sickness and disablement. D all of these Answer: Option [C]",
        "6 Directive Principles of State Policy are fundamental for : A governance of the Country. B upliftment of backward classes. C protection of Constitution. D protection of individual rights. Answer: Option [A]",
        "7 Which of the following cannot be termed as Gandhian principle among the Directive Principles of State Policy? A To organize village Panchayats. B To prohibit intoxicating drinks and drugs that are injurious to health. C To preserve and improve the breeds of the cattle and prohibit slaughter of cows, calves and other milch and drought animals. D Provision for early childhood care and education to children below the age of six years. Answer: Option [D]",
        "8 Directive Principles are : A Justifiable as Fundamental Rights. B Justifiable but not as Fundamenta Rights. C Decorative portions of Indian Constitution. D Not Justifiable yet fundamental in governance of the Country. Answer: Option [D]",
        "9 The architects of Indian Constitution borrowed the concept of Directive Principles from : A the Constitution of USA. B the Constitution of UK. C the Constitution of Ireland. D Government of India Act, 1935 Answer: Option [C]",
        "10 The term 'equal pay for equal work' is a : A Directive Principle of State Policy. B Statutory provisions in Labour Law. C Fundamental Rights. D Matter of State to pass Bill. Answer: Option [A]",
        "11 Under the Directive Principles of State Policy, up to what age of the children, they are expected to be provided free and compulsory education? A 14 years B 15 years C 16 years D 18 years Answer: Option [A]",
        "12 ‘Directive Principles’ in our Constitution are A Quasi-enforceable B Party non – enforceable C Enforceable in the courts of law D Non – enforceable in the courts of law Answer: Option [D]",
        "13 The Directive Principles of State Policy was adopted from the A British Constitution B Irish Constitution C U.S. Constitution D Swiss Constitution Answer: Option [B]",
        "14 The idea of ‘Directive Principles of State Policy’ was borrowed by the framers of the Indian Constitution from the Constitution of A Canada B South Africa C The Republic of Ireland D The Republic of Germany Answer: Option [C]",
        "15 Which part of the Constitution deals with the Directive Principles of State Policy? A Part-III B Part-IV C Part-I D Part-II Answer: Option [B]",
        "16 The main purpose of including the Directive Principles of State Policy in the Indian Constitution is to A Establish a welfare State B Establish a secular State C Check the arbitrary action of the Government D Provide best opportunities of development by the Government Answer: Option [A]",
        "17 Political equality is found in A The absence of privileges B Equal distribution of wealth C Universal adult suffrage D The rationality of the individual Answer: Option [C]",
        "18 ‘Equality before law’ in India is derived from A Constitution B Case Law C Political Conventions D Gandhian Philosophy Answer: Option [A]",
        "19 Directive Principles of State Policy in the Indian Constitution were taken from the Constitution of A Britain B Ireland C USA D Canada Answer: Option [B]",
        "20 Which one of the following kinds of equality is not compatible with the liberal nation of equality? A Legal Equality B Political Equality C Social Equality D Economic Equality Answer: Option [D]",
        "21 Political liberty implies A Votes can make and unmake their government B Co-operation between politics and democracy C Free political activities of the people D People’s control over the government Answer: Option [C]"
    ]
}