{
    "Topic": "Indian Economy",
    "Subject": "Federel Finance System",
    "data": [
        "1 Which one of the following tax is within the jurisdiction of the State Governments as enumerated in List – II of the Constitution of India? A Taxes other than stamp duties on transactions in stock exchange and future markets B Taxes on Railway freights and fares. C Taxes on mineral rights subject to any limitations imposed by the Parliament. D Rate of stamp duty in respect of certain financial documents. Answer: Option [C]",
        "2 Which of the following taxes is introduced in India in 1953 and abolished in 1985? A Estate Duty B Expenditure Tax C Gift Tax D Agricultural Income-tax Answer: Option [A]",
        "3 The Constitution of India provides for transfer of resources from Centre to States in the form of: I. Tax sharing II. Loans III. Grants-in-aid IV. Grants for implementation of Five Year Plans A (i), (ii) and (iii) are correct B (i) and (iii) are correct C (i), (iii) and (iv) are correct D All are correct Answer: Option [A]",
        "4 The share of the tax borne by the seller will be larger: A if the demand for the product is less elastic B if the demand for the product is inelastic C if the demand for the product has greater elasticity D if the elasticity of supply of the product is larger Answer: Option [C]",
        "5 The Sarkaria Commission has been appointed by the Government of India to report on: A Child Development B Centre-State relations C Stabilize agricultural prices D Study and report the representation of Backward Classes in the State public services Answer: Option [B]",
        "6 The distribution of the burden of paying a tax is called: A Sharing of tax burden B Shifting of the tax C Incidence of a tax D Tax capitalization Answer: Option [C]",
        "7 Grants from the Centre to the States under the recommendations of Finance Commission are known as: A Plan grants B Development assistance C Statutory grants D Discretionary grants Answer: Option [C]",
        "8 Funds not belonging to the Government are called: A Contingency Fund B Private Accounts C Consolidated Fund D Public Accounts Answer: Option [B]",
        "9 Which are the three inter-related activities involve in the process of Capital Formation? A Savings, Finance and Donation B Savings, Loan and Investment C Donation, Loan and Investment D Savings, Finance and Investment Answer: Option [D]",
        "10 Which of the following is not an element of Financial Organisations? A Public ownership of Financial Institution B Strengthening of Institutional Structure C Establishment of more Microfinance Organizations D Protection to Investors Answer: Option [C]",
        "11 Which among the following statements is not true when there is an increase in interest rate in an economy? A Increase in saving B Decrease in loan C Increase in production cost D Increase in capital return Answer: Option [D]",
        "12 How the interest-level of a country is affected by FDI? A Increases B Decreases C Remains unaffected D There is increase or decrease Answer: Option [B]",
        "13 Which among the following is not a non-customs duty obstacle in the world trade? A Quantity restriction B Restrictions on goods quality C Determination of import duty uniformly D Establishment of Standard of labour in manufacturing Answer: Option [C]",
        "14 Which among the following has the least possibility of globalization? A Increase in infrastructure B To manage resources for investment C Selections of labour force D Location of capital works Answer: Option [D]",
        "15 Indirect tax means: A Tax base is income B Direct relationship between tax payer and the government C There is not direct relationship between the tax payer and the government D The incidence and impact are on the same person on whom tax is imposed Answer: Option [C]",
        "16 Which one of the following is NOT an example of indirect tax? A Expenditure tax B Customs duty C Excise duty D Sales tax Answer: Option [A]",
        "17 The major aim of devaluation is to: A Encourage imports B Encourage exports C Encourage both exports and imports D Discourage both exports and imports Answer: Option [B]",
        "18 Interest on public debt is a part of: A National income B Interest payments by households C Transfer payments by the Govt. D Transfer payments by the enterprises Answer: Option [C]",
        "19 What is USP in marketing field? A US Programme based B Uninterrupted power supply C Exclusive marketing features D Unique Selling Proposition Answer: Option [D]",
        "20 A tax is characterized by horizontal equity if its liability is A Proportional to the income of tax payers B The same for every tax payer C Similar for tax payers in similar circumstances D Proportional to the expenditure of tax payers Answer: Option [A]",
        "21 What does a Leasing Company provide? A Office accommodation on hire B Machinery and capital equipment on hire C Technical consultancy and experts for a fee D Legal guidance in establishing an enterprise Answer: Option [B]",
        "22 Buoyancy of a tax is defined as A Increase in tax revenue/increase in tax base B Increase in tax revenue/percentage increase in tax coverage C Percentage increase in tax revenue /increase in tax coverage D Percentage increase in tax revenue/percentage increase in tax base Answer: Option [A]",
        "23 Economic rent refers to: A Payment made for the use of capital B Payment made for the use of labour C Payment made for the use of land D Payment made for the use of Organization Answer: Option [C]",
        "24 The existence of a Parallel Economy or Black Money A Makes the monetary policies less effective B Makes the economy more competitive C Ensures increasing productive investment D Ensures a better distribution of income and wealth Answer: Option [A]",
        "25 The incidence of sales tax falls on A Producers B Retail dealers C Wholesale dealers D Consumers Answer: Option [D]",
        "26 Equilibrium is a condition that can A Change only if government policies change B Change only if some internal factor changes C Change only if some outside factor changes D Never change Answer: Option [B]",
        "27 What are the main components of basic social infrastructure of an economy? A Industry, Trade and Transport B Transport, Health and Banks C Education, Industry and Agriculture D Education, Health and Civil amenities Answer: Option [D]",
        "28 Which one of the following taxes is collected and utilized by the State Government? A Custom duties B Land revenue C Corporation tax D Personal Income tax Answer: Option [B]",
        "29 Investment is equal to A Stock of plants, machines and equipment B Gross total of all types of physical capital assets C Gross total of all capital assets minus wear and tear D None of these Answer: Option [C]",
        "30 Deficit financing is an instrument of A Tax policy B Credit policy C Fiscal policy D Monetary policy Answer: Option [C]",
        "31 A closed economy is one which A is not a member of the U. N. O. B does not have a coastal line C does not trade with other countries D does not possess any means of international transport Answer: Option [C]",
        "32 Operating Surplus arises in the A Government Sector B Enterprise Sector C Subsistence farming D Production for self-consumption Answer: Option [A]",
        "33 Which of the following taxes is such which does not cause rise in price? A Sales tax B Income tax C Import duty D None of the above Answer: Option [B]",
        "34 Who among the following has suggested tax on expenditure? A Musgrave B Dalton C Kaldor D Gautam Mathur Answer: Option [C]",
        "35 Excise duty on a commodity is payable with reference to its A Production B Production and sale C Production and transportation D Production, transportation and sale Answer: Option [A]",
        "36 What is Value Added Tax (VAT)? A A new tax to be imposed on the producers of capital goods B A simple, transparent, easy to pay tax imposed on consumers C A single tax that replaces State taxes like, surcharge, turnover tax, etc. D A new initiative taken by the Government to increase the tax-burden of high income groups Answer: Option [C]",
        "37 A mixed economy works primarily through the A Market mechanism B Central allocative machinery C Market mechanism regulated by Government policy D Market mechanism guided by Government participation and planning Answer: Option [D]",
        "38 ‘Golden Handshake Scheme’ is associated with A Voluntary retirement B Inviting foreign companies C Establishing joint enterprises D Private investment in public enterprises Answer: Option [A]",
        "39 According to modern thinking the law of diminishing returns applies to A Mining B Industry C Agriculture D All fields of production Answer: Option [D]",
        "40 If the tax rate increase with the higher level of income , it shall be called A Regressive tax B Lump sum tax C Progressive tax D Proportional tax Answer: Option [C]",
        "41 Which of the following is the classification of Industries on the basis of raw-materials? A Basics and Consumer B Primary and Secondary C Small Scale – Large scale D Agro-based and Mineral based Answer: Option [D]",
        "42 Which is the most essential function of an entrepreneur? A Risk bearing B Marketing C Management D Supervision Answer: Option [A]",
        "43 Excise duty on a commodity is payable with reference to its A Production B Production and sale C Production and transportation D Production, transportation and sale Answer: Option [A]",
        "44 Purchasing Power Parity theory is related with A Wage rate B Bank rate C Exchange rate D Interest rate Answer: Option [C]",
        "45 Which of the following taxes is not collected by the Central Government? A Excise duty B Professional tax C Income tax D Customs duty Answer: Option [B]",
        "46 Which one of the following is a developmental expenditure? A Grant-in-aid B Debt services C Civil administration D Irrigation expenditure Answer: Option [D]",
        "47 “Interest is a reward for parting with liquidity” is according to A Marshall B Keynes C Ohlin D Haberler Answer: Option [B]",
        "48 Surplus earned by a factor other than land in the short period of referred to as A Quasi-rent B Net rent C Economic rent D Super-normal rent Answer: Option [A]",
        "49 Which from the following is not true when the interest rate in the economy goes up? A Lending decreases B Saving increases C Return on capital increases D Cost of production increases Answer: Option [C]",
        "50 At present, India is following A Fixed exchange rate B Floating exchange rate C Pegged up exchange rate D Pegged down exchange rate Answer: Option [B]",
        "51 The terms “Micro Economics” and “Macro Economics” were coined by A J.M. Keynes B Ranger Frisch C Ranger Nurkse D Alfred Marshall Answer: Option [B]",
        "52 The existence of a parallel economy or Black Money A Makes the economy more competitive B Ensures increasing productive investment C Makes the monetary policies less effective D Ensures a better distribution of income and wealth Answer: Option [C]",
        "53 Which from the following taxes are levied and collected by the centre but their net proceeds are wholly transferred to states? A Taxes on Advertisement B Stamps and Registration C Expenditure Tax and Gift Tax D Additional Duties of Excise in lieu of Sales Tax Answer: Option [A]",
        "54 Which from the following sets belongs to Central tax? A Custom duty, Entertainment tax and Income tax B Income tax, Custom duty and House tax C Excise duty, Custom duty and Income tax D Excise duty, Sales tax and Custom duty Answer: Option [C]",
        "55 Disinvestment in Public Sector is called A Privatisation B Industrialisation C Globalisation D Liberalisation Answer: Option [A]",
        "56 Rate of interest is determined by A Central Government B Commercial Banks C Liquidity preference D The rate of return on the capital invested Answer: Option [B]",
        "57 The Government set up a committee headed by the Chairman, Central Board of Direct Taxes some time back to go into- A Codification of tax laws B The concerns of the foreign investors in India with regard to taxation matters C The entire structure of tax laws including the question of imposition of bank tax D Aspects of generation of black money, its transfer abroad and bringing back such money into India’s legitimate financial system Answer: Option [D]",
        "58 Which from the following is a part of tertiary sector? A Power and transportation B Cultivation of crops C Animal Husbandry D Super-normal rent Answer: Option [A]",
        "59 A mixed economy refers to an economic system where A Only the private sector operates under government control B The economy functions with foreign collaboration C Both the government and the private sectors operate sectors operate simultaneously D No foreign investment is allowed Answer: Option [C]",
        "60 A Black Market is a situation wherein A Goods are sold secretly B Goods are loaded by the producers C Goods are made available (sold) only after there is a rise in prices D Goods are sold at prices higher than what is fixed by the Government Answer: Option [A]",
        "61 ‘Quota’ is A Tax levied on imports B Imports of capital goods C Limit on the quantity of exports D Limit on the quantity of imports Answer: Option [D]",
        "62 The ‘Canons of Taxation’ were propounded by A Dalton B J. M. Keynes C Adam Smith D Edwin Canon Answer: Option [C]",
        "63 ‘PROTECTION’ means A Protection to home industries B Restrictions imposed on import trade C No free exchange of goods and services between two countries D All of the above Answer: Option [D]",
        "64 Agricultural income tax is a source of revenue to A State Government B Central Government C Local Administration D Centre and State Governments Answer: Option [A]",
        "65 Beyond a certain point deficit financing will certainly lead to A Inflation B Deflation C Recession D Economic stagnation Answer: Option [A]",
        "66 The tax levied on gross sales revenue from business transactions is called A Sales Tax B Turnover Tax C Corporation Tax D Capital Gains Tax Answer: Option [B]",
        "67 The duties levied on alcoholic liquors, narcotic drugs and opium come under- A Land Revenue B State Excise Duty C General Sales Tax D Central Excise Duty Answer: Option [D]",
        "68 Multinational Corporation is also called A Finance Corporation B Trading Corporation C Trans-national Corporation D International Corporation Answer: Option [C]",
        "69 Corporation tax is a tax imposed on A The corporate properties B The net incomes of the companies C The utilities provided by the Corporation D Tax imposed by the Corporation on individual properties Answer: Option [B]",
        "70 Parallel economy emerges due to A Tax Estimation B Tax Compliance C Tax Evasion D Tax Avoidance Answer: Option [C]",
        "71 Freeing the economy from all unnecessary controls and regulations is referred to as A Freedom B Liberalisation C Globalisation D Privatisation Answer: Option [B]",
        "72 The incidence of Tax refers to A Who pays the Tax? B How Taxes can be shifted? C Who bears the burden of Tax? D Who transfers the Tax burden? Answer: Option [C]",
        "73 Economic rent does not arise when the supply of a factor unit is A Perfectly elastic B Perfectly inelastic C Relatively elastic D Relatively inelastic Answer: Option [A]",
        "74 If the main objective of the government is to raise revenue, it should tax commodities with A High elasticity of demand B Low elasticity of demand C Low elasticity of supply D High income elasticity of demand Answer: Option [B]",
        "75 Economic growth is dependent mainly on A Price stability B Population growth C Level of consumption D Level of investment Answer: Option [D]",
        "76 Interest paid by the government on the loans raised is called A Debt Servicing B Bridge-loan C Deficit Financing D Discounted Budgeting Answer: Option [A]",
        "77 Who said, “Economics is the Science of Wealth”? A Keynes B Adam Smith C J.S. Mill D Robbins Answer: Option [B]",
        "78 Value of output and value added can be distinguished if we know: A The value of the sales B The value of net indirect taxes C The value of intermediate consumption D The value of consumption of fixed capital Answer: Option [C]",
        "79 Which one of the following is not a ‘cannot of taxation’ according to Adam Smith? A Canon of simplicity B Canon of certainty C Canon of economy D Canon of convenience Answer: Option [A]",
        "80 Indirect taxes by nature are A Proportional B Progressive C Regressive D Degressive Answer: Option [C]",
        "81 The Minimum Wages Act was First passed in India in the year: A 1947 B 1948 C 1949 D 1950 Answer: Option [B]",
        "82 ‘Hire and Fire’ is the policy of A Socialism B Capitalism C Mixed Economy D Traditional Economy Answer: Option [C]",
        "83 ‘Mixed economy’ refers to A The co-existence of rich as well as poor B The co-existence of public as well as private sector C The promotion of agriculture as well as cottage industries D The co-existence of heavy, small scale and cottage industries Answer: Option [B]",
        "84 Taxation is a tool of A Wage policy B Price policy C Fiscal policy D Monetary policy Answer: Option [C]",
        "85 Which one of the following is not included in current revenue of the Union Government? A Loans B Tax revenue C Non-tax revenue D Interest payments Answer: Option [A]",
        "86 Which one of the following is a direct tax? A Sales Tax B Excise Tax C Wealth Tax D Entertainment Tax Answer: Option [C]",
        "87 Micro-economy is also called: A Income theory B Price theory C Investment theory D Expenditure theory Answer: Option [B]",
        "88 Demand in Economics means: A Market demand B Aggregate demand C Individual demand D Demand backed by purchasing power Answer: Option [D]",
        "89 The principle of maximum social advantage is the basic principle of A Macro Economics B Micro Economics C Fiscal Economics D Environmental Economics Answer: Option [C]",
        "90 Value-added means value of A Output at market prices B Output at factor cost C Goods and services less depreciation D Goods and services less cost of intermediate goods and services Answer: Option [D]",
        "91 Which of the following is an indirect tax? A Estate Duty B Wealth Tax C Excise Duty D Capital Gains Tax Answer: Option [C]",
        "92 Taxes on professions can be levied by: A State government only B Union government only C Both by state and union government D By Panchayats only Answer: Option [A]",
        "93 Which one is not a function of money? A Value measurement B Price stabilisation C Store of value D Transfer of value Answer: Option [B]",
        "94 “Closed Economy” means: A No provision for public sector B No provision for private sector C Economy policy not well defined D A country having no imports and exports Answer: Option [D]",
        "95 Which of the following subjects does not figure in the Concurrent List of our Constitution? A Forests B Trade unions C Stock Exchanges and futures markets D Protection of wild animals and birds Answer: Option [C]",
        "96 Debenture holders of a company are its A Directors B Debtors C Creditors D Shareholders Answer: Option [C]",
        "97 Savings rate is relatively low in developed economies because of A Welfare programmes B High interest rate C Low per capital income D Liquidity/Borrowing constraint Answer: Option [A]",
        "98 The terms ‘Bull’ and ‘Bear’ are associated with A Internet Trade B Stock Market C Foreign Trade D Banking Answer: Option [B]",
        "99 Taxes are as certain as the death, because A Most PSU s are run inefficiently B Government has its own budget constraints C Government have no other source of revenue D They constitute the major source of government revenue Answer: Option [D]"
    ]
}