{
    "Topic": "Geography",
    "Subject": "Geo-Tectonics",
    "data": [
        "1 Instrument used to measure earthquake is known as A seismograph B quake meter C barometer D none of the above Answer: Option [A]",
        "2 Magnitude of energy released by an earthquake is calculated using A Earthquake scale B Seismic scale C Richter scale D Temblor scale Answer: Option [C]",
        "3 The point within the Earth where earthquakes originate is: A comma B origin C epicenter D focus Answer: Option [D]",
        "4 Place directly above focus on Earth's surface is known as A strike B comma C epicenter D origin Answer: Option [C]",
        "5 In general, the most destructive earthquake waves are the __________ . A P waves B S waves C Surface waves D All of the above Answer: Option [C]",
        "6 P Waves are also said to be __________ waves. A push-pull B side-side C up-down D none of the above Answer: Option [A]",
        "7 P Waves can pass through ______ A crust and core only B liquids and gases only C solids, gases, and liquids D none of the above Answer: Option [C]",
        "8 Earthquakes occur most frequently at A plate boundaries B plate surface C ocean beds D all of the above Answer: Option [A]",
        "9 Amount of energy released by an earthquake is also known as A wave B scale C unit D magnitude Answer: Option [D]",
        "10 How many seismograph stations are needed to locate the epicenter of an earthquake ? A 2 B 3 C 4 D 5 Answer: Option [B]",
        "11 S Waves can pass through ________. A solids only B gases only C liquids only D all of the above Answer: Option [A]",
        "12 The _____Waves are said to the most damaging to humans. A S B P C L D Q Answer: Option [C]",
        "13 Vibrations radiate from focus in all direction as A Seismic waves B Transverse waves C Longitudinal waves D None of the above Answer: Option [A]",
        "14 The amount of ground displacement in an earthquake is called the _________ A focus B slip C dip D none of the above Answer: Option [B]",
        "15 The _____Waves are the slowest. A Q B P C S D L Answer: Option [D]",
        "16 The _____ Waves are the fastest A P B L C S D Q Answer: Option [A]",
        "17 Earthquakes occur when there is a sudden release of stored up energy in Earth's A outer core B inner core C upper mantle D none of the above Answer: Option [C]",
        "18 Body waves consist of the: A S waves only B P waves only C Surface waves D Both (A) and (B) Answer: Option [D]",
        "19 P waves are: A tensional surface waves. B transverse surface waves. C compressional body waves. D none of the above Answer: Option [C]",
        "20 Earthquakes usually occur at boundary of A coral plate B crustal plates C volcanic beds D all of the above Answer: Option [B]",
        "21 Magma which is forced onto Earth's surface is known as A Lava B Vent C Cone D None of the above Answer: Option [A]",
        "22 Volcanoes that erupt frequently are known as A Active volcanoes B Extinct volcanoes C Instinct volcanoes D Dormant volcanoes Answer: Option [A]",
        "23 Volcanoes that haven't erupted in historic times are known as A Active volcanoes B Instinct volcanoes C Dormant volcanoes D Extinct volcanoes Answer: Option [D]",
        "24 Basic lava erupts out of volcano, throwing out mainly A CO B dust C ash D all of the above Answer: Option [C]",
        "25 Shield volcanoes are _____ in size: A Small B Medium C Huge D None of the above Answer: Option [C]",
        "26 A hole in Earth's crust through which magma comes to Earth's surface is known as A Crater B Vent C Cone D Pipe Answer: Option [B]",
        "27 Layers of volcanic materials that build up around vent to form a cone-shaped structure are known as A Crater B Vent C Cone D None of the above Answer: Option [C]",
        "28 Fluidity of lava is determined by amount of A silica B copper C iron D zinc Answer: Option [A]",
        "29 Top of magma is forced onto Earth's surface is known as A Pipe B Cone C Vent D Crater Answer: Option [D]",
        "30 Volcanoes that have erupted in historic times and are still likely to erupt, are known as A Instinct volcanoes B Active volcanoes C Dormant volcanoes D Extinct volcanoes Answer: Option [C]",
        "31 This is the scale used to measure the size of volcanic eruptions A Richter Scale B Volcanic Explosivity Index C Volcano Eruptivity Scale D None of the above Answer: Option [B]",
        "32 Eruptions from composite volcanoes are usually A light and less violent B loud but less violent C soft and more violent D loud and more violent Answer: Option [D]",
        "33 Acid lava flows slowly as it is highly A dense B viscous C sensitive D all of the above Answer: Option [B]",
        "34 Passageway which joins vent to crater of volcano is known as A Crater B Vent C Cone D Pipe Answer: Option [D]",
        "35 Eruptions of composite volcanoes are loud and violent because that contain A basic lava B viscous composite lava C viscous acid lava D none of the above Answer: Option [C]",
        "36 In which direction the Earth rotates around its axis ? A north to south B east to west C west to east D randomly Answer: Option [C]",
        "37 Mohs scale is used to determine : A degree of brightness of a substance B degree of hardness of minerals C degree of viscosity of a liquid D degree of elasticity of a material Answer: Option [B]",
        "38 In which situation Spring tides can occur : A the moon, sun and the earth are at right angles with the earth at the apex B the moon is farthest from the earth C the sun is closest to the earth D the moon, the sun and the earth in the same line Answer: Option [D]",
        "39 Total surface area of the earth in square kilometer is : A 510.1 million square kilometer B 512.8 million square kilometer C 520 million square kilometer D 525.7 million square kilometer Answer: Option [A]",
        "40 The Earth while rotates around the Sun It always keeps its axis pointed towards : A the moon B the pole star C Venus D the sun Answer: Option [B]",
        "41 The greatest amount of isolation is received by which place of Earth's surface ? A Tropical rainforest B Tropical deserts C Savanna region D Equatorial region Answer: Option [B]",
        "42 What is the actual shape of the Earth ? A flat B circle C sphere D oblate spheroid Answer: Option [D]",
        "43 What is the circumference of the Earth in kilometers ? A 38005 KM B 40075 KM C 41000 KM D 41075 KM Answer: Option [B]",
        "44 Tides in the sea have stored in them : A hydraulic energy B kinetic energy C gravitional potential energy D a combination of all the above three forms of energy Answer: Option [D]",
        "45 Consider the following statements : I. The tropical year is shorter than the sidereal year. II. The solar day is longer than the sidereal day. Which of the statements given above is/are correct ? A I only B II only C Both I and II D Neither I nor II Answer: Option [C]",
        "46 Tropic of Cancer does not pass through which one of the following countries ? A Bangladesh B China C Nepal D India Answer: Option [C]",
        "47 The upper part of the mantle upon which the crust of the Earth floats is called : A barysphere B mesosphere C Mohorovicic discontinuity D asthenosphere Answer: Option [D]",
        "48 Who among the following was the first to measure the circumference of the Earth ? A Eratosthenes B Aristotle C Hecataeus D Herodotus Answer: Option [A]",
        "49 The International Date line passes through : A Bering strait B Gibraltar strait C Florida strait D Malacca strait Answer: Option [A]",
        "50 What happens when a ship crosses International Date Line from west to east ? A It gains one day B It loses one day C It loses 10 hrs D It gains half a day Answer: Option [B]",
        "51 What is the time difference between longitudes ? A 5 minutes B 5 minutes 20 seconds C 4 minutes D 4 minutes 20 seconds Answer: Option [C]",
        "52 The time required for the earth to return to a given point in its orbit with reference to fixed star is : A Lunar year B Solar year C Tropcal year D Sidereal year Answer: Option [D]",
        "53 The Earth is an oblate spheroid and not a perfect sphere. This is because : I. The Earth has a rotational motion and the rotational speed increases as one goes from the Poles towards the Equator. II. The Equator experiences greater gravitional pull from the Sun. III. The intensity of sunlight received at the Equator is greater than that at the Poles. A I only B I and II C III only D I, II and III Answer: Option [B]",
        "54 Consider the following statements : Which of these statements are correct? I.Earth is the fourth largest planet of the solar system II. The circumference of Earth is about 40000 KM III. Earth's Polar diameter is about 43 KM shorter than its equatorial diameter IV. The total surface area of Earth is about 510 million square KM A I and II B III and IV C I, II and III D II, III and IV Answer: Option [D]",
        "55 How many kilometers are represented by 1 degree of latitude ? A 191 KM B 161 KM C 141 KM D 111 KM Answer: Option [D]",
        "56 The Tropic of Cancer passes through : A India and Iran B Iran and Pakistan C India and Saudi Arabia D Iran and Iraq Answer: Option [C]",
        "57 The Core of the Earth is made up of : A mainly of iron in the liquid form B mainly of nickel in the liquid form C both iron and silica in the liquid form D both iron and magnesium in the plastic state Answer: Option [D]",
        "58 Which one of the following minerals occurs abundantly in the earth's crust ? A Bauxite B Silica C Manganese D Iron Answer: Option [B]",
        "59 Which one of the following elements is the most abundant in the Earth's crust ? A Oxygen B Sulpher C Silicon D Carbon Answer: Option [A]",
        "60 The approximate circumference of the Earth is : A 13000 km B 20000 km C 25000 km D 40075 km Answer: Option [D]"
    ]
}