{
    "Topic": "Indian Economy",
    "Subject": "History Development and Planning",
    "data": [
        "1 Who is the father of Economics ? A Max Muller B Adam Smith C Karl Marx D None of these above Answer: Option [B]",
        "2 Indian Economy is : A Socialistic Economy B Gandhian Economy C Mixed Economy D Free Economy Answer: Option [C]",
        "3 Mixed economy means an economy where A both agriculture and industry are equally promoted by the state B there is co-existence of public sector along with private sector C there is importance of small scale industries along with heavy industries D economy is controlled by military as well as civilian rulers Answer: Option [B]",
        "4 India's economic planning CANNOT be said to be : A indicative B imperative C limited D democratic Answer: Option [B]",
        "5 Which one of the following is the task of the Planning Commission ? A Preparation of the plan B Implementation of the plan C Financing of the plan D None of these above Answer: Option [A]",
        "6 Which one of the following bodies finalizes the Five Year Plan Proposals ? A Planning Commission B Union Cabinet C National Development Council D Ministry of Planning Answer: Option [C]",
        "7 Which one of the following is true about Planning Commission ? A It is a Ministry B It is a Government Department C It is an Advisory Body D It is an Autonomous Corporation Answer: Option [C]",
        "8 Economic survey is published by : A Ministry of Finance B Planning Commission C Govt of India D Indian Statistical Institute Answer: Option [A]",
        "9 Who is the Chairman of the Planning Commission in India ? A President B Vice President C Prime Minister D Finance Minister Answer: Option [C]",
        "10 The Deputy Chairman of the Planning Commission : A HRD Minister B Finance Minister C Holds the rank of a cabinet minister D is an economist of repute Answer: Option [C]",
        "11 In which one of the following Five Year Plans the actual growth performance in India in respect of GDP (at factor cost) was less than the target set ? A Sixth Five Year Plan B Seventh Five Year Plan C Eighth Five Year Plan D Ninth Five Year Plan Answer: Option [D]",
        "12 The Second Five Year Plan laid more stress upon: A Industrialisation B Removing poverty C Self-reliance D Agriculture Answer: Option [A]",
        "13 A rolling plan is a plan for: A One year B Two years C Three years D Five years Answer: Option [A]",
        "14 Rolling plan was designed for the period: A 1974-79 B 1978-83 C 1980-85 D 1985-90 Answer: Option [B]",
        "15 The main objective of First Five-Year Plan was: A Self-reliance B Industrial growth C Economic growth D Development of agriculture including irrigation and power projects Answer: Option [D]",
        "16 Major percentage of working population of India is engaged in: A tertiary sector B secondary sector C private sector D public sector Answer: Option [C]",
        "17 Planning in India derives its objectives from: A Preamble B Fundamental Duties C Fundamental Rights D Directive Principles of State policy Answer: Option [D]",
        "18 Economic Planning is a subject defined in which of the following lists: A In the State List B In the Union List C In the Concurrent List D Unspecified in any special List Answer: Option [C]",
        "19 The contribution of agriculture to India’s economy is: A Constant B Increasing C Decreasing D None of these Answer: Option [C]",
        "20 India opted for ‘Mixed Economy’ in: A Framing of the Constitution B Industrial Policy of 1948 C Second Five Year Plan D None of the above Answer: Option [B]",
        "21 The concept of Five Year Plans in India was introduced by A Jawaharlal Nehru B Indira Gandhi C Lal Bahadur Shastri D Morarji Desai Answer: Option [A]",
        "22 During which five year plan did prices show a decline ? A First B Third C Fifth D Sixth Answer: Option [A]",
        "23 Success of 4th plan was obstructed by: A Problem of Bengal refugees B War with Pakistan C Poor monsoon D All of the above Answer: Option [D]",
        "24 What is the correct duration of revised 6th National Development Plan ? A 1974-79 B 1978-83 C 1980-85 D 2013-16 Answer: Option [D]",
        "25 The strategy of Rolling plan was adopted during the Prime Ministership of: A Indira Gandhi B Morarji Desai C Rajiv Gandhi D Jawaharlal Nehru Answer: Option [B]",
        "26 The basic feature of the Rolling Plans was that: A Revision of the achievements of previous year B No physical targets were visualized C No financial target except in the term of annual plans was envisaged D Annual fluctuations in prices and major economic developments could be considered while fixing targets Answer: Option [D]",
        "27 During which Five Year Plan was the total expenditure on agriculture the highest ? A First Five Year Plan B Second Five Year Plan C Third Five Year Plan D Fourth Five Year Plan Answer: Option [D]",
        "28 The first Chairman of the Planning Commission was A Indira Gandhi B Dr. Rajendra Prasad C Pt. Jawaharlal Nehru D Sardar Vallabhbhai Patel Answer: Option [C]",
        "29 In which of the Five Year Plan, the weaker sections of the society got priority ? A Fifth B Fourth C Third D None of these Answer: Option [A]",
        "30 The growth rate of agricultural production was negative in the: A First Plan B Second Plan C Third Plan D All of the above Answer: Option [C]",
        "31 ‘Globalisation of Indian Economy’ means: A Stepping up external borrowings B Establishing Indian Shopping Malls in abroad C Giving up programmes of import substitution D Having minimum possible restrictions on economic relations with other countries Answer: Option [D]",
        "32 National Development Council was set up in: A 1952 B 1950 C 1949 D 1948 Answer: Option [A]",
        "33 ‘Take off stage’ in an economy means: A Economy is stagnant B Steady growth begins C Economy is about to collapse D All controls are removed Answer: Option [B]",
        "34 Which of the following indicates economic growth through Five Year Plans ? A Rise in national income and per capita income B Development of railways and roadways C Development of education and health services D Development of industrial towns and industrial estate Answer: Option [A]",
        "35 Which one of the following Five-Year Plans recognised human development as the core of the developmental efforts ? A The Fourth Five-Year Plan B The Fifth Five-Year Plan C The Sixth Five-Year Plan D The Eighth Five-Year Plan Answer: Option [D]",
        "36 Which of the following statements about the Indian Economy is correct ? A In India, single biggest employment is agriculture and allied activities B No physical targets were visualized C About 48% Indian workforce is employed in foreign countries or in organizations assisted by foreign capital D About 70% Indians are involved in some type of self- employment and are the owners of some or the other micro or small enterprise Answer: Option [A]",
        "37 In the context of India’s Five Year Plans, a shift in the pattern of industrialization, with lower emphasis on heavy industries and more on infrastructure begins in A Tenth Plan B Eighth Plan C Sixth Plan D Fourth Plan Answer: Option [B]",
        "38 A “closed economy” is a kind of economy in which A Only exports take place B The money supply is fully controlled C Deficit financing takes place D Neither exports nor imports take place Answer: Option [D]",
        "39 Which statement is correct for Indian Planning Commission ? A Members do not require any minimum education B It is not defined in Indian Constitution C Members and Vice-Chairman of it do not have fixed working duration D All of the these Answer: Option [D]",
        "40 The author of the chapter on “Objectives of Planned Development” for the Third Five Year Plan was: A Jawaharlal Nehru B Morarji Desai C C.D.Deshmukh D Lal Bahadur Shastri Answer: Option [B]",
        "41 For internal financing of Five Year Plans, the government depends on: A Taxation only B Public borrowing and deficit financing C Taxation and public borrowing D Taxation, public borrowing and deficit financing Answer: Option [A]",
        "42 The Five Year Plans of India intend to develop the country industrially through: A The private sector B The public sector C Increasing collaboration with non-resident Indians D The public, private, joint and Cooperative sectors Answer: Option [D]",
        "43 In which sector, the Public Sector is most dominant in India ? A Transport B Commercial banking C Steel production D Organized term-lending financial institutions Answer: Option [B]",
        "44 India had a plan holiday: A After the China-India War of 1962 B After the India-Pakistan War in 1965 C After the drought of 1966 D After the liberation of Bangladesh in 1971 Answer: Option [C]",
        "45 In India, the concepts of “minimum needs” and “direction anti-poverty programmes ” were the innovations of: A Fourth Five-year Plan B Fifth Five-Year Plan C Sixth Five-Year Plan D Eighth Five-Year Plan Answer: Option [B]",
        "46 The leading steel plants at Durgapur, Bhilai and Rourkela of India were established during the period of: A First Five Year Plan B Second Five Year Plan C Third Five Year Plan D Fourth Five Year Plan Answer: Option [B]",
        "47 Which one of the following is a driving force influencing the industrial growth of an economy ? A Economic Factors only B Investment only C Innovation/Market Base only D All of the above Answer: Option [D]",
        "48 The Nehru-Mahalanobis strategy of development guided the planning practice in India from the A First Five-Year Plan to the Sixth Five-Year Plan B First Five-Year Plan to the Eighth Five-Year Plan C Second Five-Year Plan to the Seventh Five-Year Plan D Fourth Five-Year Plan to the Eighth Five-Year Plan Answer: Option [C]",
        "49 What is the correct sequence of the following strategies used for Five Year Plans in India ? I. Balanced growth II. Rehabilitation of the economy III. Industrial development A I, III, II B II, I, III C II, III, I D III, II, I Answer: Option [C]",
        "50 Which one of the following is/ are a/ an indicator of the financial health of a country ? I. GDP II. PPP III. FDI in a year A Only I B Only II C Only III D All I, II & III Answer: Option [D]",
        "51 Multiplier process in economic theory is conventionally taken to mean: A The manner in which prices increase B The manner in which banks create credit C The manner in which government expenditure increases D Income of an economy grows on account of an initial investment Answer: Option [D]",
        "52 Which of the following concepts are most closely associated with J.M. Keynes? A Marginal utility theory B Control of money supply C Marginal efficiency of capital D Indifference curve analysis Answer: Option [C]",
        "53 Evaluating all the options to find out most suitable solution to business problems is inter-displinary activities. It is called A Commercial research B Operational research C Management research D Professional research Answer: Option [B]",
        "54 In a Laissez-faire economy A The Government controls the allocation of all the factors of production B The customers take all the decisions regarding production of all the commodities C The Government does not interfere in the free functioning of demand and supply forces in the market D The private sector takes all the decisions for price determination of various commodities produced Answer: Option [C]",
        "55 In Economics, production means A Farming B Creating Utility C Making D Manufacturing Answer: Option [B]",
        "56 With which form of economy is the term ‘Laissez-faire’ associated? A Command economy B Mixed economy C Socialist economy D Capitalist economy Answer: Option [D]",
        "57 Who among the following is not a classical economist? A John Maynard Keynes B Thomas Malthus C John Stuart Mill D David Ricardo Answer: Option [A]",
        "58 In Economics the ‘Utility’ and ‘Usefulness’ have A Same meaning B Different meaning C Opposite meaning D None of the above Answer: Option [B]",
        "59 “Economics is what it ought to be” – This statement refers to A Fiscal economics B Monetary economics C Positive economics D Normative economics Answer: Option [D]",
        "60 The problem of Economics arises from A Plenty B Scarcity of goods C More wants and less goods D All of the above Answer: Option [C]",
        "61 In public budgets, zero-base budgeting was first introduced in A UK B USA C France D Sweden Answer: Option [B]",
        "62 Malthusian theory of population explored the relationship between A Optimum growth and resources B Population growth and development C Food supply and technology D Food supply and population growth Answer: Option [D]",
        "63 In an economy, the sectors are classified into public and private on the basis of A Use of raw materials B Ownership of enterprises C Employment conditions D Nature of economic activities Answer: Option [B]",
        "64 Human Development Index was developed by: A Friedman B Amartya Sen C Montek Singh D Mahbub-ul-Haq Answer: Option [D]",
        "65 Wage fund theory was propounded by A J.B. Say B J.S. Mill C J.R. Hicks D J.M. Keynes Answer: Option [B]",
        "66 Which one of the following is not a dimension of human development index? A Social status B Knowledge C Life expectancy D Standard of living Answer: Option [A]",
        "67 The New Economic Policy was introduced by: A Lenin B Stalin C Kerensky D Khrushchev Answer: Option [A]",
        "68 The system of “Memorandum of Understanding” (MOU) was introduced in A 1988-89 B 1987-88 C 1990-91 D 1989-90 Answer: Option [B]",
        "69 An economic theory is a/an A Axion B Hypothesis C Proposition D Tested hypothesis Answer: Option [C]",
        "70 Externality theory is the basic theory of the following branch of Economics: A Environomics B Fiscal Economics C Macro Economics D International Economics Answer: Option [A]",
        "71 “Functional Finance” is associated with: A Adams B Adam Smith C Adolph Wogner D Abba ‘P’ Lerner Answer: Option [D]",
        "72 As per the TRIPS Agreement 1994, a good originating from a region with specific character/quality/reputation is covered/to be protected under the IPR as A Patent B Trademark C Trade sector D GI (Geographical Indicator) Answer: Option [D]",
        "73 The economist who believed that unemployment is impossible and that market mechanism has a built in regulatory system to meet any ups and downs A Ohlin B J.B. Say C Galbraith D J.M. Keynes Answer: Option [B]",
        "74 An economy which does not have any relation with the rest of the world is known as A Mixed economy B Open economy C Closed economy D Socialist economy Answer: Option [C]",
        "75 A philosophy that the worker should share in industrial decisions is termed as A Worker dictatorship B Industrial socialism C Worker sovereignty D Industrial democracy Answer: Option [D]",
        "76 According to Modern Theory of Rent, rent accrues to A Any factor B Capital only C Land only D Labour only Answer: Option [A]",
        "77 The book which is at the centerpiece of the study of Macro-Economics was written by A Prof. Benham B Prof. Baumol C Prof. Samuelson D Prof. J.M. Keynes Answer: Option [D]",
        "78 The basic problem studied in Macro-Economics is A Usage of income B Flow of income C Production of income D Distribution of income Answer: Option [C]",
        "79 ‘Take-off stage’ in an economy means A Steady growth begins B Economy is stagnant C Economy is about to collapse D All controls are removed Answer: Option [A]",
        "80 The relationship between the rate of interest and level of consumption was first visualized by A Amartya K. Sen B Irving Fisher C Milton Friedman D James Duesenberry Answer: Option [B]"
    ]
}