{
    "Topic": "Indian History",
    "Subject": "Sources of Indian History",
    "data": [
        "1 Which of the following sites is famous for stupas, monasteries, temples and pillars ? A Gooty B Hatta C Sanchi D Amarjpura Answer: Option [C]",
        "2 The Archaeological Survey of India(ASI) in it's current form established in : A 1790 B 1861 C 1901 D 1944 Answer: Option [B]",
        "3 Which of the following site is associated with Ashoka Pillar ? A Sanchi B Khajuraho C Mandu D Chatri Answer: Option [A]",
        "4 The eulogies or “prashasti” among the following inscriptions : I. Aihole Inscription of Pulakesin II. II. Allahabad Pillar Inscription of Samudra Gupta. III. Junagarh Inscription of Rudradaman. IV. Hathigumpha Inscription of Kharavela. A I, II and III are correct. B I and II are only correct. C II and III are only correct. D I, III and IV are correct. Answer: Option [B]",
        "5 The Bodhisattva Doctrine is associated with A Mahayana Buddhism B Hinayana Buddhism C Vajrayana Buddhism D Theravada Buddhism Answer: Option [A] Mahayana Buddhism",
        "6 Ashoka carved out rock-cut caves at Barabar and Nagarjun hills in Bihar for one of the following : A Hinayana B Digambara C Mahayana D Ajivika Answer: Option [D]",
        "7 In which of the following Asokan inscriptions the Brahmi script was not used ? A Saranath B Shahbazgarhi C Dhauli D None of the above Answer: Option [B]",
        "8 In which Buddhist scripture religious practices in the contemporary period of Buddha has been mentioned ? A Ambattha Sutta B Mahavamsa C Bhaddasala Jataka D Brahmajala Sutta Answer: Option [D]",
        "9 Which one of the following sites is not associated with Painted Grey Ware ? A Gilaulikhera B Noh C Tripuri D Satwali Answer: Option [D]",
        "10 Point out which one of the following sites has yielded the remains of a Jaina stupa ? A Sanchi B Dhamnar C Nalanda D Mathura Answer: Option [D]",
        "11 The Allahabad Pillar inscription is associated with which one of the following ? A Samudragupta B Ashoka C Mahapadma Nanda D Chandragupta Maurya Answer: Option [A]",
        "12 Who among the following presided over the Buddhist Council held during the reign of Kanishka at Kashmir ? A Sudraka B Vasumitra C Parsva D Nagarjuna Answer: Option [B]",
        "13 The silver coins issued by the Guptas were called: A Pana B Dinara C Karshapana D Rupaka Answer: Option [D]",
        "14 Which one of the following scripts of ancient India was written from right to left ? A Sharada B Kharosthi C Nandnagari D Brahmi Answer: Option [B]",
        "15 Who among the following is known for his work on medicine during the Gupta period ? A Susrutha B Shaunaka C Sudraka D Saumilla Answer: Option [A]",
        "16 The Badami rock inscription of Pulakesin I is dated in the Saka year 465. If the same were to be dated in Vikrama samvat, the year would be: A 300 B 450 C 500 D 601 Answer: Option [D]",
        "17 The term ‘Aryan’ denotes: A A speech group B An ethnic group C A nomadic people D A superior race Answer: Option [D]",
        "18 Hoysala monuments are found in: A Sringeri and Dharwar B Mysore and Bangalore C Halebid and Belur D Hampi and Hosper Answer: Option [C]",
        "19 Who among the following was not a contemporary of the other there ? A Milinda B Prasenjit C Bimbsara D Gautama Buddha Answer: Option [A]",
        "20 The religion of early Vedic Aryans was primarily of A Image worship and Yajnas B Bhakti C Worship of nature and Bhakti D Worship of nature and Yajnas Answer: Option [D]",
        "21 The ancient Indian play Mudrarakshasa of Visakhadutt has its subject on: A The court intrigues at the time of Chandragupta B The story of the power struggle between two Aryan. C A romantic story of an Aryan prince and a tribal woman D A conflict between Gods and Demons of ancient Hindu lore Answer: Option [A]",
        "22 Which of the following texts of ancient India allows divorce to a wife deserted by her husband ? A Manava Dharma Shastra B Sukra Nitisara C Arthashastra D Kamasutra Answer: Option [C]",
        "23 Between which of the following was the ancient town of Takshasila located ? A Jhelum and Chenab B Chenab and Ravi C Ravi and Beas D Indus and Jhelum Answer: Option [D]",
        "24 The river most mentioned in early Vedic literature is: A Ganga B Sindhu C Saraswati D Sutudri Answer: Option [B]",
        "25 The word ‘Hindu’ as reference to the people of Hind (India) was first used by A The Greeks B The Arabs C The Romans D The Chinese Answer: Option [A]",
        "26 The concept of Anuvrata was advocated by: A Jainism B The Lokayata school C Mahayana Buddhism D Hinayana Buddhism Answer: Option [A]",
        "27 Which one of the following sculptures were invariably used green schist as the medium ? A Gandhara sculpture B Bharhut sculptures C Mathura sculptures D Maurya sculptures Answer: Option [B]",
        "28 Which one of the following edicts mentions the personal name of Ashoka ? A Maski B Kalsi C Rummindei D Special Kalinga Edict Answer: Option [A]",
        "29 Which one of the following ancient Indian records is the earliest royal order to preserve food-grains to be utilized during the crises in the country ? A Prayaga-prasasti B Rummindei Pillar-edict of Ashoka C Sohgaura copper-plate D Mehrauli Pillar inscription of Chandra Answer: Option [C]",
        "30 The practice of military governorship was first introduced in India by the: A Mughals B Parthians C Shakas D Greeks Answer: Option [D]",
        "31 Which one of the Chola kings conquered Ceylon ? A Vijayalaya B Rajendra C Aditya – I D Rajaraja – I Answer: Option [B]",
        "32 The Jain philosophy holds that the world is created and maintained by A Universal Faith B Universal Soul C Universal Law D Universal Truth Answer: Option [D]",
        "33 In Sanskrit plays written during the Gupta period women and Sudras speak: A Prakrit B Sauraseni C Sanskrit D Pali Answer: Option [A]",
        "34 With reference to the invaders in ancient India, which one of the following is the correct chronological order ? A Sakas-Kushanas-Greeks B Sakas-Greeks-Kushanas C Greeks-Kushanas-Sakas D Greeks-Sakas-Kushanas Answer: Option [D]",
        "35 The famous dialogue between Nachiketa and Yama is mentioned in the: A Kathopanishad B Kenopanishad C Chhandogyopanished D Mundakopanishad Answer: Option [A]",
        "36 The term ‘Yavanapriya’ mentioned in ancient Sanskrit texts denoted: A pepper B ivory C damsels sent to the Greek court for dance performance D a fine variety of Indian Muslim Answer: Option [A]",
        "37 Which one of the following is not a part of early Jains literature ? A Brihatkalpasutra B Sutrakritanga C Therigatha D Acarangasutra Answer: Option [C]",
        "38 The term “Apabhramsa” was used in medieval Sanskrit texts to denote: A Non-Sanskrit verse metres B Outcastes among the Rajputs C Deviations from Vedic rituals D Early forms of some of the modern Indian language Answer: Option [D]",
        "39 Which one of the following was a corporation of merchants in ancient India ? A Manigrama B Ashtadikgaja C Parishad D Chaturvedimangalam Answer: Option [A]",
        "40 Which one of the following was initially the most powerful city state of India in the 6th century B.C. ? A Kasha B Magadh C Kamboj D Gandhar Answer: Option [B]",
        "41 The name by which Ashoka is generally referred to his inscriptions is: A Dharmakirti B Priyadarsi C Dharmadeva D Chakravarti Answer: Option [B]",
        "42 In the context of ancient Indian society which one of the following terms does not belong to the category of the other three ? A Kosa B Gotra C Kula D Vamsa Answer: Option [A]",
        "43 Which one of the following statements regarding Ashoka stone pillars is incorrect ? A These are monolithic B These are highly polished C These are parts of architectural structures D The shaft of pillars is tapering in shape Answer: Option [C]",
        "44 In the Mahayana Buddhism, the Bodhisatya Avalokitesvara was also known as: A Padmapani B Vajrapani C Manjusri D Maitreya Answer: Option [A]",
        "45 Many of the Greeks, Kushanas and Shakas embraced Buddhism rather than Hinduism because: A Buddhism was in the ascendant at that time B Buddhism provided easier access to Indian society C They had renounced the policy of war and violence D Caste-ridden Hinduism did not attract them Answer: Option [D]",
        "46 Which of the following ports handled the North Indian trade during the Gupta period ? A Chambray B Kalyan C Broach D Tamralipti Answer: Option [D]",
        "47 Which one of the following pairs is correctly matched ? A The Kushans – Gandhra School of Art B The Mughals – Ajanta Paintings C The Marathas – Pahari School of Painting D The Harappan civilization – Painted Greyware Answer: Option [A]",
        "48 Which one of the following animals was not represented seals and terracotta art of the Harappan culture ? A Elephant B Tiger C Cow D Rhinoceros Answer: Option [C]",
        "49 Which one of the following four Vedas contains an account of magical charms and spells ? A Yajurveda B Rigveda C Samaveda D Atharvaveda Answer: Option [D]",
        "50 Anekantavada is a core theory and philosophy of which one of the following ? A Sikhism B Jainism C Vaishnavism D Buddhism Answer: Option [B]",
        "51 In which one of the following cities is the Lingaraja Temple located ? A Kolkata B Bijapur C Bhubaneswar D Shravananbelagola Answer: Option [C]",
        "52 The concept of Eight fold path forms the theme of: A Divyavadana B Dipavamsa C Mahaparinibban D Dharma Chakara Pravartana Sutta Answer: Option [B]",
        "53 Milindapanho is in the form of a dialogue between the king Menander and Buddhist monk: A Kumarilabhatta B Nagabhatta C Nagarjuna D Nagasena Answer: Option [D]",
        "54 According to ancient Indian cosmogonic ideas the sequential order of the cycle of four acons (yugas) is: A Krita, Treta, Dvapara and Kali B Dvapara, Krita, Treta and Kali C Treta, Dvapara, Kali and Krita D Krita, Dvapara, Treta and Kali Answer: Option [A]",
        "55 Who among the following was a Brahmavadini who composed some hymns of the Vedas ? A Gargi B Savitri C Lopamudra D Leelavati Answer: Option [C]",
        "56 The Ashoka major rock edicts which tell us about the Sangam Kingdom include rock edicts: A I and X B I and XI C II and XIII D II and XIV Answer: Option [C]",
        "57 Which one of the following dynasties was ruling over North India at the time of Alexander’s invasion ? A Kanva B Sunga C Maurya D Nanda Answer: Option [D]",
        "58 Emperor Harsha’s southward march was stopped on the Narmada river by: A Vikramaditya-I B Vikramaditya-II C Pulakesin-I D Pulakesin-II Answer: Option [D]",
        "59 Who among the following laid the foundation of Rashtrakuta Empire ? A Dhruva B Dantidurga C Krishna I D Amostghavarsha I Answer: Option [B]",
        "60 Which of the following were common to both Buddhism and Jainism ? I. Avoidance of extremities of penance and enjoyment II. Indifference to the authority of the Vedas III. Denial of efficacy of rituals IV. Non-injury to animal life Select the answer using the codes given below: A 1, 2, 3 and 4 B 2, 3, and 4 C 1, 3, and 4 D 3 and 4 Answer: Option [B]"
    ]
}