{
    "Topic": "Indian History",
    "Subject": "Indus Valley Civilization",
    "data": [
        "1 Which of the following are the main sources of knowledge about Indus Valley Civilization ? A Inscriptions B Coins C Palm and barch leaf manuscripts D Archaeological excavations. Answer: Option [D]",
        "2 The Indus Valley Civilization was discovered in A 1902 B 1921 C 1922 D 1930 Answer: Option [B]",
        "3 The main characteristic of the Indus Valley Civllization was A town planning B drainage system C pucca houses D well laid out roads Answer: Option [B]",
        "4 The Indus Valley Civilization is known as Pre-Aryan Civilization because of the evidence of A art B copper C pottery D script Answer: Option [B]",
        "5 The main occupation of the people of the Indus Valley Civilization was A agriculture B hunting C trade D none of these above Answer: Option [A]",
        "6 The Indus Valley people knew the use of : A gold, silver, copper, bronze but not iron B copper, iron, gold but not bronze C silver, lead, iron but not gold D gold, tin, bronze but not copper Answer: Option [A]",
        "7 The people of Neolithic age only know about which of the following metal ? A Iron B Silver C Bronze D Copper Answer: Option [D]",
        "8 Which of the following games was known to the people of the Indus Valley ? A Chariot racing B Game of dice C Polo D Horse riding Answer: Option [B]",
        "9 The Indus Valley people had trade relations with A Egypt B Greece C Ceylon D Mesopotamia Answer: Option [D]",
        "10 Which one among the following Indus cities was known for water management ? A Lothal B Mohenjo-daro C Harappa D Dholavira Answer: Option [D]",
        "11 The famous bull-seal of Indus valley found in which one of the following sites : A Lothal B Harappa C Larkana D Chanhudaro Answer: Option [B]",
        "12 The beast source of information for depicting India’s ancient history is provided by A Religious literature B Monuments C Inscriptions D Paintings Answer: Option [C]",
        "13 Seal in Indus Valley Civilization is primarily used as : A A medium of exchange in trade B To signify royalty C To signify ownership of property D None of these Answer: Option [C]",
        "14 The distinguish feature of the Harappan civilizations is A Town planning and drainage B Uniform weights and measures C Religion and social structure D Rich literature Answer: Option [A]",
        "15 During the Indus valley civilization period the dominant number used for weights and measures was : A 8 B 6 C 10 D 16 Answer: Option [D]",
        "16 The tools and weapons of Harappan civilisation were mostly made of : A Stone and Copper B Copper, bronze and iron C Copper, tin and bronze D Stone only Answer: Option [C]",
        "17 The domestic animals of the people of Harappan Civilization were A Camel, oxen, buffalo, pig B Goat, oxen, pig, buffalo C Buffalo, sheep, dog, pig D Oxen, elephant, horse, pig Answer: Option [C]",
        "18 Which of the Following Harappan Sites not present in India : A Lothal and Ropar B Banwali and Ropar C Mohenjodaro and Harappa D Lothal and Kalibangan Answer: Option [C]",
        "19 The seals found at Mohenjodaro is similar to the seals found at : A Afghanistan B Egypt C China D Sumeria Answer: Option [D]",
        "20 The Indus Valley Houses Were Built of : A Wood B Stone C Bamboo D Bricks Answer: Option [D]",
        "21 Which one of the following age is related to Indus Valley Civilization ? A Chalcolithic age B Neolithic Age C Mesolithic Age D Palaeolithic Age Answer: Option [B]",
        "22 The Great Bath of the of the Indus Valley Civilization was discovered in A Mohenjodaro B Harappa C Lothal D Ropar Answer: Option [A]",
        "23 Mohenjodaro is also called as : A mound of the Great B mount of the Survivors C mount of the Living D mount of the Dead Answer: Option [D]",
        "24 Identify the site where the Great Granary of the Indus Valley civilization was found : A Lothal B Harappa C Mohenjodaro D Kalibangan Answer: Option [C]",
        "25 The famous figure of a dancing girl found in the excavations of Mohenjodaro was made up of : A red limestone B bricks C bronze D terracotta Answer: Option [C]",
        "26 The stone Age people had the first domestic : A sheep B dogs C cow D horses Answer: Option [A]",
        "27 The earliest evidence of silver in India is found in the: A Vedic Texts B Silver punch-marked coins C Chalcolithic cultures of Western India D Harappan Culture Answer: Option [D]",
        "28 Nomad man started settling in: A Mesolithic Age B Neolithic Age C Palaeolithic Age D None of the above Answer: Option [B]",
        "29 Indus Valley Civilization is also known as Harappan culture: A Harappa was the first site to be excavated in the Indus Valley B The site of Harappa is six times larger than Mohenjodaro site C The Indus Valley Civilization is considered the elementary / initial stage of Vedic culture and Harappa is believed to be the same as Harappa mentioned the Vedas D The most important evidence of the achievements of this civilization have been excavated from Harappa Answer: Option [D]",
        "30 The Indus Valley Civilization flourished during A 1500 - 500 B.C. B 2500 - 1750 B.C. C 3000 - 1500 B.C. D 5000 - 3500 B.C. Answer: Option [B]",
        "31 The Harappans extensively used burnt bricks because : I. Stone was not available. II. They provide defense against floods. III. They provide security and longevity. IV. Its import was easy. A I and II only B II and III only C I, II, and III only D all of the above Answer: Option [B]",
        "32 From the scattered skeletal remains of the Harappan found at different sites, the most appropriate conclusion to be drawn would be that there was : A great epidemic B mass execution C casual burial of human bodies D None of the above Answer: Option [A]",
        "33 On the basis of available evidence, the Indus civilization contributed two important things to mankind which were : A script and language B mathematics and decimal system C wheat and cotton D rearing animal Answer: Option [C]",
        "34 The main channels of our knowledge about the Indus Valley Civilization are: A coins B inscripitions C archaeological excavations D palm and birch leaf manuscripts Answer: Option [C]",
        "35 Which one of the following archaeologists initially discovered the Mohenjodaro site of the Indus Valley Civilization A Daya Ram Sahni B Sir john Marshall C Sir Martimer Wheeler D Rakhal Das Banerji Answer: Option [D]",
        "36 Consider the following person: I. John Marshall II. S.R. Rao III. R.D. Benerjee IV. Dayaram Sahni Who among these were associated with the first excavations carried out Harappa and Mohenjodaro ? A I, II and III B II, III and IV C I, III, and IV D all of the above Answer: Option [C]",
        "37 Which of the following is incorrect concerning Mohenjodaro ? A Buildings were of varying sizes B It was a well planned city C There was no drainage system D Bathrooms were important features of most houses Answer: Option [C]",
        "38 The Harappan site showing evidence of two cultural phases, Harappan and pre-Harappan, is : A Chanhu-daro B kalibangan C Banwall D Mohenjodaro Answer: Option [B]",
        "39 Knowledge about the existence of which of the following animals is doubtful in the Indus Valley Civilization ? A Cat B Dog C Horse D Bull Answer: Option [A]",
        "40 Which of the following Harappan sites had a dock ? A Mohenjodaro B Harappa C Alamgirpur D Lothal Answer: Option [D]",
        "41 Which of the following can definitely be said to be beliefs and practices of the Indus people ? I. Worship of nature II. Phallic and Yonic worship III. Belief in ghosts and spirits IV. Belief in life after death A I, II, and IV only B I, III, and IV only C II, III, and IV only D All of the above Answer: Option [D]",
        "42 The site of Harappa is located on the bank of river A Ravi B Saraswati C Indus D Ghaggar Answer: Option [A]",
        "43 With reference to Indus Valley Civilization, consider the following animals: I. Bull II. Elephant III. Rhinoceros The figure/figures of which of the above animal(s) is/are found on the Indus seals ? A I only B I and II C II and III D I, II, and III Answer: Option [D]",
        "44 Consider the following statements: I. Lime mortar was never used at Mohenjodaro in the construction of dwellings. II. At Dholavira, stone was never used in the construction of dwellings. Which of the statement(s) given above is/are correct ? A I only B II only C Both I and II D Neither I nor II Answer: Option [D]",
        "45 The God with three heads and horns, surrounded by animals, represented on a seal from Mohenjodaro is said to be : A Vishnu B Varuna C Pashupati D Indra Answer: Option [C]",
        "46 The dockyard at Lothal is connected through a channel to which one of the following rivers ? A Bhogavo B Chitra C Chakra D Bharavi Answer: Option [A]",
        "47 The Harappan civilization covered an extensive area of present South Asia. The geographic space covered by this civilization included A Punjab, Sindh and a part of Northeastern frontier B Punjab, Sindh and a part of Northwestern frontier and Kashmir C Kashmir, Punjab, Sindh and Northeastern frontier D Punjab, Sindh, a part of Northwestern frontier, Kathiawar and part of Ganga-Yamuna Doab Answer: Option [D]",
        "48 Which one among the following is not the characteristic feature of the Harappan settlement ? A The citadel was walled but the lower town was not walled B Houses generally had separate bathing areas and toilets C Drains and water chutes from the second storey were often built inside the wall D Doorways and windows generally faced the side lines and rarely opened onto the main streets Answer: Option [C]",
        "49 Match the following Harappan Settlement River I Mohenjodaro 1. Indus II Rupar 2. Ghaggar III Kalibangan 3. Sutlej IV Harappa 4. Ravi I II III IV A 1 3 2 4 B 2 4 1 3 C 1 4 2 3 D 2 3 4 1 Answer: Option [A]",
        "50 Consider the following statements: I. The inhabitants of Harappa grew and used cotton. II. The standard Harappa seals were made of clay. III. The inhabitants of Harappa had no knowledge of copper and bronze. Which of the statements given above is/are correct A I only B I and II only C II and III only D None of the above Answer: Option [A]",
        "51 Which one of the following statements is not correct about the Harappan civilization ? A In Lathal, the inhabitants never used burnt bricks for construction. B In Kalibangan, most of the constructions was done by using mud bricks. C The inhabitants knew the game of dice. D The inhabitants knew the use of geometrical designs. Answer: Option [A]",
        "52 Which one of the following statements is not correct ? A Palaeolithic graves have been found in Guntur and Kurnool districts in South India. B Pre-historic paintings have been found in Kaimur range and Mizapur districts. C The Palaeolithic man in India knew the use of fire. D The Cooper age and the early Iron Age can be distinguished in North India. However, the Iron Age immediately succeeded the Stone Age in South India. Answer: Option [C]",
        "53 Which one of the following statements about Mohenjodaro is correct ? A Gold ornaments were unknown to the inhabitants. B The floor of the Great Bath was made of burnt brick. C Axes, chisels, knives and fish-hook were all made of iron. D The houses were made of cut and polished stone. Answer: Option [B]",
        "54 Indus Valley Civilization was spread over: A Along Indus river B Punjab, Sind, Baluchistan, Afghanistan C Sind, Punjab, Jammu and Kashmir, U.P., Rajasthan, Gujarat D Punjab, Sind, Bihar, Rajasthan, Gujarat Answer: Option [A]",
        "55 Which of the following statements are correct with regard to the Indus Valley Civilization ? I. The people of this civilization were the earliest to make use of cotton. II. It had trade links by sea with other regions. III. Existence of street lighting has been revealed in the excavations. III. All the sites excavated show the existence of huge public baths A I and II B I, II and III C I and IV D All of the above Answer: Option [B]",
        "56 Use the plough has been evidenced at: A Banwali B Harappa C Lothal D Kalibangan Answer: Option [D]",
        "57 Which of the following presents the most significant feature of Indus Valley Civilization ? A First true arches B Burnt brick buildings C Art and architecture D Buildings of worship Answer: Option [A]",
        "58 At which Harappan site have traces of a horse been found ? A Sutkagendor B Kalibangan C Surkotada D Lothal Answer: Option [C]",
        "59 The source of the blue gem stone, lapis lazuli, for the people of Harappan culture, was: A Western U.P. B Afghanistan C Gujarat D Maharashtra Answer: Option [B]",
        "60 Reading the Indus Valley Civilization, consider the following statements: I. During this period, cotton was used for manufacturing textiles in India. II. It was predominantly a secular civilization and the religious element, though present, did not dominate the scene. Which of the statements given above is/are correct? A I only B II only C Both I and II D Neither I and II Answer: Option [C]",
        "61 Traces of which of the following has not been found in the Indus Civilization ? A Sugarcane B Barley C Mustard D Sesamum Answer: Option [A]",
        "62 The greatest invention of man in Paleolithic Age was: A Spinning of cloth B Fire C Metal implements D Potter’s wheel Answer: Option [B]",
        "63 With which of the following periods do we associate the ‘Microlith’ implements ? A Neolithic B Palaeolithic C Chalcolithic D Mesolithic Answer: Option [D]",
        "64 The following sentences describe one of the sites of the Harappan civilization: The settlement is divided into two sections, one smaller but higher and the other much larger but lower. Archaeologists designate these as the citadel and the lower town respectively. Both were walled. Several buildings were built on platforms, which served as foundations. Which of the following sites does it refer to ? A Kalibangan B Mohenjodaro C Harappa D Lothal Answer: Option [C]",
        "65 With which period do we associate the “Megaliths” ? A Neolithic B Palaeolithic C Chalcolithic D Mesolithic Answer: Option [A]",
        "66 When the first metal tool came into being it was used for ? A Making wheels B Clearing jungles C House-building D Pot-making Answer: Option [B]",
        "67 Match the following Harappan Settlement Bank of rivers on which located I Alamgipur 1. Indus II Kalibangan 2. Ghaggar III Harappa 3. Hindon IV Mohenjodaro 4. Ravi I II III IV A 3 2 4 1 B 3 1 4 2 C 4 1 2 3 D 2 3 4 1 Answer: Option [A]",
        "68 Match the following Ancient site Archeological finding I Lothal 1. Ploughed field II Kalibangan 2. Dockyard III Dholavira 3. Terracotta replica of a plough IV Banawali 4. An inscription comprising ten large sized signs of the Harappan script I II III IV A 1 3 2 4 B 2 4 1 3 C 1 4 2 3 D 2 1 3 4 Answer: Option [D]",
        "69 Match the following Harappan site State I Kalibangan 1. Punjab II Mohenjodaro 2. Rajasthan III Rangpur 3. Gujarat IV Surkotda 4. Sind I II III IV A 1 3 2 4 B 2 4 1 3 C 1 4 2 3 D 2 3 4 1 Answer: Option [B]",
        "70 Match the following Important finds Sites I Dockyard 1. Mohenjodaro II Ploughed field 2. Lothal III Horse 3. kalibangan IV Great Bath 4. Sarkotada I II III IV A 1 3 2 4 B 2 4 3 1 C 1 4 2 3 D 2 3 4 1 Answer: Option [D]"
    ]
}