{
    "Topic": "Indian Polity",
    "Subject": "Judiciary",
    "data": [
        "1 The highest and final judicial tribunal of India is : A President B Parliament C Supreme Court D Union cabinet Answer: Option [C]",
        "2 Which of the following High Court has jurisdiction over more than one State/ Union Territories ? A Mumbai B Guwahati C Kolkata D Chandigarh Answer: Option [B]",
        "3 Who of the following decides the number judges in a High Court ? A The President B Chief Minister of the State C Prime Minister D Parliament Answer: Option [A]",
        "4 The Chief Justice and other Judges of the High Court are appointed by the : A President B Chief Justice of the Supreme Court C Governor of the concerned state D Attorney General of India. Answer: Option [A]",
        "5 The oath to a High Court Judge is administered by the : A Chief Justice of India B Chief Justice of High Court C President D Governor of the concerned state Answer: Option [D]",
        "6 The Supreme Court of India was set up under which of the following Act ? A Pitt’s India Act, 1784 B Charter Act of 1833 C Regulating Act, 1773 D Indian Councils Act, 1892 Answer: Option [C]",
        "7 In India, the power to increase the number of judges in the Supreme Court lies with : A The President of India B The Chief Justice of India C The Union Ministry of Law D The Parliament of India Answer: Option [D]",
        "8 Disputes between States of India comes to the Supreme Court under A Original jurisdiction B Appellate jurisdiction C Advisory jurisdiction D None of these Answer: Option [A]",
        "9 Which of the following statements is correct with respect to retired judge of a High Court ? A Cannot practice in the Supreme Court B Cannot practice in any High Court of India C Cannot practice in the High Court from where he has retired D None of the above Answer: Option [C]",
        "10 Who was the Chief Justice of India when public interest litigation (PIL) was introduced to the Indian Judicial System ? A M. Hidayataullah B A. M. Ahmadi C A. S. Anand D P. N. Bhagwati Answer: Option [D]",
        "11 The civil affairs like marriage, divorce, inheritance etc. which has been authorized by the Constitution to make legal laws? A States, by the State List of the Constitution B Centre, by the Union List of the Constitution C Centre and States, by the Concurrent List of the Constitution D Religious authorities which have relation to individual affairs Answer: Option [C]",
        "12 Which of the following writs/orders of the High Court/Supreme Court is sought to get an order of an authority quashed? A Certiorari B Mandamus C Habeas Corpus D Quo Warranto Answer: Option [A]",
        "13 Why did one of the High Courts in India decree that “bandhs are unconstitutional and punitive”? A It adversely affects production B It is not part of a right to protest C It is not in exercise of a fundamental freedom D It infringes on the fundamental rights of some groups of people Answer: Option [C]",
        "14 Which of the following is at the apex of the subordinate criminal courts? A Supreme Court B High Court C Court of District Judge D Court of Sessions Judge Answer: Option [D]",
        "15 Preventive detention means- A Detention for interrogation B Detention after interrogation C Detention without interrogation D Detention for cognizable offence Answer: Option [C]",
        "16 Who is empowered to transfer a Judge from one High Court to another High Court? A President of India B Law Minister of India C The Union Cabinet D Chief Justice of India Answer: Option [A]",
        "17 The main function of the judiciary is: A Law execution B Law formulation C Law application D Law adjudication Answer: Option [D]",
        "18 The salaries and emoluments of the judges of the Supreme Court are changed on: A The Finance Commission B The Consolidated Fund of India C The Contingency Fund of India D The Reserve Bank of India Answer: Option [B]",
        "19 Which of the following “writs” of the High Court or the Supreme Court is sought to produce in the court a person, suspected to be missing/ in custody? A Certiorari B Mandamus C Quo Warranto D Habeas Corpus Answer: Option [D]",
        "20 Where the High Courts in India first set up? A Delhi and Calcutta B Bombay, Madras, Calcutta C Bombay, Delhi and Calcutta D Madras and Bombay Answer: Option [B]",
        "21 What does the “Judicial Review” function of the Supreme Court mean? A Review its own judge-ment B Review the functioning of judiciary in the country C Undertake periodic review of the Constitution D Examine the constitutional validity of the laws Answer: Option [D]",
        "22 A writ of Mandamus can be issued by the Supreme Court to A An official to perform public duty B The company to raise wages C The Prime Minister to dissolve the Cabinet D The Government to pay the salaries to employees Answer: Option [A]",
        "23 An appeal to the High Court lies in case the Session Court has awarded the punishment of A One year or more B Two years or more C Three years or more D Four years or more Answer: Option [D]",
        "24 Under the Constitution, the power to issue a writ of Habeas Corpus is vested in A High Court alone B Supreme Court alone C Both Supreme Court and High Courts D All Courts down to the District Courts Answer: Option [C]",
        "25 A writ issued by the Supreme Court compelling a quasi-Judicial/public authority to perform its mandatory duty is A Mandamus B Certiorari C Prohibition D Quo Warranto Answer: Option [A]",
        "26 How many types of writs can be issued by the Supreme Court? A Three B Four C Five D Six Answer: Option [C]",
        "27 The Supreme Court of India enjoys A Advisory jurisdictions B Original jurisdictions C Appellate and advisory jurisdictions D Original, appellate and advisory jurisdictions Answer: Option [D]",
        "28 The Judges of the High Court hold office A During the pleasure of the Chief Justice of India B Till they have attained 62 years of age C Till they have attained 65 years of age D As long as they desire Answer: Option [B]",
        "29 Indian Penal Code came into operation in A 1858 B 1860 C 1859 D 1862 Answer: Option [D]",
        "30 In which case did the Supreme Court restore the primacy of the Fundamental Rights over the Directive Principles of State policy? A Golaknath Case B Minerva Mills Case C Keshavananda Bharti Case D All the above cases Answer: Option [B]",
        "31 Which of the following is not the essential qualification for appointment as a Judge of the Supreme Court of India? A Should be a citizen of India B Should be at least 35 years of age C Should be an eminent jurist D Should have practiced for at least 10 years as an advocate in one or more High Courts Answer: Option [B]",
        "32 Judicial review in the Indian Constitution is based on: A Rule of Law B Due process of Law C Precedents and Conventions D Procedure established by Law Answer: Option [D]",
        "33 The Judges of the Supreme Court retire at the age of: A 58 years B 60 years C 62 years D 65 years Answer: Option [D]",
        "34 The first Act permitting legal marriage with a person not belonging to one’s endogamous group is A Hindu Marriage Validity Act B Special Marriage Act C Abolition of Untouchability Act D Arya Samaj Marriage Validity Act Answer: Option [A]",
        "35 The State which have a common High Court are A Gujarat and Orissa B Maharashtra and Goa C Madhya Pradesh and Rajasthan D Karnataka and Andhra Pradesh Answer: Option [B]",
        "36 The Supreme Court is empowered to settle election disputes of President and Vice- President. This is its A Miscellaneous Jurisdiction B Advisory Jurisdiction C Appellate Jurisdiction D Original Jurisdiction Answer: Option [D]",
        "37 Which two States have a common High Court? A Haryana and Punjab B Kerala and Tamil Nadu C Gujarat and Maharashtra D Himachal Pradesh and Uttar Pradesh Answer: Option [A]",
        "38 A writ issued by the High Court or the Supreme Court to protect the fundamental rights of the citizens is known as A Certiorari B Mandamus C Habeas Corpus D Quo warranto Answer: Option [C]",
        "39 Of the following, who held the Offices of Judge of the Supreme Court and the Speaker of the Lok Sabha A Subba Rao B K.S. Hegde C P.N. Bhagwati D M. Hidayatullah Answer: Option [B]",
        "40 Implementing laws is the function of A Cabinet B Judiciary C Legislative D Executive Answer: Option [D]",
        "41 No person can be employed in factories or mines unless he is above the age of A 12 years B 14 years C 16 years D 18 years Answer: Option [B]",
        "42 The first woman judge to be appointed to Supreme Court was A M. Fathima Beevi B Leila Seth C Rani Jethmalani D Anna George Malhotra Answer: Option [A]",
        "43 Who was the first woman Chief Justice of a High Court of a state in India? A Anna Chandy B Leila Seth C Fathima Beevi D Sunanda Bhandare Answer: Option [B]",
        "44 The writ of ‘Habeas Corpus’ is issued in the event of A Loss of property B Refund of excess taxes C Wrongful police detention D Violation of the freedom of speech Answer: Option [C]",
        "45 Under which one of the following writs an official can be prevented from taking an action which he is officially not entitled? A Quo warranto B Habeas Corpus C Certiorari D Mandamus Answer: Option [D]",
        "46 Which one of the following writs is issued to courts, corporations, government servants or persons directing them to perform their public duty? A Prohibition B Mandamus C Quo warranto D Habeas Corpus Answer: Option [B]",
        "47 Which is the highest law of the land? A Criminal Procedure Code B Civil Procedure Code C Indian Constitution D Indian Penal Code Answer: Option [C]",
        "48 The Supreme Court of India acts as a Federal Court when it deals with A Civil cases B Inter-State disputes C Election petitions D Appeals from lower courts Answer: Option [B]",
        "49 Which one of the following writs literally means ‘what is your authority’? A Prohibition B Certiorari C Quo warranto D Habeas Corpus Answer: Option [C]",
        "50 A law made by the Judiciary is known as A Case law B Ordinary law C Rule of law D Administrative law Answer: Option [A]",
        "51 Which of the following writs can lie only against a person holding a public office? A Certiorari B Prohibition C Mandamus D Habeas Corpus Answer: Option [C]",
        "52 The Judges of High Court are administered oath of office by A Governor of the State B The Chief Justice of India C The President of India D The Chief Justice of High Court Answer: Option [A]",
        "53 The Pension of a High Court Judge is charged on the A Consolidated Fund of India B Public Accounts of the State C Consolidated Fund of the State D Public Accounts of India Answer: Option [A]",
        "54 The High Court which has the distinction of having the first woman Chief Justice is: A Delhi High Court B Allahabad High Court C Guwahati High Court D Himachal Pradesh High Court Answer: Option [D]",
        "55 Writs are issued by A The President B High Courts C Supreme Court D Supreme Court and High Courts Answer: Option [D]",
        "56 The Judges of the Supreme Court hold office till they reach the age of A 62 years B 65 years C 68 years D 70 years Answer: Option [B]",
        "57 Supreme Court is the guardian for A Fundamental Rights B Directive Principles C Centre and State disputes D Preamble Answer: Option [A]",
        "58 Which of the following is protected under Wildlife (Protection) Act, 1972? A Squirrel B Bandicoot rat C Gerbil D Porcupine Answer: Option [D]",
        "59 Judges of the district court are appointed by: A President B Law Minister C Governor D Chief Minister Answer: Option [C]",
        "60 District Judges is under the control of A Governor B High Court C Supreme Court D State Government Answer: Option [B]",
        "61 What is meant by social justice? A All should have same political rights B All should have same economic rights C All should be granted right to freedom of religion D All kinds of discrimination based on caste, creed, colour and sex should be eliminated Answer: Option [D]",
        "62 Which one of the following is issued by the court in case of an illegal detention of a person? A Habeas Corpus B Quo warranto C Certiorari D Mandamus Answer: Option [A]",
        "63 Under which Article of the Indian Constitution, the decision of the Central Administrative Tribunal can be challenged in the Supreme Court? A 323 A B 329 C 343 C D 343 K Answer: Option [A]",
        "64 Division of powers and Independent Judiciary are the two important features of A Federal form of Government B Democratic form of Government C Unitary form of Government D Socialist form of Government Answer: Option [B]",
        "65 Which one of the following statements about the Chief Justice of India (CJI) is not correct? A He appoints the Chief Justice of all High Court B The CJI administers the oath of office to the President C The CJI can hold his office till he attains the age of 65 years D When both the offices of the President and Vice- President fall vacant simultaneously, the CJI discharges the duties of the President Answer: Option [A]",
        "66 The Indian Judiciary is headed by: A The Parliament B The Supreme Court C The President D The Prime Minister Answer: Option [B]",
        "67 Who had played key role in the formation of Lokpal bill in India? A Medha Patekar B Baba Amte C Anna Hajare D Vipin Hazarika Answer: Option [C]",
        "68 Which of the following article of IPC is related to unnatural sex? A 370 B 374 C 376 D 377 Answer: Option [D]",
        "69 Who appoints the judges of the Indian Supreme Court? A President B Prime Minister C Chief Justice D Council of Minister Answer: Option [A]",
        "70 Which of the following High Courts had legalized gay sex in India during 2009? A Goa B Assam C Delhi D Chandigarh Answer: Option [C]",
        "71 Consumer protection Act 1986, was amended in: A 1991 B 1992 C 1993 D 1994 Answer: Option [A]",
        "72 Section of IPC, which deals with LGBT (Lesbian, Gay, Bisexual and Transgender) community is: A 376 B 370 C 377 D None of these Answer: Option [C]",
        "73 The concept of “Rule of Law” is a special feature of constitutional system of A Switzerland B France C U.S.A. D Britain Answer: Option [D]",
        "74 How liberty can be limited? A By Rule B By Law C By Authority D By Equality Answer: Option [B]",
        "75 Most important safeguard of liberty is A Declaration of rights B Decentralization of power C Well-knit party system D Bold and impartial judiciary Answer: Option [D]",
        "76 What is the ancient school of law? A The Sociological School B The Philosophical School C The Historical School D The Analytical School Answer: Option [B]",
        "77 Which among the following is not a preventive detention act? A Foreign Exchange Regulation Act (FERA) B Preventive of Terrorism Act (POTA) C Terrorist and Disruptive Activities (Prevention) Act (TADA) D Conservation of Foreign Exchange and Prevention of Smuggling Activities Act (COFEPOSA) Answer: Option [A]",
        "78 Wildlife Protection Act was implemented in India in A 1956 B 1972 C 1964 D 1986 Answer: Option [B]",
        "79 Which of the following is not dealt under Section 3 (3) of the Environment (Protection) Act, 1986? A The Biodiversity Authority B The Coastal Zone Management Authority C Protection of Plant Varieties and Farmers Right Authority D Authority set-up to monitor the State of Notified Ecologically Sensitive Areas Answer: Option [C]",
        "80 On which date did the Rajya Sabha pass “The Marriage Laws” (Amendment) Bill 2012? A 18th August, 2013 B 5th August, 2013 C 26th August, 2013 D 23rd August, 2013 Answer: Option [C]",
        "81 The power to decide an Election Petition for the State is vested in the A High Court B Supreme Court C Parliament D Election Commission Answer: Option [A]",
        "82 In which year was the Prevention of Terrorism Act (POTA) enacted? A 2000 B 2001 C 2002 D 2003 Answer: Option [C]"
    ]
}