{
    "Topic": "Awards/Honours/Prizes",
    "Subject": "Nobel Prize",
    "data": [
        "1 Who amidst the following won the Nobel Prize in Science in two different disciplines ? A David Lee B Madam Curie C Russel Hulse D Enrico Fermi Answer: Option [B]",
        "2 Who amongst the following was awarded Nobel Prize for developing the technology used in integrated circuits used in PCs ? A Robert F. Furchgott B Horst L. Stormer C Jack Kilby D Lev Landau Answer: Option [C]",
        "3 Who from the following is an awardee of both the Nobel Prize and Bharat Ratna ? A C V Raman B Rabindranath Tagore C Mother Teresa D Mahatma Gandhi Answer: Option [A, B and C]",
        "4 Who among the following Nobel laureates facilitated the development of MRI as an important diagnostic tool ? A Sydney Brenner B Paul C. Lauterbur C John E. Sulton D H. Robert Horvitz Answer: Option [B]",
        "5 Who was the first nobel prize winner from India ? A Sir C. V. Raman B Mother Teresa C S. Chandrashekar D Rabindranath Tagore Answer: Option [D]",
        "6 Amartya Sen was awarded the Nobel Prize for his contribution to : A Econometrics B Development Economics C Monetary Economics D Welfare Economics Answer: Option [D]",
        "7 Which of the following pairs won the Nobel Peace Prize in 2014? A Paul L. Modrich and Aziz Sancar B Kailash Satyarthi and Malala Yousafzai C Serge Haroche and David J. Wineland D Alvin E. Roth and Lloyd S. Shapley Answer: Option [B]",
        "8 In 2015 Nobel Peace Prize was awarded to: A Tunisian National Dialogue Quartet B Jean Tirole C Alice Munro D Takaaki Kajita and Arthur B. McDonald Answer: Option [A]",
        "9 The Nobel Prize for Economics was instituted by: A Alfred Nobel B Sweden's Central Bank C The Nobel Committee D World Bank Answer: Option [B]",
        "10 In which city Nobel Peace Prize is awarded? A Brussels B Geneva C Oslo D Stockhlm Answer: Option [C] The Nobel Prizes in Physics, Chemistry, Physiology or Medicine and Literature are awarded in Stockholm, Sweden, while the Nobel Peace Prize is awarded in Oslo, Norway.",
        "11 In which of the following fields Nobel Prize is not given? A Mathematics B Chemistry C Medicine D Physics Answer: Option [A]",
        "12 Biologist of Indian origin who received the Nobel Prize was A C.V. Raman B Raja Ramanna C Hargovind Khorana D Jagadish Chandra Bose Answer: Option [C]",
        "13 Nobel Prize winning India, Amartya Sen, is known for his work in which area? A Chemistry B Economics C Physics D Environmental Protection Answer: Option [B]",
        "14 Which India-born scientist was awarded the Nobel Prize in Astrophysics? A Sir. C.V. Raman B Satyendra Nath Bose C Vikram Sarabhai D Prof. Chandrashekhar Answer: Option [D]",
        "15 Nobel Prize in which field is not paid out of the endowment set up by Dr. Alfred Nobel? A Peace B Medicine C Economics D Chemistry Answer: Option [C]",
        "16 The Nobel Prize was instituted by the country A UK B USA C Russia D Sweden Answer: Option [D]",
        "17 The Indian representing an international organization who shared the Nobel Peace Prize with Al Gore of U.S. was A R.N. Tagore B Rajendra Pachauri C Mother Teresa D Viswanathan Subramanian Answer: Option [B]",
        "18 In which year did Amartya Kumar Sen receive the Nobel Prize in Economics? A 1998 B 1995 C 1990 D 2000 Answer: Option [A]",
        "19 Among the following Nobel laureates, who was not a recipient of the Nobel Prize for Peace? A Norman Eanest Borlaug B Linus C. Pauling C Woodrow Wilson D Sir Winston Churchill Answer: Option [D]",
        "20 Sir C.V. Raman was awarded Nobel Prize for his work on: A Sonometer B Cryogenics C Light Scattering D Radio activity Answer: Option [C]",
        "21 Nobel Prize are distributed annually at A Manila B Stockholm C Geneva D New York Answer: Option [B] The Nobel Prizes in Physics, Chemistry, Physiology or Medicine and Literature are awarded in Stockholm, Sweden, while the Nobel Peace Prize is awarded in Oslo, Norway.",
        "22 Who was first Nobel Prize winner in the field of Physics? A CV Raman B Lord Rayleigh C Wilhelm Röntgen D Thomas Alva Edison Answer: Option [C]",
        "23 Who won first Nobel Prize in the field of Chemistry? A Hermann Emil Fischer B Sir William Ramsay C Eduard Buchner D Jacobus H. van't Hoff Answer: Option [D]",
        "24 Who was first Nobel Prize winner for peace in India? A CV Raman B Mother Teressa C Kailash Satyarthi D Dr. Har Gobind Khorana Answer: Option [B]",
        "25 Maximum number of Literature awards goes to __________ language? A English B Portuguese C German D French Answer: Option [A]",
        "26 Mother Theresa Won Nobel Prize in year _______. A 1975 B 1977 C 1979 D 1981 Answer: Option [C]",
        "27 Rabindranath Tagore was awarded by Nobel Prize for Literature in Year? A 1913 B 1914 C 1915 D 1916 Answer: Option [A]",
        "28 Alfred Nobel has invented _________. A Atom Bomb B Dynamite C Nuclear Wapone D Satellite Launching Machine Answer: Option [B]",
        "29 When was the first Nobel Prize awarded? A In Year 1901 B In Year 1905 C In Year 1909 D In Year 1911 Answer: Option [A]",
        "30 Which of the following lady won Nobel Prize in two fields Physics as well as Chemistry? A Marie Curie B Herta Müller C Maria Goeppert Mayer D Elizabeth H. Blackburn Answer: Option [A]"
    ]
}