{"Topic": "Geography", "Subject": "Solar", "data": ["1 Identify the planet whose length of the days and tilt of its axis are almost identical to those of the earth. A Uranus B Neptune C Saturn D Mars Answer: Option [D]", "2 Among the following planets, which is the brightest planet ? A Mercury B Venus C Mars D Jupiter Answer: Option [B]", "3 Which of the following planets of the solar system has the longest day ? A Mercury B Jupiter C Venus D Earth Answer: Option [C]", "4 Which planet is called the red planet in our solar system ? A Mercury B Mars C Jupiter D Neptune Answer: Option [B]", "5 The largest planet in our solar system is : A Jupiter B Earth C Venus D Mercury Answer: Option [A]", "6 What is the fifth largest planet in our solar system ? A Venus B Saturn C Earth D Mars Answer: Option [C]", "7 Who discovered that the Earth revolves around the Sun ? A Galileo Galilei B Isaac Newton C Albert Einstein D Johannes Kepler Answer: Option [A]", "8 The exact time taken by the earth for single rotation on its own axis is : A 24 hrs B 24 hrs 30 ms C 23 hrs 54 minutes 7.8 sec D 23 hrs 56 minutes 4.09 sec Answer: Option [D]", "9 What do you mean by 'Black Hole' in our solar system ? A Contracted star with intense gravitational pull B Collapsing of low density C Holes occurring in heavenly bodies D None of these Answer: Option [A]", "10 In which year did Galileo state that the Earth revolves around the Sun ? A 1632 B 1634 C 1638 D 1641 Answer: Option [A]", "11 Which of the following is correct with respect to 'Great Bear' ? A Planet B Galaxy C Star D Constellation Answer: Option [D]", "12 What do you mean by Sunspots ? A visible irregular dark patches on the photosphere of the sun resulting from a localised fall in the temperature to about 4000K B desert areas on the sun C dark patches on the surface of the sun which are cooler areas D all of these Answer: Option [A]", "13 Who discovered the laws of planetary orbits ? A Galileo Galilei B Nicholas Copernicus C Johannes Kepler D None of them Answer: Option [C]", "14 If there is no sun the colour of the sky would be : A Blue B Orange C Black D Green Answer: Option [C]", "15 What is a Supernova ? A an asteriod B a black hole C a comet D a dying star Answer: Option [D]", "16 Which of the following is the best proof to say that comets are members of our solar system ? A their composition B their effect on the lives of man C the shape of their orbits D the shape and length of their tails Answer: Option [A]", "17 Foucault experiment is proof of which one of the following ? A Revolution of sun B Revolution of moon C Rotation of Earth D Revolution of Earth Answer: Option [C]", "18 While Venus is seen only for one to two hours either after sunset or before sunrise. Jupiter is seen for the whole night whenever it is visible in the sky. The reason for this is that : A Venus is much smaller than Jupiter B Venus is far from the Earth than Jupiter C Venus reflects lesser light of sun than Jupiter D he orbit of Venus is inside the earth's orbit whereas the orbit of Jupiter lies outside the orbit of the earth Answer: Option [D]", "19 Which of the following statements is/are correct with respect to Milky Way ? I. It is a spiral galaxy II. The solar system resides in one of its spiral arms. Select the correct answer from the following A I only B II only C Both I and II D Neither 1 nor II Answer: Option [C]", "20 What is the difference between asteroids and comets ? I. Asteroids are small rocky planetoids, while comets are formed of frozen gases held together by rocky and metallic material. II. Asteroids are found mostly between the orbits of Jupiter and Mars, while comets are found mostly between Venus and Mercury. III. Comets show a perceptible glowing tail, while asteroids do not. Which of the following statements given above is/are correct? A I and II only B I and III only C III only D I, II and III Answer: Option [B]", "21 Select the correct statement with respect to solar system ? A The Earth is the densest of all the planets in our solar system. B The predominant element in the composition of Earth is silicon. C The Sun contains 75 percent of the mass of the solar system. D The diameter of the Sun is 190 times that of the Earth. Answer: Option [A]", "22 Which of the following statements is/are correct ? I. In comparison to the Jupiter, planet Earth displays eclipses more frequently. II. On Mars, only partial solar eclipses are possible. Select the correct answer using the code given below : A 1 only B 2 only C Both 1 and 2 D Neither 1 nor 2 Answer: Option [D]", "23 Which of the following gases is most predominant in the Sun ? A Mithen B Nitrogen C Hydrogen D Ozone Answer: Option [C]", "24 Revolution around the Sun is maximum for : A Venus B Jupiter C Mars D Saturn Answer: Option [B]", "25 Consider the following statements : I. The albedo of an object determines its visual brightness when viewed with reflected light. II. The albedo of Mercury is much greater than the albedo of the Earth. Which of the following statements given above is/are correct? A I only B II only C both I and II D neither I nor II Answer: Option [A]", "26 The speed of rotation of the earth is the highest A along the Equator B at the North-Pole C along the Tropic of Cancer D along the Arctic Circle Answer: Option [A]", "27 Which of the following planets of the solar system has the longest day ? A Mercury B Jupiter C Venus D Earth Answer: Option [C]", "28 Comets revolve around : A Sun B Earth C Venus D No single heavenly body Answer: Option [A]", "29 The hottest planet is A Mercury B Venus C Jupiter D Saturn Answer: Option [B]", "30 In order of their distances from the Sun, which of the following planets lie between Mars and Uranus ? A Earth and Jupiter B Jupiter and Saturn C Saturn and Earth D Saturn and Neptune Answer: Option [B]"]}