{
    "Topic": "Indian Polity",
    "Subject": "Union and State Executive",
    "data": [
        "1 How the President of India is elected ? A By the way of people representation B By an electoral college consisting of the elected members of both the Houses of Parliament and by the representatives of Central and State Legislature C By an electoral college consisting of the elected members of both the Houses of Parliament D The Prime Minister of India appoints him Answer: Option [B]",
        "2 Who is the Supreme Commander of Indian Armed Forces ? A The Prime Minister of India B The President of India C The Defence Minister D Chief of Army Staff Answer: Option [B]",
        "3 In which of the following situations does the President of India act in his own discretion ? A In returning a proposal to the Council of Ministers for recommendation B In appointing the Prime Minister C Both [A] and [B] D None of these Answer: Option [A]",
        "4 In the election of the President, the value of the vote of the Lok Sabha Members : A differs according to the geographical size of the respective State B is same C differs according to the number of votes a member represents D none of these Answer: Option [C]",
        "5 The oath is administered to the President of India by : A Prime Minister of India B The Speaker of Lok Sabha C Chief Justice of Supreme Court D Chief Justice of High Court Answer: Option [C]",
        "6 What is the minimum age limit to contest in President election in India ? A 25 Years B 30 Years C 35 Years D 40 Years Answer: Option [C]",
        "7 Who acts as the President of India when neither the President nor the Vice-President is available ? A Chief of Army Staff B Speaker of Lok Sabha C Chief Justice of India D Defence Advisor of India Answer: Option [C]",
        "8 The power of the President of India to issue an ordinance is a : A Legislative power B Executive power C Constituent power D None of these Answer: Option [A]",
        "9 The resolution for removing Vice-President of India can be moved to the : A Joint sitting of Parliament B Rajya Sabha C Lok Sabha D None of these Answer: Option [B]",
        "10 When a Chief Minister of a State loses his eligibility to vote in Presidential election of India ? A He is yet to prove his majority on the floor of the lower house of the State Legislature B He is a member of the Upper House of the State Legislature C He himself is a candidate D He holds many other Ministries in his hand Answer: Option [B]",
        "11 Which of the following Standing Committees of Parliament has no MP from Rajya Sabha? A Estimates Committee B Public Accounts Committee C Committee on Public Undertakings D Committee on Government Assurances Answer: Option [A]",
        "12 For which period the Finance Commission is formed? A Every year B 2 years C 5 years D According to the wishes of Parliament Answer: Option [C]",
        "13 The minimum number of workers who can form a Trade Union and get it registered under Trade Union Act? A 7 B 11 C 25 D 50 Answer: Option [A]",
        "14 No money bill can be introduced in the Lok Sabha without the prior approval of the A Vice-President B Prime Minister C Finance Minister D President Answer: Option [D]",
        "15 The deciding authority of States share in central taxes is the A Finance Minister B Election Commission C Planning Commission D Finance Commission Answer: Option [D]",
        "16 When was the Public Service Commission, the original version of the U.P.S.C. set up? A 1st April, 1937 B 1st October, 1926 C 15th August, 1947 D 26th January, 1950 Answer: Option [B]",
        "17 Which of the following non-members of Parliament has the right to address it? A Chief Justice of India B Solicitor- General of India C Attorney-General of India D Chief Election Commissioner Answer: Option [C]",
        "18 Which authority recommends the principles governing the grants-in-aid of the revenues of the States out of the Consolidated Fund of India? A Finance Commission B Inter-State Council C Union Ministry of Finance D Public Accounts Committee Answer: Option [A]",
        "19 Who is competent to dissolve the Rajya Sabha? A The President B The Chairman, Rajya Sabha C The Joint-session of Parliament D No one Answer: Option [D] Rajya Sabha (the upper house of the Indian Parliament) is a permanent body.",
        "20 The Comptroller and Auditor General of India acts as the chief accountant and auditor for the A State Government B Union Government C Union and State Governments D Neither Union nor State Governments Answer: Option [C]",
        "21 To whom can a case of dispute in the election of the President of India be referred to? A Cabinet B Parliament C Election Commission D Supreme Court of India Answer: Option [D]",
        "22 The “Residuary Powers” (not mentioned in the Union, State or Concurrent lists of the Constitution) are vested in A President of India B State Legislature C Lok Sabha D Both Rajya Sabha and Lok Sabha Answer: Option [D]",
        "23 The Finance Commission is mainly concerned with recommending to the President about A Distributing net proceeds of taxes between the Centre and the States B Principles Governing the grants-in-aid to be given to States C Both (A) and (B) D Neither (A) and (B) Answer: Option [C]",
        "24 What is the maximum period upto which a proclamation issued by the President under Article 356 of the Constitution and approved/extended by the Parliament may, normally, remain in force? A Six months B One year C Two years D Unit is repealed by the Parliament Answer: Option [B]",
        "25 The function of Protem Speaker is to A check if the election certificates of members are in order B conduct the proceedings of the House in the absence of the Speaker C swearing in members and hold change till a regular Speaker is elected D officiate as Speaker when a Speaker is unlikely to be elected Answer: Option [C]",
        "26 Which among the following presides over the Lok Sabha in the absence of Speaker or Deputy Speaker of the Lok Sabha? A A senior most member of the House B A member appointed by the President C A person from the panel formed by the Speaker of the Lok Sabha D A member nominated by the members of the parliament present in the House Answer: Option [C]",
        "27 The Presidential Government operates on the principle of: A Separation of Powers B Balance of Powers C Centralization of Powers D Division of Powers between Centre and States Answer: Option [A]",
        "28 Who constitutes the Finance Commission after every five years? A The Comptroller and Auditor General B The Council of Ministers C The Parliament D The President Answer: Option [D]",
        "29 The President’s Rule is imposed on a State in India, when A The Elections are announced B The Governor of the State dies C The State Cabinet of Ministers resigns D There is a constitutional breakdown Answer: Option [D]",
        "30 Members of the Union Public Service Commission can be removed by the A President on recommendation from Central Administrative Tribunal B President on the basis of an inquiry and report by the Supreme Court C President on a unanimous recommendation from the Union Council of Ministers D Parliament after a resolution adopted with 2/3rds majority Answer: Option [B]",
        "31 In Indian Parliament, a bill may be sent to a select committee A After the first reading B After the second reading C After general discussion during second reading D At any stage at the discretion of the Speaker Answer: Option [D]",
        "32 Which is the source of political power in India? A We, the People B The Constitution C The Parliament D The Parliament and the State Legislatives Answer: Option [A]",
        "33 If the Election Commission is satisfied that a candidate has failed to lodge an account of election expenses, within the prescribed time and in the manner, for no good reason or justification, what is the period for which the EC can disqualify him to be a member or from continuing to be a member of the elected office from the date of the order? A 2 years B 3 years C 4 years D 5 years Answer: Option [B]",
        "34 The salaries and allowances payable to the Members of the Parliament are decided by the A Parliament B President C Cabinet D Finance Commission Answer: Option [A]",
        "35 The authority to prorogue the two Houses of the Parliament rests with the A Speaker B Prime Minster C Vice- President D President Answer: Option [D]",
        "36 Judges of the Supreme Court and High Court can be removed by A Parliament B The President C Union Council of Ministers D Chief Justice of the Supreme court Answer: Option [B]",
        "37 Who is the competent to dissolve the Parliament? A The President B By resolution in both Houses of Parliament C The Cabinet with the concurrence of the Leader of the Opposition D None of these Answer: Option [A]",
        "38 The Secretary General of the Lok Sabha is the Chief of its Secretariat and is: A Appointed by the President B Elected by the Lok Sabha C Appointed by the Speaker D Elected by both Houses of Parliament Answer: Option [C]",
        "39 To which of the following Bills the President must accord his sanction without sending it back for fresh consideration? A Money Bills B Ordinary Bills C Bill seeking amendment to the Constitution D Bills passed by both Houses of the Parliament Answer: Option [A]",
        "40 What is the period of appointment of the Comptroller and Auditor – General of India? A 6 years B Up to 65 years of age C Up to 64 years of age D 6 years or 65 years of age whichever is earlier Answer: Option [D]",
        "41 When the offices of both the President and Vice President of India are vacant, who will discharge their functions? A Chief Justice of India B Prime Minister C Chief Minister D The Speaker of the Lok Sabha Answer: Option [A]",
        "42 Who is eligible to cast the deciding vote over a bill in a Joint Parliamentary session? A Prime Minister B Speaker of Lok Sabha C Deputy Speaker of Lok Sabha D Chairman of the Rajya Sabha Answer: Option [B]",
        "43 The Electoral College that elects the President of India consists of A Members of the Lok Sabha and State Assemblies B Elected members of all the State Legislatures C Elected members of the Rajya Sabha and State Legislatures D Elected members of the Lok Sabha, Rajya Sabha and State Assemblies Answer: Option [D]",
        "44 The Balwant Rai Mehta Committee was associated with- A Panchayati Raj B Banking reforms C Industrial Policy D Centre-State relations Answer: Option [A]",
        "45 Who was the Chairman of the Drafting Committee of the Constitution? A J.L. Nehru B Rajendra Prasad C B.R. Ambedkar D J.B. Kripalani Answer: Option [C]",
        "46 Which Government agency is responsible for the mapping and exploration of minerals in India? A Survey of India B Geological survey of India C School of Mines D Minerals Development Corporation Answer: Option [B]",
        "47 Who was the First Speaker of Independent India’s Lok Sabha? A Rabi Ray B Hukam Singh C Bali Ram Bhagat D G.V. Mavalankar Answer: Option [D]",
        "48 In which country Financial Legislation is introduced in the Upper House of the Legislature? A Germany B Australia C France D Japan Answer: Option [A]",
        "49 The Vice- President of India is also the A Head of the State B Head of the Government C Speaker of Lok Sabha D Ex-officio Chairman of Rajya Sabha Answer: Option [D]",
        "50 The Bureaucracy performs A Only judicial functions B Only Legislature functions C Only administrative functions D Administrative as well as quasi-judicial and quasi-legislative functions Answer: Option [D]",
        "51 The President of the Union of India has the same constitutional authority as the A President of France B President of Pakistan C President of USA D British Monarch Answer: Option [D]",
        "52 A member of the Union Public Service Commission can be removed by the A President B Prime Minister C Chairman of the UPSC D Chief Justice of the Supreme Court Answer: Option [A]",
        "53 Who was the first Deputy Prime Minister of India? A Devi Lal B G. B. Pant C Morarji Desai D Vallabhbhai Patel Answer: Option [D]",
        "54 Who was the President of the Republic of India who consistently described Indian Secularism as ‘Sarva Dharma Samabhav’? A Dr. Zakir Hussain B Dr. S. Radhakrishnan C Gaini Zail Singh D Dr. Rajendra Prasad Answer: Option [B]",
        "55 Who is the Chief Law Officer of the Government of India? A The Chief Justice of India B The Law Minister of India C The Attorney General of India D The Registrar of the Supreme Court Answer: Option [C]",
        "56 Which is NOT a central Service? A Indian Revenue Service B Indian Audit & Accounts Service C Indian Foreign Service D Indian Police Service Answer: Option [D]",
        "57 Who is the highest civil servant of the Union Government? A Home Secretary B Cabinet Secretary C Attorney-General D Principal Secretary to the Prime Minister Answer: Option [B]",
        "58 Which functionary can be invited to give his opinion in the Parliament? A Chief Justice of India B Attorney-General of India C Chief Election Commissioner of India D Comptroller & Auditor General of India Answer: Option [B]",
        "59 The planning Commission of India is A Statutory body B A constitutional body C An independent and autonomous body D A non-statutory body Answer: Option [D]",
        "60 Being the non-member, who among the following can participate in the proceeding of either house of the Parliament without having right to vote? A President of India B Chief Justice of India C Attorney-General D Comptroller and Auditor General Answer: Option [C]",
        "61 Dr. Rajendra Prasad was elected as the first President of India by A Parliament B People of India C Electoral College D Constituent Assembly Answer: Option [D]",
        "62 The members of Estimates Committee are A Elected from Lok Sabha only B Elected from Rajya Sabha only C Nominated by the Speaker of the Lok Sabha D Elected from both Lok Sabha Rajya Sabha Answer: Option [A]",
        "63 Who is the chief advisor to the Governor? A President B Chief Minister C Speaker of the Lok Sabha D Chief Justice of Indian Supreme Court Answer: Option [B]",
        "64 The term of office of the member of the UPSC is A 4 years, or till they attain 58 years of age B 5 years, or till they attain 60 years of age C 6 years, or till they attain 65 years of age D 6 years Answer: Option [C]",
        "65 The authority which is not established by the constitutional provisions is A UPSC B Planning Commission C Election Commission D Finance Commission Answer: Option [B]",
        "66 Which one of the following President of India served for two terms? A V. V. Giri B Zakir Hussain C Rajendra Prasad D S. Radhakrishnan Answer: Option [C]",
        "67 By which Bill does the Government propose collection of revenues for a year? A Finance Bill B Economic Bill C Supplementary Bill D None of the above Answer: Option [A]",
        "68 The President of India enjoys emergency powers of A Two types B Three types C Four types D Five types Answer: Option [B]",
        "69 The Vice-President of India is elected by A The members of the Rajya Sabha B The members of the Parliament C The elected and nominated members of the Lok Sabha and Rajya Sabha D The members of the Parliament and State Legislature Answer: Option [C]",
        "70 When was the comprehensive reorganization of Indian States completed in accordance with the recommendations of States Reorganisation Commission? A 1953 B 1954 C 1955 D 1956 Answer: Option [D]",
        "71 Who is the constitutional head of the Government of India? A President B Prime Minister C Attorney General D Chief Justice of India Answer: Option [A]",
        "72 Who certifies a Bill to be a Money Bill in India? A President B Prime Minister C Finance Minister D Speaker of the Lok Sabha Answer: Option [D]",
        "73 In case the President wishes to resign, to whom he is to address his resignation letter? A Prime Minister B Vice President C Secretary of ok Sabha D Chief Justice of India Answer: Option [B]",
        "74 Which of the following are Financial Committee of Parliament in India? I. Public Accounts Committee II. Estimates Committee III. They provide security and longevity. A I and III B I and II C II and III D I, II and III Answer: Option [D]",
        "75 The convention that “once a speaker always a speaker” is followed in A UK B USA C France D India Answer: Option [A]",
        "76 The Sarkaria Commission was appointed to review the question of A Tribal areas B Legislative problems C Centre/state relations D Union territories problems Answer: Option [C]",
        "77 The English Crown is an example of A Nominated executive B Nominal executive C Quasi-real executive D Real executive Answer: Option [B]",
        "78 The annual report of the UPSC is submitted to A The President B The Supreme Court C The Prime Minister D The Chairman of the Union Public Service Commission Answer: Option [A]",
        "79 Finance Commission is constituted A Every year B Once in two years C Once in four years D Once in five years Answer: Option [D]",
        "80 National Income Estimates in India are prepared by A Planning Commission B Ministry of Finance C Central Statistical Organisation D Nation Development Council Answer: Option [C]",
        "81 The Council of Ministers does not include A Cabinet Ministers B Cabinet Secretary C Ministers of State D Ministers without Portfolio Answer: Option [B]",
        "82 How many times the President of India can seek re-election to his post? A Once B 2 times C 3 times D Any number of times Answer: Option [D]",
        "83 Which of the following appointments is not made by the President of India? A Chief of Army B Chief of Air Staff C Speaker of the Lok Sabha D Chief Justice of India Answer: Option [C]",
        "84 The Cabinet Committee on Economic Affairs has recently raised the emoluments of the President, the Vice-President and the Governors. The emolument payable to the President has been raised to A Rs. 1.00 lakh from Rs. 50.00 per month B Rs. 1.50 lakh from Rs. 50.00 per month C Rs. 1.75 lakh from Rs. 75.00 per month D Rs. 2.00 lakh from Rs. 1.00 lakh per month Answer: Option [B]",
        "85 For which period the Finance Commission is formed? A 3 years B 4 years C 5 years D 6 years Answer: Option [C]",
        "86 Only one of the following can be the ex-officio Chairman of the Planning Commission. He is the A Minister for Planning and Development B Finance Minister C Home Minister D Prime Minister Answer: Option [D]",
        "87 What is the tenure of the Prime Minister of India? A Five years B Conterminous with the tenure of the Lok Sabha C Conterminous with the tenure of the President D As long as he enjoys the support of a majority in the Lok Sabha Answer: Option [D]",
        "88 Which of the following is not a Panchayati Raj Institution? A Gram Sabha B Gram Panchayat C Nyaya Panchayat D Gram Cooperative Society Answer: Option [D]",
        "89 Which of the following is an extra-constitutional and non-statutory body? A Planning Commission B Finance Commission C Election Commission D Union Public Service Commission Answer: Option [A]",
        "90 The Finance Commission A Formulates Monetary Policy B Draws up Five Year Plans C Recommends pay revision of Central Government Employees D Adjudicates on the sharing of resources between Centre and the States Answer: Option [D]",
        "91 Rashtrapati Bhawan was designed by A Edwin Lutyens B Le Corbusier C Edward Stone D Tarun Dutt Answer: Option [A]",
        "92 Who held the office of the Vice President of India for two consecutive terms? A Mr. V.V. Giri B Dr. Shankar Dayal Sharma C Mr. R. Venkataraman D Dr. S. Radhakrishnan Answer: Option [D]",
        "93 When there is a vacancy in the office of the President and the Vice President at the same time, the office is held temporarily by A The Chief Justice of India B The Speaker of Lok Sabha C The Deputy Chairman of Rajya Sabha D A person nominated by both the Houses of Parliament Answer: Option [A]",
        "94 Who was the first Woman Governor of a State in free India From out of the following? A Mrs. Indira Gandhi B Mrs. Sucheta Kriplani C Mrs. Sarojini Naidu D Mrs. Vijay Laxmi Pandit Answer: Option [C]",
        "95 The Parliamentary Committee which scrutinizes the report of the Comptroller and Auditor General of India is A Select Committee B Estimates Committee C Public Accounts Committee D None of these Answer: Option [C]",
        "96 The Prime Minister of India is A Selected B Nominated C Appointed D Elected Answer: Option [C]",
        "97 Which is not an All India Service? A Indian Forest Service B Indian Foreign Service C Indian Police Service D Indian Administration Service Answer: Option [B]",
        "98 Sarkaria Commission was concerned with A Centre-State relations B Financial Reforms C Electoral Reforms D Administrative Reforms Answer: Option [A]",
        "99 A Presidential Ordinance can remain in force A For three months B For six months C For nine months D Indefinitely Answer: Option [B]",
        "100 Who can initiate impeachment of the President? A 1/4th members of either House of Parliament B Half of the members of either House of Parliament C Half of the State Legislatures D 1/3rd members of any State Legislature Answer: Option [A]"
    ]
}