{
    "Topic": "Indian Polity",
    "Subject": "Union Legislature",
    "data": [
        "1 Which state of India has highest number of Lok Sabha constutiencies? A Bihar B Madhya Pradesh C Uttar Pradesh D Madhya Pradesh Answer: Option [C]",
        "2 The system is used to elect members of the Rajya Sabha: A Cumulative vote system B Single non-transferable vote system C Single transferable vote system D None of the above Answer: Option [C]",
        "3 What is zero hour in parliament? A When the proposal of the opposition is considered B The first hour of the session C When matters of utmost importance are raised D When a money bill is introduced in the Lok Sabha Answer: Option [C]",
        "4 Which of the following is true about chairman of Public Accounts Committee? A Elected by Union Cabinet B Appointed by Speaker C Appointed by President D Elected by members of the Public Accounts Committee Answer: Option [B]",
        "5 With regard to the powers of the Rajya Sabha, which one among the following statements is not correct? A A money bill cannot be introduced in the Rajya Sabha B The Rajya Sabha has no power either to reject or amend a money bill C The Rajya Sabha cannot discuss the annual financial statement D The Rajya Sabha has no power to vote on the demands for grants Answer: Option [C]",
        "6 Which is the largest committee of the Parliament? A The Public Accounts Committee B The Estimates Committee C The Committee on Public Undertakings D The Committee on Petitions Answer: Option [B]",
        "7 The minimum age for being the member of Parliament is: A 21 Years B 25 Years C 28 Years D 30 Years Answer: Option [B]",
        "8 What is the minimum age for election/appointment as member of the Rajya Sabha? A 21 Years B 25 Years C 30 Years D 35 Years Answer: Option [C]",
        "9 When the joint sittings of the two houses of Parliament are held? A To elect the President of India B To elect the Vice-President of India C To adopt a Constitution amending bill D To consider and pass a bill on which two houses disagree Answer: Option [D]",
        "10 The maximum possible gap between two sessions of Parliament is: A 3 months B 4 months C 6 months D 9 months Answer: Option [C]",
        "11 Postal voting is otherwise called: A Proxy voting B Secret voting C Plural voting D Weighted voting Answer: Option [A]",
        "12 Stability of the Government is assured in: A Direction Democracy B Plural Executive System C Presidential From of Government D Parliamentary From of Government Answer: Option [C]",
        "13 How many members of the State Legislative Council are elected by the Assembly? A 1/3th of the members B 1/6th of the members C 1/12th of the members D 5/6th of the members Answer: Option [A]",
        "14 In case of a disagreement between the two Houses of Parliament over a non-money bill: A The bill will lapse B The President may sign it into a law C The President may ask both the Houses to reconsider it. D The President may call a joint sitting of both the Houses to consider it. Answer: Option [D]",
        "15 A money bill passed by the Lok Sabha is deemed to have been passed by the Rajya Sabha also when no action is taken by the Upper House within: A 10 days B 14 days C 18 days D 22 days Answer: Option [B]",
        "16 What can be the maximum interval between two Sessions of Parliament? A Three months B Four months C Six months D Nine months Answer: Option [C]",
        "17 The Committee appointed in 1977 to review working of the Panchayati Raj was chaired by: A Ashok Mehta B K.N. Katju C Jagjivan Ram D Balwant Rai Mehta Answer: Option [A]",
        "18 What is the implication of the Central Government granting “Special Status” to a State? A The extent of loan as a percentage of total assistance will be low B Substantially large percentage of the central assistance will be as grants-sin-aid C Current account budgetary deficit will be bridged by the Central Government D Both (A) and (B) above Answer: Option [D]",
        "19 Bills of which of the following categories can be initiated only in Lok Sabha? A Money Bill B Ordinary Bill C Private Members Bill D Constitution Amendment Bill Answer: Option [A]",
        "20 How many legislative excesses of Parliament and Assemblies checked? A General elections B Judicial review C No Confidence motions D Intervention from President/Governor Answer: Option [B]",
        "21 In which state of India is there a uniform civil code? A Goa B Haryana C Kerala D Meghalaya Answer: Option [A]",
        "22 The Legislative Council in a state in India may be created or abolished by the A Parliament B President on the recommendation of the Governor C Governor on a recommendation by the State Cabinet D Parliament after the State Legislative Assembly passes a resolution to that effect Answer: Option [D]",
        "23 Rajya Sabha enjoys more powers than the Lok Sabha in the case of A Money Bills B Non-money Bills C Setting up of new All India Services D Amendment of the Constitution Answer: Option [C]",
        "24 Which of the following is not an administrative function of a Village Panchayat? A Maintenance of road B Providing college education C Providing sanitation and drainage D Providing burial and cremation grounds Answer: Option [B]",
        "25 The first woman film star nominated to the Rajya Sabha was A Meena Kumari B Madhubala C Shabana Azmi D Nargis Dutt Answer: Option [D]",
        "26 What is the composition of the Electoral College for the election of Vice-President of India? A Members of Rajya Sabha only B Members of both Houses of Parliament C Elected members of Lok Sabha and Rajya Sabha D Elected members of Lok Sabha, Rajya Sabha and State Legislative Assemblies Answer: Option [C]",
        "27 The first State in India to implement Panchayati Raj System was A Rajasthan B Punjab C Gujarat D Uttar Pradesh Answer: Option [A]",
        "28 Division of powers is the principle of A Republican form of Government B Socialist form of Government C Federal form of Government D Unitary form of Government Answer: Option [C]",
        "29 Indian Parliament includes: A Only Lok Sabha B President and Lok Sabha C Lok Sabha and Rajya Sabha D President, Lok Sabha and Rajya Sabha Answer: Option [D]",
        "30 Which among the following court has the original jurisdiction to hear petition and give decision challenging election of the Lok Sabha/Vidhan Sabha? A Supreme Court B High Court of the State C District Court of a constituency D Special Judge authorized by the Chief Justice of India Answer: Option [B]",
        "31 The item ‘Education’ belongs to the A State List B Union List C Concurrent List D Residuary Subjects Answer: Option [C]",
        "32 The joint session of the two Houses of Parliament is convened A Only in case of national emergency B When a bill passed by one House is rejected by the other House C Taxes approved by one House are rejected by the other House D Both (B) and (C) Answer: Option [D]",
        "33 An Ordinary bill passed by the State Assembly can be delayed by the Legislative Council for a maximum period of A 2 month B 3 month C 4 month D 5 month Answer: Option [C]",
        "34 Which of the following is the biggest head of non-plan expenditure of Government of India? A Defence B Subsidies C Salaries and Wages D Interest payments Answer: Option [D]",
        "35 Resources transferred from the Government of India to States are termed ‘statutory’ if they are made A In the form of loans B In the form of grants C On the recommendations of the Finance Commission D On the recommendations of the Planning Commission Answer: Option [C]",
        "36 Which city in India is the first to use municipal wastes to generate power? A Chennai B Delhi C Mumbai D Kolkata Answer: Option [B]",
        "37 Which of the following States was first to adopt the Panchayati Raj? A Rajasthan B Punjab C Gujarat D Uttar Pradesh Answer: Option [A]",
        "38 Indian Parliament can rename or redefine the boundary of a State by A Absolute majority B A simple majority C 2/3rd majority of the members voting D 2/3rd majority of the members voting and an absolute majority of its total membership Answer: Option [B]",
        "39 Which of the following Indian States first adopted the 3-tier Panchayati Raj system? A Bihar B Assam C Rajasthan D Gujarat Answer: Option [C]",
        "40 Elections to the House of the People and the legislative assemblies of States in India are held on the basis of: A Adult franchise B Limited suffrage C single transferable vote D Proportional representation Answer: Option [A]",
        "41 Which amidst the following States has Legislative Council? A Punjab B Bihar C Orissa D West Bengal Answer: Option [B]",
        "42 When was zero hour introduced in the parliamentary affairs in India? A 1962 B 1972 C 1982 D 1992 Answer: Option [A]",
        "43 Vote-on account means A Statutory acceptance of money bill B Statutory acceptance of planning bill C Statutory acceptance of report of account checking and documents produced by CAG D Statutory acceptance of expenditure related to demands of grants till the passage of planning bill Answer: Option [D]",
        "44 The maximum number of members of Lok Sabha and Rajya Sabha has been fixed by the Constitution of India respectively as A 500 and 250 B 525 and 270 C 545 and 250 D 565 and 255 Answer: Option [C]",
        "45 Which are the two States (other than UP) having the highest representation in Lok Sabha? A Bihar and Maharashtra B Bihar and Madhya Pradesh C Tamil Nadu and Rajasthan D Karnataka and Andhra Pradesh Answer: Option [A]",
        "46 Which of the following taxes is exclusively and totally assigned to the Central Government by the Constitution? A Sales Tax B Corporation Tax C Estate Duty D Taxes on Railway Fares and Freights Answer: Option [B]",
        "47 Representation of any state in Rajya Sabha is according to A Area of the state B Population of the state C Fixed number of candidates from each state D Number of representatives in Lok Sabha from the state Answer: Option [B]",
        "48 Who can be the member of the Rajya Sabha but can speak both in Rajya Sabha and Lok Sabha? A The deputy Chairman of Rajya Sabha B Nominated members of the Rajya Sabha C Leader of the House in the Rajya Sabha D Ministers who are members of the Rajya Sabha Answer: Option [D]",
        "49 How many members of the Rajya Sabha are nominated by the President? A Five B Ten C Twelve D One-fifth of the total members Answer: Option [C]",
        "50 The Speaker of the Lok Sabha is elected by the A President B Prime Minister C Members of Lok Sabha D Members of both Houses of Parliament Answer: Option [C]",
        "51 The President of India is elected by A Members of both houses of Parliament B Members of both Houses of Parliament and of State Legislatures C Members of both houses of Parliament and of state legislative assemblies D Elected members of both houses of Parliament and elected members of State legislative assemblies Answer: Option [D]",
        "52 A motion moved by a member in a legislature when it is desired to have a discussion on a matter of urgent public importance is called A Cut motion B Adjournment motion C No-confidence motion D None of these Answer: Option [B]",
        "53 No Government Expenditure can be incurred in India except with the sanction of A The President B The Prime Minister C The Parliament D The Supreme Court Answer: Option [C]",
        "54 When does Lok Sabha or a Vidhan Sabha election candidate forfeit his security deposit? A When he fails to secure even 1/6 of total votes polled B When he fails to secure even 1/5 of total votes polled C When he fails to secure even 1/4 of total votes polled D When he fails to win the election Answer: Option [A]",
        "55 Name the President of India who was elected unopposed A Dr. Zakir Husain B Dr. Fakhruddin Ali Ahmed C Dr. Shankar Dayal Sharma D Dr. Neelam Sanjiva Reddy Answer: Option [D]",
        "56 A candidate, to become a member of the Rajya Sabha, should not be less than A 25 years of age B 30 years of age C 32 years of age D 35 years of age Answer: Option [B]",
        "57 The Union Parliament consists of A The President of India B The House of the People (Lok Sabha) C The Council of States (Rajya Sabha) D All of the above Answer: Option [D]",
        "58 The maximum strength of the elected members of the House of the People (Lok Sabha) is A 530 B 545 C 550 D 555 Answer: Option [B]",
        "59 How many readings does a non-money bill have in each House of the Parliament? A One B Two C Three D Four Answer: Option [C]",
        "60 Money bill can be introduced in the State Legislative Assembly with the prior permission of the A Governor of the State B Chief Minister of the State C Finance Minister of the State D Speaker of Legislative Assembly Answer: Option [A]",
        "61 The Prime Minister who was voted out of power by the Parliament was A V.P. Singh B Indira Gandhi C Morarji Desai D Chandrashekhar Answer: Option [A]",
        "62 The Indian Parliament is competent to enact law on a State subject if A The President sends such a message to Parliament B Emergency under Article 352 is in operation C All the state Assemblies of the country make such a request D None of these Answer: Option [B]",
        "63 A national political party is one which received 4% of the total votes polled in A The capital city B Two or more States C Four or more States D In all the States Answer: Option [C]",
        "64 A Bill referred to a ‘Joint Sitting of the two Houses of the Parliament is required to be passed by A A simple majority of the members present B Absolute majority of the total membership C 2/3rd majority of the members present D 3/4th majority of the members present Answer: Option [A]",
        "65 The Rajya Sabha is dissolved after A Every five years B Every six years C On the advice of the Prime Minister D None of the above Answer: Option [D]",
        "66 Which party provided two Prime Ministers in two years time? A B.J.P. B Janata Party C Janata Dal D Samajwadi Janata Party Answer: Option [B]",
        "67 The first mid-term elections for Lok Sabha were held in A 1962 B 1965 C 1971 D 1975 Answer: Option [C]",
        "68 The ‘Speaker’s vote’ in the Lok Sabha is called A Indirect vote B Direct vote C Sound vote D Casting vote Answer: Option [D]",
        "69 To be a regional party the minimum percentage of votes, that a party needs to secure in any election is A 1% B 2% C 3% D 4% Answer: Option [C]",
        "70 The most important feature of the Indian Parliament is that A It is bicameral in nature B It also comprises the President C It is the Union Legislature in India D The Upper House of the Parliament is never dissolved Answer: Option [D]",
        "71 The 3-tier of the Panchayati Raj System consists of A Gram Sabha, Panchayat Samiti, Zilla Parishad B Gram Sabha, Anchal Panchayat, Panchayat Samiti C Janapad Panchayat, Taluka Panchayat, Anchal Panchayat D Gram Panchayat, Block and Panchayat Samiti, Zilla Parishad Answer: Option [A]",
        "72 The two forms of democracy are A Parliamentary and King B Monarchical and Republican C Direct and indirect D Parliamentary and Presidential Answer: Option [D]",
        "73 Despotism is possible in a A One party state B Two party state C Multi party state D Two and Multi party state Answer: Option [A]",
        "74 The Speaker of the Lok Sabha has to address his/her letter of resignation to A President of India B Prime Minister of India C Deputy Speaker of Lok Sabha D Minister of Parliamentary Affairs Answer: Option [C]",
        "75 How many members of the Anglo-Indian community can be nominated by the President of India to the Parliament? A 1 B 2 C 3 D 4 Answer: Option [B]",
        "76 In which State of India, was a non-Congress government formed for the first time? A Kerala B Pondicherry C Tamil Nadu D West Bangle Answer: Option [A]",
        "77 How many members of the Rajya Sabha retire from the house every 2 years? A 1/6 of the total members B 1/3 of the total members C 1/12 of the total members D 5/6 of the total members Answer: Option [B]",
        "78 How many times was the term of the Lok Sabha extended upto 6 years? A Once B Twice C Thrice D Never Answer: Option [A]",
        "79 Among the tax revenues of the Union Government, the most important source is A Income Tax B Customs Duty C Corporation Tax D Union Excise Duties Answer: Option [D]",
        "80 Which is not the concern of the local government? A Sanitation B Public-Health C Law and Order D Public Utility Services Answer: Option [C]",
        "81 What is the maximum strength prescribed for State Legislative Assemblies? A 400 B 450 C 500 D 550 Answer: Option [C]",
        "82 A member of Parliament will lose his membership of Parliament if he is continuously absent from Sessions for A 45 days B 60 days C 90 days D 365 days Answer: Option [B]",
        "83 Which innovative discussion process is introduced by the Indian parliament to the World Parliamentary systems? A Zero hour B Question Hour C Resolutions D Presidential Speech Answer: Option [A]",
        "84 Indian Parliament means A Rajya Sabha – Lok Sabha B Rajya Sabha – Lok Sabha – Prime Minister C President of India - Rajya Sabha – Lok Sabha D President of India – Vice President of India - Lok Sabha - Rajya Sabha Answer: Option [C]",
        "85 The three-tier Panchayat Raj system in India was proposed by the – A Balwant Rai Mehta Committee B Royal Commission C Ashok Mehta Committee D None of the above Answer: Option [A]",
        "86 Which one of the following is the popularly elected House of the Indian Parliament? A Lok Sabha B Rajya Sabha C Lok Sabha as well as Rajya Sabha D None of the above Answer: Option [A]",
        "87 Which one of the following methods is used to ascertain the public opinion on important legislation? A Recall B Referendum C Initiative D None of the above Answer: Option [C]",
        "88 Compared with Society, the scope of State activity is A Narrow B Wider C Just equal D No comparison between the two Answer: Option [B]",
        "89 The States in India are demanding greater autonomy from the Centre in the _______ field. A Financial B Legislative C Administrative D All the above Answer: Option [D]",
        "90 A joint sitting of the two Houses of Indian Parliament is presided over by the A President of India B Speaker of the Lok Sabha C Vice President of India D Attorney-General of India Answer: Option [B]",
        "91 What is the maximum number of starred questions that can be asked in Lok Sabha on a particular day? A 15 B 20 C 25 D No limit Answer: Option [B]",
        "92 The Council of Ministers in a State is collectively responsible to A The Governor B The Chief Minister C The President of India D The Legislative Assembly Answer: Option [D]",
        "93 Rajya Sabha being a permanent house A One-half of its members retire every three years B One-third of its members retire every two years C One-fifth of its members retire every years D One-sixth of its members retire every years Answer: Option [B]",
        "94 In which State does the Governor nominate women to the Assembly? A Sikkim B Manipur C Nagaland D Jammu & Kashmir Answer: Option [D]",
        "95 The Joint Session of both the Houses of Parliament is summoned by A President B Prime Minister C Chairman of Rajya Sabha D Speaker of the Lok Sabha Answer: Option [A]",
        "96 In a federal Government the states enjoy A Original powers B Powers given by the people C Powers given by the Constitution D Powers delegated by the Centre Answer: Option [C]",
        "97 What is the duration of membership of State Legislative Councils? A 4 years B 6 years C 8 years D 10 years Answer: Option [B]",
        "98 The Residuary powers of the Indian Union are A Vested with the Centre B Vested with the States C There are no residuary powers D They are distributed between the centre and the states. Answer: Option [A]",
        "99 A mid-term poll is conducted when A All MP’s of a political party resign B There are discrepancies in voting C An elected member resigns from his seat D A the Lok Sabha is dissolved before completion of its term Answer: Option [D]",
        "100 A proclamation of emergency caused by war or external aggression must be approved by both the Houses of Parliament within A 25 days B 1 month C 45 days D 3 months Answer: Option [B]"
    ]
}