{
    "Topic": "Indian Economy",
    "Subject": "World Organizations",
    "data": [
        "21 The main function of the World Trade Organisation (WTO) is: A Enforcing of Uruguay Round Agreements B Administering trade dispute settlement procedures C Facilitating multi-lateral trade relations of member countries and reviewing trade policies D None of the above Answer: Option [C]",
        "22 The Secretary – General of the UNO is appointed by the: A World Bank B Trusteeship Council C Security Council D General Assembly Answer: Option [D]",
        "23 Special Drawing Rights (SDR) facility is available at A World Bank (IBRD) B International Monetary Fund (IMF) C International Development Association (IDA) D Organisation of Economic Cooperation and Development (OECD) Answer: Option [B]",
        "24 The UN Secretary-General holds office for a period of A 3 years B 4 years C 5 years D 6 years Answer: Option [C]",
        "25 In which year did the UN General-Assembly adopt the Universal Declaration of Human Rights? A 1945 B 1948 C 1952 D 1955 Answer: Option [B]",
        "26 The International Criminal Police Organisation (INTERPOL) has its headquarters at A Montreal B Bonn C Paris D London Answer: Option [C]",
        "27 Which Indian city has been chosen by the World Bank for setting up its back office operations? A Bangalore B Chennai C Kolkata D New Delhi Answer: Option [B]",
        "28 Which from the following countries is not a member of the European Union? A Lithuania B Finland C Sweden D Norway Answer: Option [D]",
        "29 Where is headquarters of European Union located? A Bonn B Brussels C London D Paris Answer: Option [B]",
        "30 Where is the headquarters of Botanical Survey of India located? A Kolkata B Lucknow C Ootacmund D Darjeeling Answer: Option [A]",
        "31 The International Court of Justice site in A Hague B Geneva C Rome D Vienna Answer: Option [A]",
        "32 Which institution is known as ‘soft loan window’ of the World Bank? A Indian Development Forum B International Monetary Fund C International Development Agency D International Finance Corporation Answer: Option [C]",
        "33 How many permanent members are there in the Security Council? A Three B Four C Five D Six Answer: Option [C]",
        "34 Under the rules of the IMF, each member is required to declare the par value of its legal tender money in terms of U.S. dollars and A Gold B Silver C Diamond D Pound sterling Answer: Option [A]",
        "35 As required by the WTO agreement, the Indian Patent Act was amended in 1999. The Act first came into force in the year A 1965 B 1970 C 1975 D 1980 Answer: Option [B]",
        "36 Which country from the following is a permanent member of UN Security Council? A Japan B Ukraine C Switzerland D People’s Republic of China Answer: Option [D]",
        "37 The Headquarters of the Food and Agricultural Organisation (FAO) is at A Rome B Paris C Geneva D New York Answer: Option [A]",
        "38 The United Nations officially came into existence on A January 1, 1942 B October 3, 1944 C October 24, 1945 D June 26, 1945 Answer: Option [C]",
        "39 What is the full form of NATO? A North Atlantic Treaty Organisation B North Asian Treaty Organisation C North American Treaty Organisation D North African Treaty Organisation Answer: Option [A]",
        "40 The non-permanent members of the Security Council are elected for A One year B Two years C Three years D Six months Answer: Option [B]",
        "41 The world Bank normally gives: A Short-term loans B Medium-term loans C Long-term loans D Medium and long-term loans Answer: Option [B]",
        "42 Structural adjustment loans given by the World Bank are meant for: A Encouraging capital-intensive industries B Reducing inequalities of income distribution C Increasing employment in agriculture D Increasing export-earning capacity of the borrower country Answer: Option [A]",
        "43 Which country decided to join the United Nations, as a Member, on the basis of the results of a referendum held in the country? A Finland B Austria C Switzerland D Belgium Answer: Option [C]",
        "44 Which one of the following organisations is not having its headquarters in Geneva? A World health Organisation B World Trade Organisation C International Labour Organisation D International Civil Aviation Organisation Answer: Option [D]",
        "45 The first Secretary-General of the United Nations was A U. Thant B Dr. Kurt Waldheim C Trygve Lie D Dag Hammarskjold Answer: Option [C]",
        "46 The Headquarters of International Labour Organisation is located at A Geneva B Rome C Paris D New York Answer: Option [A]",
        "47 Which International Agency is working for the protection of the environment? A UNO B NASA C Chipko D Greenpeace Answer: Option [D]",
        "48 Which one of the following organisations is directly related to child welfare? A WTO B WHO C UNICEF D UNESCO Answer: Option [C]",
        "49 Where is the headquarters of INTERPOL? A Geneva B Lyons C London D Paris Answer: Option [B]",
        "50 Non-alignment basically implies A Bring a third world power B Choosing its own policy C Neutrality towards power blocks D Bringing peace and unity to the world Answer: Option [C]"
    ]
}